{"data":{"wordpressPost":{"title":"BeatsX are shit","content":"\n\t\t\t\t\n<!--more-->\n\n\n\n<p>I don&#8217;t usually write about products but I&#8217;m so fed up with the BeatsX earphones that I need to tell others about it. In the one and a half years that I&#8217;ve owned them, they&#8217;ve broken <strong>three times</strong>﻿. Luckily I haven&#8217;t had to pay for a single repair, but the process of exchanging it is starting to become time consuming and really annoying.</p>\n\n\n\n<p>I purchased my BeatsX back in February 2017. I fell in love with them right away; the wirelessness meant I didn&#8217;t have to deal with tangling cords, and because they were in-ear I could listen to podcasts even on loud commutes.</p>\n\n\n\n<p>Little did I know how fragile they were. Let me tell you about my BeatsX woes&#8230;</p>\n\n\n\n<h3>Incident #1: November 2017</h3>\n\n\n\n<p>The first time my BeatsX broke was when I was in Japan. All of a sudden it stopped connecting to any of my devices. I later found out that this was a common issue, as I saw multiple threads on Reddit and Apple Support forum posts about it. On this same trip both my iPhone (camera stopped working) and Macbook (battery stopped charging) had broken so I was already pretty pissed off.</p>\n\n\n\n<p>I couldn&#8217;t take them for repairs anywhere in Naha so I had to wait until I got home to Montreal before I could do anything. I also refused to buy one of those overpriced 3.5mm-to-Lightning adapters. All of this made for an extremely boring plane ride back to Montreal.</p>\n\n\n\n<div class=\"wp-block-image border--gray\"><figure class=\"aligncenter\"><img src=\"http://localhost:9999/wp-content/uploads/2018/08/work-authorization-1-1.png\" alt=\"\" class=\"wp-image-6759\"/></figure></div>\n\n\n\n<h3>Incident #2: March 2018</h3>\n\n\n\n<p>Several months had gone by and I had almost forgotten about the first incident, when suddenly the right earbud started to crackle. Shortly after the right earbud stopped working entirely, and I had to make yet another trip to the Apple Store.</p>\n\n\n\n<div class=\"wp-block-image border--gray\"><figure class=\"aligncenter\"><img src=\"http://localhost:9999/wp-content/uploads/2018/08/work-authorization-2-1.png\" alt=\"\" class=\"wp-image-6760\"/></figure></div>\n\n\n\n<p>Thankfully, the Apple staff replaced my headphones free of charge because I&#8217;d just gotten them replaced in November.</p>\n\n\n\n<h3>Incident #3: July 2018</h3>\n\n\n\n<p>The third incident happened again while I was traveling, this time in Toronto. Once again, the right earbud started crackling and lost output.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"http://localhost:9999/wp-content/uploads/2018/08/repair-status-1.png\" alt=\"\" class=\"wp-image-6785\"/></figure>\n\n\n\n<p>I called Apple support and luckily the Apple support staff was super understanding. He offered to send me a new pair even though mine were out of warranty by a long shot. The silver lining in all of this is that Apple&#8217;s support is awesome.</p>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<p>I&#8217;m so disappointed with the quality of the BeatsX. They are awesome when they work but it really sucks having to get them replaced so often. For ~$200 CAD I shouldn&#8217;t have to worry about them breaking all the time.</p>\n\n\n\n<p>If you&#8217;re considering buying a pair of BeatsX earphones, I&#8217;d think twice. They are fragile as hell and break even with regular use.</p>\n\n\n\n<h3>Update: October 11, 2018</h3>\n\n\n\n<p>Welp. The replacement that I got in July just broke. The left channel stopped working. I called Apple Support and they said it&#8217;ll be $79 to replace. </p>\n\n\n\n<p>At this point I&#8217;m done with these pieces of shit. If anybody has recommendations for good wireless headphones, please let me know.</p>\n\t\t","wordpress_id":6751},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"beatsx-are-shit","wordpressId":6751,"previousPost":{"slug":"august-2018-big-30-in-nyc-edition","wordpress_id":6810},"nextPost":{"slug":"july-2018-its-too-friggin-hot-edition","wordpress_id":6656}}}