{"data":{"wordpressPost":{"title":"Book Goals (end of 2017 update)","content":"<html><head></head><body><p>\t\t\t\tBack in June I wrote <a href=\"/book-goals-mid-2017-update/\">a post</a> about the books I&#x2019;ve been reading. In this post I share the books that I read in the latter half of 2017.</p>\n<p><!--more--></p>\n<h2>Sirens of Titan</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Sirens-Titan-Novel-Kurt-Vonnegut/dp/0385333498\"><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2017/12/61bgCL5RtTL.jpg\"></a></p>\n<p>I&#x2019;ve been wanting to read this Vonnegut classic for a long time. I was a big fan of <em>Slaughterhouse Five</em>, so I knew I was in for a treat.</p>\n<p>It&#x2019;s a little difficult to describe the plot of Sirens of Titan without giving anything away, but it involves a Martian invasion and touches on themes like free will and the purpose of human beings. It had some great plot twists and the ending hit me right in the feels. The overarching story reminded me a bit of the anime <a href=\"https://en.wikipedia.org/wiki/Code_Geass\">Code Geass</a>, which is a very good thing.</p>\n<p><strong>9/10: Solid scifi read</strong></p>\n<h2>Toxic Charity: How the Church Hurts Those They Help and How to Reverse It</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Toxic-Charity-Churches-Charities-Reverse/dp/0062076213/\"><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2017/12/412O3XHlTyL._SY445_QL70_.jpg\"></a></p>\n<p>In Toxic Charity, author Robert Lupton explains how many examples of how charities often ending up doing more harm than good. He explains how charities often give away money and goods blindly to those in need, and this creates a toxic relationship between the giver and the receiver. Oftentimes the sentiment of the receiver quickly devolves from gratitude to expectation and finally entitlement.</p>\n<p>He also goes into detail about how destructive church mission trips are to the locals. Mission group members may have good intentions but they end up taking away jobs from locals who can do the same job just as well or better. He argues that mission trips mostly benefit the mission groups more than they benefit the locals.</p>\n<p><em>Toxic Charity</em> isn&#x2019;t all just criticism though. Lupton provides a lot of solutions on how charities can be run properly to benefit the receivers.</p>\n<p>I really enjoyed this book and it got me thinking about what I can do to help the less fortunate.</p>\n<p><strong>8/10: insightful read if you want to learn about charities</strong></p>\n<h2>Ready Player One</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Ready-Player-One-Ernest-Cline/dp/0307887448\"><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2017/12/61d6DhRCBSL._SX322_BO1204203200_.jpg\"></a></p>\n<p>Ready Player One is a sci-fi adventure that takes place in the not-so-distant future where everyone spends their lives in a virtual reality world called the Oasis, created by a genius programmer named James Halliday. The story follows Wade Watts, a teenage boy who sets out to discover an easter egg in the Oasis left behind by Halliday. The first user to discover the easter egg would inherit a massive amount of fortune.</p>\n<p>I really enjoyed this book, even though it was really cheesy at times. Some of the things that Wade would say to his ladycrush is /r/cringe material, but he&#x2019;s an awkward teenager so I guess it&#x2019;s okay (I&#x2019;ve been there too&#x2026;). The references to retro video games and Japanese shows like Ultraman tugged at my nostalgia strings.</p>\n<p><strong>8/10: Exciting page-turner with massive amount of nostalgia</strong></p>\n<h2>Shoe Dog</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Shoe-Dog-Memoir-Creator-Nike/dp/1501135910\"><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2017/12/51yDI-SlwFL._SX329_BO1204203200_.jpg\"></a></p>\n<p>Shoe Dog is the autobiography of Phil Knight, the founder of Nike. It was a real page-turner; something I did not expect from an autobiography. Phil Knight&#x2019;s journey to creating Nike was a real rollercoaster ride. As soon as something good happened, something else would shit the bed. I really enjoyed reading about his early interactions with the Japanese businessmen of Onitsuka Tiger too.</p>\n<p>It bums be out though that the reviews and comments about this book are riddled with accusations of Nike&#x2019;s child labor practices. Knight comments on this briefly, admitting to some mistakes he&#x2019;d made but it&#x2019;s not very clear how intentional he was with his decisions. I&#x2019;ll need to do a bit more reading from other sources on this.</p>\n<p><strong>9/10: solid autobiography.</strong></p>\n<h2>Wealthing Like Rabbits</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Wealthing-Like-Rabbits-Original-Introduction-ebook/dp/B00N06271Q/\"><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2017/12/wealthing-like-rabbits.jpg\"></a></p>\n<p>Around this time I started getting really interested in personal finance. I found out about <em>Wealthing Like Rabbits</em> in the <a href=\"https://www.reddit.com/r/PersonalFinanceCanada/\">/r/PersonalFinanceCanada</a> subreddit.</p>\n<p><em>Wealthing Like Rabbits</em> was a very quick, bite-sized and informative read. It also helps that the author has a great sense of humour and provide really concrete examples on how to save money.</p>\n<p>Below are some key takeaways from this book:</p>\n<ul>\n<li>Max out your RRSP and TFSA as soon as possible</li>\n<li>Start investing as early as possible</li>\n<li>Use the power of compounding interest</li>\n<li>Avoid buying a car if possible</li>\n<li>Don&#x2019;t spend so much money on weddings like most people do</li>\n</ul>\n<p><strong>10/10: Must-read for personal finance noobies like me</strong></p>\n<h2>Millionnaire Teacher</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Millionaire-Teacher-Wealth-Should-Learned/dp/1119356296\"><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2017/12/51uFr8XiRfL.jpg\"></a></p>\n<p><em>Millionaire Teacher</em> was an excellent follow-up to <em>Wealthing Like Rabbits</em>. It reinforced a lot of ideas from the latter but went into more detail about investing.</p>\n<p>Author Andrew Hallam drives home the point that index funds are ALWAYS a better bet than mutual funds for a myriad reasons. One of them being mutual funds are actively managed by humans, so they are prone to errors and rash emotional decisions, as well as unnecessary fees. On the flipside, index funds have a very steady and consistently growing track record.</p>\n<p>After reading these two books, I feel slightly less stupid when talking with my financial advisor. There&#x2019;s still a lot to learn about personal finance.</p>\n<p><strong>10/10: Excellent complement to Wealthing Like Rabbits.</strong></p>\n<h2>Sum: 40 Tales From The Afterlives</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Sum-Tales-Afterlives-David-Eagleman/dp/0143172158\"><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2017/12/6580453.jpg\"></a></p>\n<p><em>Sum: 40 Tales From The Afterlives</em> is a collection of short stories about what happens when you die. I read this book back in 2014, but decided to re-read because it&#x2019;s so damn good.</p>\n<p>I first picked this up around the time Flying Lotus&#x2019; album &#x201C;You&#x2019;re Dead&#x201D; came out. That album had a weird effect on me. It got me thinking a lot about death and how maybe it&#x2019;s not as scary as we think (watch <a href=\"https://www.youtube.com/watch?v=2lXD0vv-ds8\">this music video</a> and tell me you don&#x2019;t think the same!). <em>Sum</em> was a perfect complement to this album.</p>\n<p>The stories in <em>Sum</em> evoke feelings of bliss, regret, fear, and a sense of how insignificant humans are in the grand scheme of the universe. It&#x2019;s a real rollercoaster ride of emotions.</p>\n<p><strong>10/10: Awesome collection of goosebumps-inducing short stories.</strong></p>\n<h2>Homo Deus</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Homo-Deus-Brief-History-Tomorrow-ebook/dp/B01D7CLUP6\"><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2017/12/41EGZmlah3L.jpg\"></a></p>\n<p>After kicking off my reading marathon earlier this year with <em>Sapiens</em>, I felt it was appropriate to end it with its sequel, Homo Deus.</p>\n<p>Homo Deus starts off by talking about how humankind has historically had three main threats: war, famine, and plague, and how for the most part they&#x2019;ve all been conquered today. It then explores the many new threats that humankind will face in the upcoming centuries.</p>\n<p>Some of these threats include: the destruction of the environment, the creation of a new class of super-humans, robots taking over, and the loss of human free will to companies like Google.</p>\n<p>Homo Deus paints a pretty bleak outlook of the future, but it&#x2019;s very realistic. Already we can see the effects of global warming and how willing we are to give up personal data (and eventually our free will) to big corporations.</p>\n<p><strong>9/10: Solid follow-up to Sapiens, would recommend.</strong></p>\n<hr>\n<p>I should mention some duds that I picked up and couldn&#x2019;t get through. Two books that I tried reading but just couldn&#x2019;t get past the first few chapters were <a href=\"https://www.amazon.ca/Astrophysics-People-Hurry-Degrasse-Tyson/dp/0393609391\">Astrophysics for People in a Hurry</a> by the super cool Neil Degrasse Tyson and <a href=\"https://www.amazon.ca/Hooked-How-Build-Habit-Forming-Products-ebook/dp/B00HJ4A43S\">Hooked: How to Build Habit-Forming Products</a> by Nir Eyal. Maybe I&#x2019;ll give them another shot next year.</p>\n<p>I&#x2019;m currently reading through the first of seven Harry Potter books because my girlfriend and my friend Gary have been giving me shit for not reading the series for years (like most kids I gave up on the series after seeing how thick <em>The Goblet of Fire</em> was).</p>\n<p>I&#x2019;m happy that I met my book goals for the year and that reading has become a daily habit. Can&#x2019;t wait to crush more next year.\t\t</p>\n</body></html>","wordpress_id":5336},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"book-goals-end-of-2017-update","wordpressId":5336,"newerPostSlug":"2017-postmortem","olderPostSlug":"iceland-2017"}}