{"data":{"wordpressPost":{"title":"Japan Trip 2015 Part 4: Hiroshima","content":"<p>We arrived in Hiroshima on the <a href=\"https://en.wikipedia.org/wiki/Shinkansen\">Shinkansen</a> at around noon on Saturday, the 24th. We had a lot of time to kill before checking in at our AirBnB, so we decided to chuck our bags in the train station&#8217;s coin lockers and go explore the city.</p>\n<p><!--more--></p>\n<p>Holy frig, are Shinkansen bullet trains ever fast. Ours went up to about 300 km/h &#8211; how crazy is that?! Maybe someday we&#8217;ll get some of these badboys in Canada. Imagine going from Ottawa to Toronto in less than two hours!</p>\n<h3>Peace Memorial Park</h3>\n<p>Our first stop in Hiroshima was the Peace Memorial, a very serene park with many beautiful statues.</p>\n<p>One of the sights we checked out was the Genbaku Dome. The atomic bomb exploded 150m almost directly above it, and it&#8217;s the only remaining building from the explosion. After the war there were several movements to get rid of the building as it reminded the locals of the horrible aftermath of the bomb. However, it was decided that the building be kept as a symbol of peace, and in 1996 it was designated as a UNESCO World Heritage Site.</p>\n<p>There was a choir singing in the park when we were there. Their singing was beautiful and pulled at our heartstrings.</p>\n<p><img class=\"lazy-load\" data-src=\"https://www.tetchi.ca/wp-content/uploads/2015/11/DSCF0847.jpg\" alt=\"Choir with genbaku dome in the background.\" /></p>\n<div class=\"sub\">Choir at the park, with Genbaku Dome in the background.</div>\n<h3>Peace Memorial Museum</h3>\n<p>After walking around the park for a bit we went to the Peace Memorial Museum. It consisted of artifacts from the bomb, such as clothes, accessories, and pieces of buildings.</p>\n<p>There were many horrific stories of the victims, but what stuck with me the most were the &#8220;shadows&#8221; that were etched into buildings after the bombing. These shadows are actually remnants of people who have been burned into the walls and roads. The fact that the spot on the concrete used to be a human being really freaked me out.</p>\n<p><img class=\"lazy-load\" data-src=\"https://www.tetchi.ca/wp-content/uploads/2015/11/wwii1439.jpg\" alt=\"Hiroshima Shadow - from worldwar2database.com\" /></p>\n<div class=\"sub\">Photo credit: <a href=\"http://worldwar2database.com/\">worldwar2database.com</a></div>\n<p>Going to memorials and museums like these really makes me feel really grateful for my life, and reminds me of how fortunate I am.</p>\n<h3>Fun times at the AirBnB</h3>\n<p>The weirdest thing happened when we we arrived at the AirBnb. We didn&#8217;t have any electricity in our unit! By this time it was already getting dark, so we hung out in the apartment in complete darkness while I corresponded with the AirBnB host.</p>\n<p><img data-src=\"https://www.tetchi.ca/wp-content/uploads/2015/11/IMG_4133.jpg\" alt=\"No power in Hiroshima\" width=\"1280\" height=\"1280\" class=\"alignnone size-full wp-image-4381 lazy-load\" data-srcset=\"https://www.tetchi.ca/wp-content/uploads/2015/11/IMG_4133.jpg 1280w, https://www.tetchi.ca/wp-content/uploads/2015/11/IMG_4133-150x150.jpg 150w, https://www.tetchi.ca/wp-content/uploads/2015/11/IMG_4133-300x300.jpg 300w, https://www.tetchi.ca/wp-content/uploads/2015/11/IMG_4133-1024x1024.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" /></p>\n<div class=\"sub\">Watching Insidious 3 while waiting for electricity</div>\n<p>After going back and forth with the host for a couple hours, we finally managed to get electricity. We charged our electronics for a bit and then went back to the city to check out the nightlife.</p>\n<h3>Koba Rock Bar</h3>\n<p>We went to several bars in Hiroshima, but the coolest one was <a href=\"http://gethiroshima.com/nightlife/koba\">Koba</a>. It was a rock-themed bar and had a huge projection of old-school music videos playing on the wall.</p>\n<p><img data-src=\"https://www.tetchi.ca/wp-content/uploads/2015/11/DSCF0866.jpg\" alt=\"DSCF0866\" width=\"1280\" height=\"853\" class=\"alignnone size-full wp-image-4383 lazy-load\" data-srcset=\"https://www.tetchi.ca/wp-content/uploads/2015/11/DSCF0866.jpg 1280w, https://www.tetchi.ca/wp-content/uploads/2015/11/DSCF0866-300x200.jpg 300w, https://www.tetchi.ca/wp-content/uploads/2015/11/DSCF0866-1024x682.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" /></p>\n<h3>Miyajima</h3>\n<p>On our second day we went out to Miyajima, aka the Island of Shrines. It was about a half-hour train ride to Miyajima-Guchi, and we caught a ferry there to get to the island.</p>\n<p><img data-src=\"https://www.tetchi.ca/wp-content/uploads/2015/11/DSCF0905.jpg\" alt=\"MIYAJIMA SQUAD\" width=\"1280\" height=\"853\" class=\"alignnone size-full wp-image-4391 lazy-load\" data-srcset=\"https://www.tetchi.ca/wp-content/uploads/2015/11/DSCF0905.jpg 1280w, https://www.tetchi.ca/wp-content/uploads/2015/11/DSCF0905-300x200.jpg 300w, https://www.tetchi.ca/wp-content/uploads/2015/11/DSCF0905-1024x682.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" /></p>\n<div class=\"sub\">Miyajima squad</div>\n<p>Miyajima, like Nara, was packed with deer. Except I found the deer at Miyajima more aggressive. There was this one deer with huge antlers that was getting ready to charge a dude who was facing away from it. Luckily the man turned around last minute, which startled the deer and stopped him from charging. There was also another deer that snuck behind me and ate a plastic bag that I had next to me. We tried getting it out of his mouth but he was dead set on eating garbage. Goddamn forest raccoons, I tell ya.</p>\n<p><img class=\"lazy-load\" data-src=\"https://www.tetchi.ca/wp-content/uploads/2015/11/DSCF0889.jpg\" alt=\"Miyajima Deer Chillin&#039;\" /></p>\n<div class=\"sub\">The deer in Miyajima give zero fucks.</div>\n<p>We spent the whole day in Miyajima, but we definitely could have spent another day there. A good chunk of time went into climbing to the top of Mount Misen. It took a couple of hours to climb to the top. I thought I was dumb for wearing Vans to hike up a mountain, but on the way up we saw some girl wearing high heels. Honestly, what the hell are you thinking.</p>\n<p><img class=\"lazy-load\" data-src=\"https://www.tetchi.ca/wp-content/uploads/2015/11/hiroshima_top.jpeg\" alt=\"Sharhan chilling at the top\" /></p>\n<div class=\"sub\">Sharhan chilling at the top of Mt. Misen. Photo by Gawwie.</div>\n<p>What I found really cool about Miyajima was how the tide rolled in as the day went by. When we first got there the tide was super low so we could actually go up to the infamous torii (gate). Later in the day the tide pulled in and covered the base of the torii, making for a super-sweet view.</p>\n<p><img class=\"lazy-load\" data-src=\"https://www.tetchi.ca/wp-content/uploads/2015/11/DSCF0987.jpg\" alt=\"Miyajima\" /></p>\n<div class=\"sub\">Bye bye Miyajima!</div>\n<p>The next morning we headed for the airport to hop on a plane to my hometown, Okinawa!</p>\n<h3>Takeaways</h3>\n<ul>\n<li>Be sure to check out the Hiroshima War Museum, lots of great artifacts and stories that put the magnitude of the bomb into perspective. </li>\n<li>Take advantage of the coin lockers if you have a lot of baggage. Pretty much every train station will have some! </li>\n<li>Highly suggest hiking up Mount Misen in Miyajima. Wear comfy shoes! </li>\n<li>I would probably dedicate a full day and one night in Miyajima. I wish I could have checked out more of it. </li>\n<li>Don&#8217;t turn your back to the antlered deers. They&#8217;ll seriously fuck you up. </li>\n</ul>\n<hr />\n<p><a href=\"/japan-trip-2015/\">← Back to Japan Trip 2015 index</a></p>\n"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"japan-trip-2015-part-4-hiroshima"}}