{"data":{"wordpressPost":{"title":"FITC Toronto 2011","content":"<p style=\"text-align:center;\"><img src=\"http://localhost:9999/wp-content/uploads/2011/05/FITC_2011.jpg\" alt=\"\" title=\"FITC_2011\" width=\"500\" height=\"180\" class=\"aligncenter size-full wp-image-1691\" srcset=\"http://localhost:9999/wp-content/uploads/2011/05/FITC_2011.jpg 500w, http://localhost:9999/wp-content/uploads/2011/05/FITC_2011-300x108.jpg 300w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></p>\n<p>This year I attended Flash In The Can 2011, a conference in Toronto on Design and Technology. I was always under the impression that this conference was mostly about Flash, but my friend <a href=\"http://grantlucas.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Grant Lucas</a> convinced me otherwise. He went to FITC last year, and told me how it was more about design, workflow, and inspiration, and little to do with Flash. This got me thinking about going to FITC 2011, but when he told me that <a href=\"http://mcbess.com/\" target=\"_blank\" rel=\"noopener noreferrer\">McBess</a> (one of my favourite artists in the world) was going to be doing a talk I immediately booked tickets to the conference.</p>\n<p>In this post I&#8217;m going to talk about the three speakers that resonated with me the most. <!--more--></p>\n<h3>Signalnoise (James White)</h3>\n<div class=\"sub\" style=\"text-align: left;\"><a href=\"http://www.signalnoise.com/\" target=\"_blank\" rel=\"noopener noreferrer\">www.signalnoise.com</a></div>\n<p>On the first day, I attended a talk by James White of Signalnoise called &#8220;Back to the Future II&#8221;. In his talk, James  talked about how his past experiences and childhood memories has affected his artwork. James was really into heavy metal and old TV opening titles with funky colors, and you can really see that in his bright-colored, retro art. </p>\n<p style=\"text-align:center;\"><img src=\"http://localhost:9999/wp-content/uploads/2011/05/thesword_jameswhite.jpg\" alt=\"\" title=\"thesword_jameswhite\" width=\"375\" height=\"500\" class=\"aligncenter size-full wp-image-1651\" srcset=\"http://localhost:9999/wp-content/uploads/2011/05/thesword_jameswhite.jpg 375w, http://localhost:9999/wp-content/uploads/2011/05/thesword_jameswhite-225x300.jpg 225w\" sizes=\"(max-width: 375px) 100vw, 375px\" /></p>\n<div class=\"sub\">One of James White&#8217;s many cool poster designs</div>\n<p>James really emphasized how he made almost all of the artwork in his spare time, outside of work. This really got me thinking about how important is for me to keep working on art on my free time. Now that I&#8217;m finished school for good and back full-time at work, I have no excuse to put art projects aside. I felt that I really need to keep pumping out projects in order to improve my artistic skills.</p>\n<h3>Robert Hodgin</h3>\n<div class=\"sub\" style=\"text-align: left;\"><a href=\"http://roberthodgin.com/\" target=\"_blank\" rel=\"noopener noreferrer\">www.roberthodgin.com</a></div>\n<p>Robert Hodgin showed off some of the coolest generative art I&#8217;ve ever seen in my life. It was cool to how he&#8217;d look at things in nature, like a tree or a beach, and think of ways to reproduce it with code. He talked about some of his past projects, the challenges he faced, and how he overcame them. My favourite project of his was called &#8220;Into the Woods&#8221;, which was an audio-visual piece that he created with cellist Zoë Keating. The entire experience, including the sky, trees, grass, etc. is created with code, and is absolutely beautiful. I highly recommend checking out his project <a href=\"http://roberthodgin.com/into-the-trees/\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2011/05/Into-the-trees-588x330.jpg\" alt=\"\" title=\"Into the trees\" width=\"588\" height=\"330\" class=\"aligncenter size-medium wp-image-1649\" /></p>\n<div class=\"sub\">A screencap from one of Robert&#8217;s projects called &#8220;Into the Woods&#8221;</div>\n<p>Robert too talked about his past and how it influenced him. He recalled a time when he was a toddler, he was climbing Mount Fuji and he remembered being surrounded by tall trees and mist. This experience was the basis for many of his projects, including &#8220;Into the Woods&#8221;. However, it turned out that this memory was completely false, and that he was actually just at a small park in Tokyo 😛</p>\n<p>Near the end of his presentation, Robert showed off &#8220;Planetary&#8221;, an iPad app that he and his colleagues at Bloom Studio Inc. have been working on. Planetary is an app that takes your iPad&#8217;s music library, and dynamically generates a solar system based on your collection. For example, the textures of the planets are created using an artist&#8217;s album cover. For those who have an iPad, be sure to check it out on the <a href=\"http://itunes.apple.com/us/app/planetary/id432462305?mt=8\" target=\"_blank\" rel=\"noopener noreferrer\">App Store</a>.</p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2011/05/planetary-588x441.jpg\" alt=\"\" title=\"planetary\" width=\"588\" height=\"441\" class=\"aligncenter size-medium wp-image-1646\" /></p>\n<div class=\"sub\">A screencap from &#8220;Planetary&#8221;, an iPad app by Bloom Studio Inc.</div>\n<p>Generative art is something I&#8217;d definitely like to experiment with, although I severely lack in the programming skill department. I&#8217;ll start off with small particle effects projects using Processing, and then move on to using the Cinder library. </p>\n<h3>McBess (Matthieu Bessudo)</h3>\n<div class=\"sub\" style=\"text-align: left;\"><a href=\"http://mcbess.com/\" target=\"_blank\" rel=\"noopener noreferrer\">www.mcbess.com</a></div>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2011/05/mcbess_wood-588x328.jpg\" alt=\"\" title=\"mcbess_wood\" width=\"588\" height=\"328\" class=\"aligncenter size-medium wp-image-1634\" /></p>\n<div class=\"sub\">A screencap from McBess&#8217; music video, &#8220;Wood&#8221;.</div>\n<p>Last but not least, McBess! I&#8217;ve been a big fan of McBess&#8217; work ever since a few years ago I saw his music video, <a href=\"http://www.youtube.com/watch?v=cD1Rrfc0y-M\">Wood</a>. I&#8217;ve always loved old cartoons as a kid, and love artists that use that style in their work. </p>\n<p>I totally thought McBess made &#8220;Wood&#8221; for a band called Dead Pirates, but what I found out during the presentation was that the song was made and recorded by McBess alone, and the Dead Pirates was a fictional band with imaginary characters. Later, he formed a band with his buddies called Dead Pirates with whom he plays live shows, but it&#8217;s interesting to see how the fictional band came before the actual band.</p>\n<p>I enjoyed seeing McBess&#8217; projects and learning about his workflow, but what really got to me was his awesome sense of humor. He just seemed to be a really down-to-earth dude, and his slides would frequently include references to boobies and &#8216;wanking&#8217;. I chatted with him briefly after his presentation, and he was kind enough to answer some questions that I had for him. </p>\n<p>Like the fanboy that I am, I got my friend to take a picture of me and McBess. To further emphasize my fanboyness I decided to wear my Dead Pirates tee that day. </p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2011/05/mcbess_fitc2011-588x439.jpg\" alt=\"\" title=\"mcbess_fitc2011\" width=\"588\" height=\"439\" class=\"aligncenter size-medium wp-image-1640\" /></p>\n<div class=\"sub\">Me and McBess</div>\n<h2 class=\"steps\">Conclusion</h2>\n<p>From these three awesome individuals, I learned the following:</p>\n<ul>\n<li>Think about what excited you as a kid, and think of ways to integrate those experiences into your own work.</li>\n<li>Always seek inspiration. Appreciate your surroundings (places, events, people, music, etc.) and harness them into your own work.</li>\n<li>Don&#8217;t be afraid to try something because it&#8217;s not &#8220;original&#8221;. James White and McBess openly talked about their influences, and how it&#8217;s okay to be influenced by others. Standing on the shoulder of giants, so to speak.</li>\n<li>Don&#8217;t procrastinate. Keep making artwork to improve.</li>\n</ul>\n<p>FITC 2011 was a blast, and I&#8217;m really glad I attended this year. I went in with little idea on what to expect, and left with a mind packed with inspiration and a stomach full of butterflies. I would definitely go back next year, if I can somehow cheat into getting a student pass 😉</p>\n<p><em>Thanks again <a href=\"http://grantlucas.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Grant</a> for letting me know about FITC, and Shopify for letting me take time off to attend.</em>\t\t</p>\n","wordpress_id":1609},"allWordpressWpComments":{"edges":[{"node":{"content":"<p>Sweet! Thanks for reading, Ed!</p>\n","author_name":"Tetsuro","date":"May 10th, 2011"}},{"node":{"content":"<p>Great post Tetsuro! I love reading stuff like this.</p>\n","author_name":"Edward Ocampo-Gooding","date":"May 10th, 2011"}},{"node":{"content":"<p>hey, thanks Henray-ray! Dude, get workin&#8217; on your blog! 🙂</p>\n","author_name":"Tetsuro","date":"May 9th, 2011"}},{"node":{"content":"<p>Beautiful post! Definitely got a sense of all the greatness that I had to miss out on. I especially enjoyed the part about Robert&#8217;s work. Keep up the flow of posts, I will soon try to join in!</p>\n","author_name":"Henray","date":"May 9th, 2011"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"fitc-toronto-2011","wordpressId":1609,"previousPostSlug":"shopify-propaganda-poster","nextPostSlug":"schools-out-for-ever"}}