{"data":{"wordpressPost":{"title":"April 2018: Go Leafs Go Edition","content":"\n\t\t\t\t<p><!--more--></p>\n\n\n<h2>Stuff that happened</h2>\n\n\n\n<p>April was a quiet month. The bandmates were all pretty busy so I didn&#8217;t play much jazz. Without any jams or shows to look forward to, I found myself extremely unmotivated to practice <img draggable=\"false\" class=\"emoji\" alt=\"ðŸ˜ž\" src=\"https://s.w.org/images/core/emoji/2.4/svg/1f61e.svg\" />. I&#8217;ve also been distracted by the Switch game <em>Zelda: Breath of the Wild</em>, which I&#8217;ll get to later.</p>\n\n\n\n<p>Work was a bit rough as I failed to meet a deadline for a project I was overseeing. Everything was smooth sailing until a week before the deadline, when we uncovered a huge back end issue. It&#8217;s a shitty feeling when you&#8217;re super set on shipping a feature and encounter a roadblock at the very last minute. Part of the process, I suppose&#8230;</p>\n\n\n\n<p>The highlight of April was watching the Toronto Maple Leafs take on the big bad Bruins in the playoffs. After getting whooped in the first two games, the Leafs fought hard to force a game 7. Unfortunately they came up short and fell to the Bruins once again, but I wasn&#8217;t too upset.</p>\n\n\n\n<p>A lot of Leafs fans forget that it&#8217;s onlyÂ been two years since they finished last in the league.Â I wrote about my <a href=\"https://www.tetchi.ca/the-leafs-finish-last-in-the-league-but-i-couldnt-be-more-excited/\">excitement for the Leafs</a> back in April 2016 when they were the worst team in the NHL, and it&#8217;s awesome to see how far they&#8217;ve come in such a short period of time. They&#8217;ve made the playoffs two years in a row since and the young core is only going to get better and better. The loss to the Bruins definitely stings but the future looks very bright for the Leafs.</p>\n\n\n\n<h2>What I&#8217;ve been playing</h2>\n\n\n\n<figure class=\"wp-block-image aligncenter\"><img src=\"http://localhost:9999/wp-content/uploads/2018/04/zelda-breath-of-the-wild-2.jpg\" alt=\"Zelda: Breath of the Wild cover art\" class=\"wp-image-5616\" srcset=\"http://localhost:9999/wp-content/uploads/2018/04/zelda-breath-of-the-wild-2.jpg 1200w, http://localhost:9999/wp-content/uploads/2018/04/zelda-breath-of-the-wild-2-300x158.jpg 300w, http://localhost:9999/wp-content/uploads/2018/04/zelda-breath-of-the-wild-2-768x403.jpg 768w, http://localhost:9999/wp-content/uploads/2018/04/zelda-breath-of-the-wild-2-1024x538.jpg 1024w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /></figure>\n\n\n\n<p>Early in the month I picked up<strong>Â Zelda: Breath of the Wild</strong>, and man is it ever good. After playing the absolute hot trash that was <em>Zelda: Skyward Sword</em>, I had completely lost interest in the Zelda series. I felt that the formula was getting old and the characters were too dull (especially compared to games like The Witcher 3, where characters ooze personality).</p>\n\n\n\n<p><em>Breath of the Wild</em> is a refreshing take on the series. Instead of the usual &#8220;go to dungeon, get new weapon, use new weapon to beat boss, repeat&#8221; formula of past Zelda games, it gives you a bunch of tools right away and sets you free in a massive world. This was such a cool change of pace compared to past Zelda games. I also appreciated how there wasn&#8217;t much hand-holding, unlike in <em>Skyward Sword</em> where there seemed to be a tutorial every minute.</p>\n\n\n\n<p>Funny enough, the exploration aspect of <em>Breath of the Wild</em> reminded me a lot of last year&#8217;s Iceland trip with my girlfriend. Wandering around Hyrule with no one else in sight for miles evoked a similar feeling of driving around the vast Icelandic landscape for hours on end. I was also reminded of that comforting feeling of finally rolling into a small town where there are other humans, and the heart-warming feeling of taking shelter in a campground during a storm.</p>\n\n\n\n<figure class=\"wp-block-image alignwide\"><img src=\"http://localhost:9999/wp-content/uploads/2018/04/rainy-day-in-Zelda.jpg\" alt=\"Taking shelter in the rain in Zelda.\" class=\"wp-image-5473\" srcset=\"http://localhost:9999/wp-content/uploads/2018/04/rainy-day-in-Zelda.jpg 1280w, http://localhost:9999/wp-content/uploads/2018/04/rainy-day-in-Zelda-300x169.jpg 300w, http://localhost:9999/wp-content/uploads/2018/04/rainy-day-in-Zelda-768x432.jpg 768w, http://localhost:9999/wp-content/uploads/2018/04/rainy-day-in-Zelda-1024x576.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />\n    <figcaption>Taking shelter in a stable in Zelda: BotW reminded me a lot of doing the same in Iceland&#8217;s campsites.</figcaption>\n</figure>\n\n\n\n<p>I&#8217;ve played about 50 hours already and I still have so much of the main quest remaining. If you have a Switch this is a must-play. I&#8217;m sorry Nintendo for doubting you.</p>\n\n\n\n<h2>What I read</h2>\n\n\n\n<figure class=\"wp-block-image aligncenter\"><img src=\"http://localhost:9999/wp-content/uploads/2018/04/how-to-american.jpg\" alt=\"\" class=\"wp-image-5518\" srcset=\"http://localhost:9999/wp-content/uploads/2018/04/how-to-american.jpg 331w, http://localhost:9999/wp-content/uploads/2018/04/how-to-american-199x300.jpg 199w\" sizes=\"(max-width: 331px) 100vw, 331px\" /></figure>\n\n\n\n<p>This month I read <em>How to</em> <em>American</em>, an autobiography by Jimmy O. Yang. You might recognize him as the hilarious Jin Yang in the show <em>Silicon Valley</em>. In his book, Jimmy talks about his early days when he immigrated to the USA and his struggles with fitting in to American society. There are some hilarious anecdotes in the book, some of which I could relate to as an immigrant growing up in Canada.</p>\n\n\n\n<p>There is one story in particular that hit really close to home with me. Jimmy talks about his middle school days, where he would feel self-conscious about his Chinese lunch that his dad would pack for him. His &#8216;foreign&#8217; lunch (which he admits smelled like &#8220;the back alley of Chinatown&#8221;) made it harder for him to fit in with the American kids.</p>\n\n\n\n<figure class=\"wp-block-image aligncenter\"><img src=\"http://localhost:9999/wp-content/uploads/2018/04/onigiri.jpg\" alt=\"\" class=\"wp-image-5629\" srcset=\"http://localhost:9999/wp-content/uploads/2018/04/onigiri.jpg 1000w, http://localhost:9999/wp-content/uploads/2018/04/onigiri-300x200.jpg 300w, http://localhost:9999/wp-content/uploads/2018/04/onigiri-768x512.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />\n    <figcaption>Onigiri, pic from <a href=\"https://www.japanesecooking101.com/assorted-onigiri-recipe/\">japanesecooking101.com</a></figcaption>\n</figure>\n\n\n\n<p>I remember back in elementary school a bunch of my classmates would poke fun of my <em>onigiri</em> (rice balls wrapped in seaweed, a very typical Japanese lunch) that my mom prepared every day. &#8220;Ew what the hell is that nasty black stuff!? How can you eat that thing!?&#8221;, they would say. This was way before sushi became mainstream in Canada, so nobody knew what <em>ï»¿nori</em> was. I&#8217;d be too embarrassed to eat onigiri in the lunchroom and would eat it on my walk home.</p>\n\n\n\n<p>Eventually I succumbed to the pressure and I asked my poor mom to make sandwiches instead. I was such a self-conscious fool! I should have appreciated my mom&#8217;s onigiri for how tasty it was and been proud of my unique lunches. My mom&#8217;s miso-filled onigiri were way the hell better than Wonder Bread sandwiches, that&#8217;s for sure.</p>\n\n\n\n<p>Anyway,Â <em>How to American</em> was a hilarious and quick read and brought back memories of my immigrant upbringing.</p>\n\n\n\n<hr class=\"wp-block-separator\" />\n\n\n\n<p>That&#8217;s it for this month! Time to start packing for my trip to Morocco. More on that next month! <img draggable=\"false\" class=\"emoji\" alt=\"ðŸ«\" src=\"https://s.w.org/images/core/emoji/2.4/svg/1f42b.svg\" /></p>\n\t\t","wordpress_id":5469},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"april-2018-go-leafs-go-edition","wordpressId":5469,"previousPost":{"slug":"may-2018-moroccnroll-edition","wordpress_id":5647},"nextPost":{"slug":"march-2018-smarch-in-smashville-edition","wordpress_id":5432}}}