{"data":{"wordpressPost":{"title":"January 2018","content":"<html><head></head><body><p>\t\t\t\t<!--more--></p>\n<h2>Stuff that happened</h2>\n<p>Right before the new year I went to Quebec City with my girlfriend for two nights. It was stupid cold so we lounged in our hotel room and cafes for the most part (which we were planning on doing anyway). It was great opportunity to catch up on some reading and writing.</p>\n<p>I also reached my <strong>62nd consecutive day</strong> of absolutely no alcohol! I decided to stop drinking when I came back from Japan, for no other reason than I want to get in better shape. So far I don&#x2019;t really miss it, except for the odd time at social gatherings when I feel like I could use a beer to ease up a bit. I&#x2019;ve found that club soda is a great solution for when I just want a drink in my hand. Shoutouts to club soda for getting me off both shitty sugary sodas in the past, and now alcohol!</p>\n<p>Finally, I reached the <strong>9 year mark</strong> of my career at Shopify. Holy moly does time ever fly! I still remember being a 21-year old intern with no idea what I was doing&#x2026; and here I am, almost 30 with still no idea what the fuck I&#x2019;m doing!</p>\n<p>It&#x2019;s been a crazy ride at Shopify, and looking back it&#x2019;s insane to see how much it&#x2019;s grown. I vividly remember the days of Shopify&#x2019;s tiny 185 Rideau St office, above what used to be Blockbusters. Many-a-days we would get free DVDs from goofballs who&#x2019;d think our mail slot was Blockbuster&#x2019;s DVD returns slot. It was a nice, cozy office and when I started back in January 2009 there were maybe 15 employees.</p>\n<p>My fondest memories of this place include:</p>\n<ul>\n<li>Talking about Wall-E and playing Marvel vs Capcom 2 with future coworkers at my interview</li>\n<li>Showing up for the interview in the most casual work environment in the world wearing a full suit (needless to say I felt like a fucking idiot)</li>\n<li>Tobi and Daniel sending me on a mission to go buy the freshly-released <em>Street Fighter IV</em> on my second week of internship</li>\n<li>Playing Street Fighter IV every day during breaks (through which I learned that Tobi and Daniel are the most competitive people I&#x2019;ve ever met)</li>\n<li>Shooting the shit with Edward O. Gooding about anime, movies and video games (we shared many Fallout 3 stories and tips)</li>\n<li>Daily lunch trips to La Bottega for sandwiches</li>\n<li>John Tajima blowing my mind by showing me how to inspect webpages using Firebug</li>\n<li>Daniel blowing my mind by showing me how to make slideshows with jQuery (&#x201C;YOU MEAN YOU DON&#x2019;T NEED FLASH FOR SLIDESHOWS!?&#x201D;)</li>\n<li>Being extremely nervous about meeting Caro (aka the Queen of the Shopify community forums) for the first time</li>\n<li>Hotboxing the one boardroom we had with sloppy shawarma stench with Mark Dunkley (sorry Tobi)</li>\n</ul>\n<p>Most importantly, I remember how much I LOVED going to the office to get work done. I loved learning about how to make websites, learn cool Photoshop techniques from Mark and Daniel, and to just hang out with the Shopify crew. I loved waking up and going to work; it beat the hell out of pulling all-nighters on school projects and cramming for exams. After a full year of internship at Shopify, I dreaded going back to school to finish up my degree (though in the end I&#x2019;m happy I completed school).</p>\n<p>Big shoutout to <a href=\"https://twitter.com/ryanlanglois\">Ryan Langlois</a> who referred me for a position at Shopify when I had given up hope on finding an internship. Shopify wouldn&#x2019;t be on Carleton U&#x2019;s Co-op radar until many years later. It was Ryan who suggested I reach out to Shopify for an intern position. And of course, big thank you to Tobi and Daniel for giving a clueless student a chance. I&#x2019;m super grateful for the positive impact they had on my life.</p>\n<p>I totally digress from the monthly digest but reflecting back on January 2009 really tingled my nostalgia-feels. Man, those were some fucking good times!</p>\n<h2>Things I learned</h2>\n<p>This month I played around more with React JS. To get more familiar with React, I decided to take last year&#x2019;s MTL Murals project and convert it into a React app. It&#x2019;s still a work-in-progress, but I&#x2019;m really starting to dig React.</p>\n<p>I also had a bit of a rough patch at work where I was stuck on one problem for a long time. I was struggling with why some of my unit tests weren&#x2019;t passing and when I finally sat down with my lead to go over my code, he spotted the problem right away. On hindsight it seemed so obvious. I had been overly focused on the wrong part of problem and had missed an obvious error.</p>\n<p>I suppose it&#x2019;s okay to get stuck, but I need to learn to step back and approach a problem from a different/fresh perspective.</p>\n<h2>Books I read</h2>\n<p style=\"text-align: center;\"><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2018/02/girl-who-kicked-hornets-nest.jpg\" alt=\"girl who kicked hornet&apos;s nest\"></p>\n<p>I finished reading <strong>The Girl Who Kicked the Hornet&#x2019;s Nest</strong>, which was a solid read. The Girl Who Kicked the Hornet&#x2019;s Nest is a crime/thriller and is the third book of the Millenium Trilogy. I read the first two books back in 2011 but for some reason I never finished the third.</p>\n<p>I really enjoyed The Girl Who Kicked the Hornet&#x2019;s Nest, especially near the end of the book when things start to pick up. The ending was satisfying as well. I&#x2019;m looking forward to checking out the Swedish movie adaptations of the trilogy.</p>\n<p>I also read <strong>Tragic Design</strong> cowritten by my coworker <a href=\"https://twitter.com/cynthiasavard\">Cynthia</a> which was also a solid read. It does a great job explaining how design can evoke a wide range of emotions, from anger, sadness, to self-defeat. It also includes many excellent real world examples of how bad design resulted in tragic results. If you are in the UX field I&#x2019;d definitely recommend this book.</p>\n<h2>What&#x2019;s on my mind</h2>\n<p>For the past month or two, I&#x2019;ve been contemplating buying the Nintendo Switch. Lucky for me, my good friend Pierre lent me his Switch over the break and I got a chance to really get a feel for it, and at the same time play through Mario Odyssey.</p>\n<p><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2018/02/smo_cover_feature.jpg\" alt=\"super mario odyssey\"></p>\n<p>Honestly speaking I really didn&#x2019;t enjoy Mario Odyssey at first. I thought it was way to easy and had too much filler content. I was surprised to find some really awesome platforming challenges and riddles after the main story, and I ended up playing enough to collect all 999 Power Moons.</p>\n<p>With that said, it&#x2019;s nowhere near as good as Mario Galaxy 1 &amp; 2 in my opinion. Many of the Power Moons were tedious to collect, and I hated that you have to farm coins to fully complete the game. I would&#x2019;ve preferred fewer, more challenging Power Moons.</p>\n<p>The Switch console itself is pretty sweet. It has the quality build that Nintendo is known for, and navigating the menu feels very snappy. There are little annoyances about it like how you can&#x2019;t connect Bluetooth headphones and the complete absence of Virtual Console. All in all though it&#x2019;s a great console, and I seriously underestimated how awesome it is to be able to switch from playing on the TV to taking the console on-the-go.\t\t</p>\n</body></html>","wordpress_id":5382},"allWordpressWpComments":{"edges":[{"node":{"content":"<p>Thanks for reading Justin! Things are good over here, can&#8217;t complain, hope you&#8217;re doing good bro!!</p>\n","author_name":"tetchi","date":"April 11th, 2018"}},{"node":{"content":"<p>Man, shopify sounded unprofessional as hell but fun as fuck back in 2009, wish I was there to experience it :&#8217;)</p>\n<p>My time there was awesome though thanks to the FED crew; how you doin Tets? 😀</p>\n","author_name":"Justin Chan","date":"April 5th, 2018"}},{"node":{"content":"<p>@Mia thanks for reading!! 🙂 Trust me, even after 9 years I still feel like I&#8217;m new too haha. I guess the best thing to do is to not be intimidated by that fact and just soak up as much as possible.</p>\n<p>I ended up picking up a copy of Zelda, appreciate the thought though! 🙂</p>\n","author_name":"tetchi","date":"March 2nd, 2018"}},{"node":{"content":"<p>I found your blog! Cause you were an Instagram suggestion, and I saw it in your profile. Very cool to read about your old time days at Shopify! After 1.5 years, I still feel like I&#8217;m super new. On another note, wanna borrow Zelda for Switch?</p>\n","author_name":"Mia","date":"February 22nd, 2018"}},{"node":{"content":"<p>Dude thanks so much for reading! I&#8217;m really to have met you too man, I always new you were a cool dude even before I met you in person. Loved that robot evolutiondesign icon! 😀 </p>\n<p>Really recommend the Switch especially if you travel a lot. It&#8217;s really sick to be able to hop in and out of gaming sessions! </p>\n<p>Love you bro and I swear I&#8217;ll visit Charleston soon!</p>\n","author_name":"tetchi","date":"February 5th, 2018"}},{"node":{"content":"<p>Great post! 2 months no booze! Good on ya. </p>\n<p>Some great memories there. 9 years is just insane to think about. So glad our paths crossed my man. It’s amazing to think about all the twists and turns that puts people places and things in your path along the way.</p>\n<p>On _Hornets Nest_ great ending to the trilogy and you’ll be super happy with the original films and you would have been fucking pissed if you had watched them before finishing the books. Films are good but the books are wayyyyy better. Not like they aren’t always better. </p>\n<p>Been looking at the switch myself, if fo no other reason than to get some fun “lighter” games than what I play on the PS4. I may have to make the jump myself. Seems like it may travel well too.</p>\n<p>Love you brother, glad I saw your post!</p>\n","author_name":"Jamie","date":"February 4th, 2018"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"january-2018","wordpressId":5382,"newerPostSlug":"february-2018","olderPostSlug":"2017-postmortem"}}