{"data":{"wordpressPost":{"title":"Japan Trip 2015: Conclusion","content":"<p>Travelling to Japan with my buddies was amazing. I&#8217;ve solo-tripped many times, and I&#8217;d already been to many of the places that we went to, but there&#8217;s nothing quite like sharing moments with some of your best buds.</p>\n<p>I&#8217;d like to wrap this series up with some tips for if you&#8217;re thinking of travelling to Japan, as well as some lessons that I learned on my trip.</p>\n<p><!--more--></p>\n<h3>Japan travel tips</h3>\n<ul>\n<li>Buy data. We all bought SIM cards through <a href=\"https://www.econnectjapan.com/\">eConnect</a>. Having access to data everywhere saved us a lot of time and headaches. </li>\n<li>Buy a portable charger. I had my <a href=\"http://www.amazon.ca/s/ref=bl_dp_s_web_3379552011?ie=UTF8&amp;node=3379552011&amp;field-brandtextbin=Anker\">Anker charger</a> with me and it saved my ass on numerous occasions.</li>\n<li>If you&#8217;re travelling with friends, buy a splitter. Being able to charge devices simultaneously can prevent plug wars. </li>\n<li>Take your shoes off when you&#8217;re anywhere inside. Actually this is one of my pet peeves, I don&#8217;t understand why so many people back home in Canada don&#8217;t take their goddamn shoes off indoors. But I digress&#8230; </li>\n<li>Buy a handkerchief. A lot of Japanese washrooms don&#8217;t have paper towels or blow dryers, so you&#8217;ll need something to wipe your hands with.</li>\n<li>Douglas Adams said it best &#8211; bring a towel with you, specifically those quick-dry ones. Not having to wait for your towel to dry is SO key! </li>\n<li>Many train stations have coin lockers, so you can lock up your stuff if you have time to kill and want to explore the area.</li>\n<li>Bring lots of cash. Japan is still very much a cash-heavy society, a lot of restaurants will not take credit cards. </li>\n<li>If you run out of cash, find a post office (look for buildings with the <code>〒</code> symbol). You can use your credit card at the ATMs there to pull cash. </li>\n<li>Keep track of expenses among friends. Restaurants typically bring only one bill for the whole table, so you should keep track of who ordered what.  </li>\n<li>You can drink in public! Grab some frosty soldiers at any convenience store and drink on the streets. Just don&#8217;t be an obnoxious arsehole.</li>\n<li>When taking the escalators, stay on the left side unless you&#8217;re walking up. Don&#8217;t be that guy that blocks the fast lane. Oh and of course, <a href=\"https://frinkiac.com/img/S08E04/127576.jpg\">in Osaka the whole thing&#8217;s flip-flopped</a>. </li>\n<li>Don&#8217;t jay-walk. Japanese people tend to not jay-walk so you really look like a dick if you do. </li>\n</ul>\n<h3>Lessons learned&#8230;</h3>\n<p><strong>Being the translator for a trip is tough</strong></p>\n<p>Being the translator for a trip can be extremely stressful, especially if you&#8217;re not completely fluent at the language. With that said, I enjoyed being able to direct my friends and help them out whenever possible. There&#8217;s something satisfying about knowing that you&#8217;re still able to communicate in a language that you don&#8217;t use that often back home.</p>\n<p><strong>Traveling makes you weigh the pros and cons of where you live</strong></p>\n<p>When you visit another country you tend to see everything through rose-tinted glasses. In Japan we were amazed by so many things: the food, the amazing service everywhere, the cleanliness of the streets, etc. When you think about the flipside though, you gain more appreciation for your home country.</p>\n<p>Of course there are a million examples of minor annoyances, like how Japan is very cash-based, or how there are no paper towels anywhere, but I&#8217;m thinking more about lifestyle differences. For example, one of my Japanese friends was absolutely shocked that we were able to take two-and-a-half weeks off for vacation. In many workplaces in Japan it is nearly impossible to take that much time off. It really put things into perspective and made me appreciate certain aspects about Canada more.</p>\n<p><strong>Traveling with friends is awesome</strong></p>\n<p>I mentioned this earlier, but traveling with friends is one of the best things anyone can do. Traveling with these goofs was one of the funnest experiences in my life.</p>\n<p>For days after coming home to Canada, I would wake up wondering where everybody had gone. After spending so much time with these guys I&#8217;d become so used to them being with me everywhere. Even now, whenever I listen to <a href=\"https://www.youtube.com/watch?v=6gypBEmz2nk\">any song from Beirut&#8217;s No No No album</a> (which I had on repeat the entire trip), I can vividly picture hanging out in the streets of Japan with my homies. Shit&#8217;s magic.</p>\n<p>There were so many good stories that came out of this trip, and I learned that that&#8217;s really what life is all about; creating dope stories and sharing them with others.</p>\n<p><img src=\"https://www.tetchi.ca/wp-content/uploads/2015/11/DSCF0825-1024x683.jpg\" alt=\"group shot in Nara airbnb\" /></p>\n<div class=\"sub\">Otsukaresamadesu &#8211; お疲れ様です！</div>\n<p><em>Huge thanks for reading this series. Shoutouts to all my friends and family in Japan that met up with us, and of course to Mikey, Sharhan, Minh, Jared and Gary. Thanks for the good memories buds.</em></p>\n<hr />\n<p><a href=\"/japan-trip-2015/\">← Back to Japan Trip 2015 index</a></p>\n"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"handle":"japan-trip-2015-conclusion"}}