{"data":{"wordpressPost":{"title":"Battlefield 3","content":"<p>For the past couple of months I&#8217;ve been hooked on DICE&#8217;s latest game, Battlefield 3 (BF3). I was a huge fan of Battlefield 1942 so I knew that I would love BF3 right off the bat. </p>\n<p>BF3 is the <strong>best FPS I&#8217;ve ever played</strong>. Between BF1942 and BF3, I played a lot of FPS games but most of them were short-lived. One exception is TF2, which I played a lot until it went crazy with all the hats, crafting and micro-transactions.</p>\n<p>One of BF3&#8217;s great new features is &#8220;Battlelog&#8221;, which is EA&#8217;s social platform for BF3 players. The best part about Battlelog is its stat-tracking. Through Battlelog you can check your kill:death ratio, weapon stats, unlocks, awards, and reports of past rounds. I find myself logging into Battlelog after rounds to see how I did, and whether or not I&#8217;m about to unlock something. </p>\n<p><a href=\"http://localhost:8888/wp-content/uploads/2011/12/tetchi_bf3_stats-e1325197150463.png\"><img src=\"http://localhost:8888/wp-content/uploads/2011/12/tetchi_bf3_stats-e1325197150463.png\" alt=\"my bf3 stats\" title=\"my bf3 stats\" width=\"500\" height=\"460\" class=\"alignnone size-full wp-image-1964\" srcset=\"http://localhost:8888/wp-content/uploads/2011/12/tetchi_bf3_stats-e1325197150463.png 500w, http://localhost:8888/wp-content/uploads/2011/12/tetchi_bf3_stats-e1325197150463-300x276.png 300w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></a></p>\n<div class=\"sub\">Battlelog provides you with lots of sweet stats</div>\n<p>As for the actual gameplay, what makes BF3 so awesome is its emphasis on teamwork. This was made even more true when I was one day recruited by a platoon called <a href=\"http://battlelog.battlefield.com/bf3/platoon/2832655391303178979/\" target=\"_blank\" title=\"N7 Spectres platoon page\">N7 Spectres</a>. I was asked to join when I was having a pretty sweet game on Noshahr Canals. I was a little worried at first because I thought that being in a platoon meant daily practices and getting super-pissed at one another for messing up, but man, how wrong I was. N7 Spectres is a group of some of the coolest, friendliest and most importantly skilled players, and it makes playing BF3 even more fun.</p>\n<p>N7 Spectre&#8217;s founder, eGessDub, posts some pretty sweet gameplay videos on his Youtube channel <a href=\"http://www.youtube.com/user/EssDubGaming?blend=1&#038;ob=video-mustangbase\" title=\"essDubgaming youtube\">here</a>. Yesterday eGessDub posted a game with me in it! It&#8217;s pretty rad to re-experience the match from another person&#8217;s perspective. </p>\n<p><iframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/TPG9ykEBjSQ\" frameborder=\"0\" allowfullscreen></iframe></p>\n<div class=\"sub\">eGessDub&#8217;s latest replay video. Tearin&#8217; it up on Seine Crossing!</div>\n<p><!--more--><br />\nKnifing people in BF3 is seriously a metagame, and it&#8217;s one of my favourite aspects of the game. When you perform a knife attack from behind an enemy, you go into this wicked animation where you grab your enemy&#8217;s dog tag and stab him in the heart/throat. Knifing can be pretty difficult though, as it makes you vulnerable to nearby enemies, and the knife animation doesn&#8217;t kick in all the time (it&#8217;s a little buggy IMO). This makes performing a knife kill all the more satisfying. </p>\n<p>This has developed into an unhealthy addiction for me, as I&#8217;ll go out of my way to run behind an enemy and snatch his dog tag. Within Battlelog, there&#8217;s a section to see all of the stolen dog tags, and it has become my very own <a href=\"http://images.wikia.com/avp/images/f/f8/Trophywall-1-.jpg\">trophy room</a> like in  the movie <em>Predators</em>. The other week I lucked out and <a href=\"http://localhost:8888/wp-content/uploads/2011/12/dog-tags.png\" title=\"DICE dog tag\"> stole a dog tag from a DICE developer.</a></p>\n<p><a href=\"http://i.imgur.com/jafjX.jpg\"><img src=\"http://i.imgur.com/jafjX.jpg\" alt=\"Knifing an unsuspecting enemy from behind\"/></a></p>\n<div class=\"sub\">A screencap of the knifing animation. Image found on /r/battlefield3</div>\n<p>If you play Battlefield 3, you can find me on Battlelog <a href=\"http://battlelog.battlefield.com/bf3/user/tetchi/\">here</a>. Hit me up if you want to play some rounds :). If you don&#8217;t have BF3 yet, go get it NOW!!</p>\n","wordpress_id":1939},"allWordpressWpComments":{"edges":[{"node":{"content":"<p>Hey Rob, ya I have no idea how &#8220;Skill&#8221; is calculated &#8230; :\\</p>\n"}},{"node":{"content":"<p>Yeah, Battlefield 3 is pretty damned awesome. For what it&#8217;s worth, my skill in Battlelog is 232, but I&#8217;m not very good . . .</p>\n"}},{"node":{"content":"<p>haha thanks man! I think I&#8217;m hooked on bf3 because I seem to be actually good at it (compared to like sc2 which I&#8217;ll never be good at haha). I totally forgot about that skill stat, what does that even mean!? lol</p>\n"}},{"node":{"content":"<p>Man, you&#8217;re such a boss at this game! I lost interest a bit because I don&#8217;t have the patience, always run around like a headless chicken and get shot from all sides. Last time my &#8220;Skill&#8221; on the profile page was -92 😛</p>\n"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"battlefield-3","wordpressId":1939}}