{"data":{"wordpressPost":{"title":"New Design!","content":"<p>Just today I launched the new design of my blog. I had been upset over my old design for a while; I couldn&#8217;t really put my finger on why, but I just felt that the design was really messy and unprofessional. One of things that REALLY bugged me is that the colours looked awful on Windows machines. For the new design, I decided to play it safe and stick with mostly grayscale colours. </p>\n<p><img src=\"http://localhost:8888/wp-content/uploads/2009/11/old_design.png\" alt=\"old_design\" title=\"old_design\" width=\"588\" height=\"378\" class=\"alignnone size-full wp-image-667\" srcset=\"http://localhost:8888/wp-content/uploads/2009/11/old_design.png 588w, http://localhost:8888/wp-content/uploads/2009/11/old_design-300x193.png 300w\" sizes=\"(max-width: 588px) 100vw, 588px\" /></p>\n<div class=\"sub\">The old design&#8230;ew!!</div>\n<p>I grabbed the background pattern that I created last year, and used it as a foundation of the new design. I didn&#8217;t want it to be too distracting so I toned down its opacity quite a bit. I&#8217;d like to work on a new background sometime soon because I feel this one is a bit too disorganized.</p>\n<p style=\"text-align:center;\">\n<img src=\"http://localhost:8888/wp-content/uploads/2009/11/repeat_Bg.jpg\" alt=\"repeat_Bg\" title=\"repeat_Bg\" width=\"450\" height=\"450\" class=\"alignnone size-full wp-image-681\" srcset=\"http://localhost:8888/wp-content/uploads/2009/11/repeat_Bg.jpg 450w, http://localhost:8888/wp-content/uploads/2009/11/repeat_Bg-150x150.jpg 150w, http://localhost:8888/wp-content/uploads/2009/11/repeat_Bg-300x300.jpg 300w\" sizes=\"(max-width: 450px) 100vw, 450px\" />\n</p>\n<div class=\"sub\">My repeatable background pattern</div>\n<p>I went through various variations of the design, getting feedback from friends and coworkers. <a href=\"http://markdunkley.com/\">Mark Dunkley</a> gave me a lot of quality feedback, as usual. I really liked the idea of having a 100% width &lt;div&gt;&#8217;s for the headers and footers. Later on I felt that having multiple &lt;div&gt;&#8217;s spanning across the page was a bit overkill, so I decided to keep it for just the footer.</p>\n<p>Big props to Steve Hatcher&#8217;s <a href=\"http://www.cssstickyfooter.com/\" title=\"CSS Sticky Footer\" target=\"_blank\">CSS Sticky Footer</a>, which I&#8217;m using using for this site. I can&#8217;t even think of how much time I would have spent if I were to figure out how to make a sticky footer on my own. Thank you, Mr. Hatcher!!</p>\n<p><img src=\"http://localhost:8888/wp-content/uploads/2009/11/old_design2.png\" alt=\"old_design2\" title=\"old_design2\" width=\"588\" height=\"378\" class=\"alignnone size-full wp-image-687\" /></p>\n<div class=\"sub\">An earlier version of the new design</div>\n<p>I think now I can finally say that I&#8217;m content with the design of my blog. Any feedback/comments would be greatly appreciated! I also have a pretty kick-ass Shopify tutorial coming up, so stay tuned!</p>\n<p><strong>UPDATE (11/20/2009):</strong> Taking Caroline&#8217;s advice, I decided to make it so that my logo is only present on the index page. This should make it easier for visitors with smaller laptops to browse my site :). Also, created a <a href=\"http://blog.tetsutakara.com/asdfasfda\">404 page.</a></p>\n","wordpress_id":650},"allWordpressWpComments":{"edges":[{"node":{"content":"<p>Hi Caroline, thanks for the great feedback! I especially liked the comment about the sandwich :), I definitely want to avoid that. </p>\n<p>You are absolutely right about the header. It does take up quite a large amount of vertical real estate, and this will definitely be a problem for 13&#8243; laptops. I&#8217;m going to think about making the header a bit smaller, or maybe even make it so that the bunny + bubble is only present on the index page. </p>\n<p>Thanks again for your comments Caroline! You rock!</p>\n"}},{"node":{"content":"<p>For people who don&#8217;t need to scroll to see both header and footer I totally see why this header works better than the span-across-black. No sandwich. But besides the sandwich, this variation has grown on me already and I appreciate it more now. I looks better. </p>\n<p>I was wondering if there could be a skip to content link for people who use laptop like me. Header takes quite a bit of vertical space. Really need to scroll to content each time. But then again, I would hate if I were you to add something to that header. I always prefer to remove rather than add, you know.</p>\n"}},{"node":{"content":"<p>Looks great, Tetsu. I like the span-across header too. I like both variations: that other one and this one. Your pattern is fantastic!!! and it has just the right intensity the way you use it for your background now. The width of your content is optimal, and so is text size. Your blog is very readable (something I always appreciate immensely). Most people use laptops to read you, I would assume (or maybe my brain is farting). Styling for the &#8216;active&#8217; menu item is a nice touch. And that menu is just perfect by the way. I am glad you&#8217;re using your iconic piggy head (or is it rabbit slash pig).</p>\n<p>Your old theme looked professional by the way. It&#8217;s all relative 🙂 the stakes have been raised higher with this new theme. It&#8217;s better, yeah. Better than great.</p>\n"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"new-design","wordpressId":650}}