{"data":{"wordpressPost":{"title":"Talkin&#8217; bout Grunt @ CodePen Ottawa","content":"<html><head></head><body><p><img src=\"https://www.tetchi.ca/wp-content/uploads/2015/09/CPD38GaWUAALQcy-1024x768.jpg\" alt=\"Grunt Talk\"></p>\n<div class=\"sub\">Photo cred: <a href=\"https://twitter.com/dfmcphee\">@dfmcphee</a></div>\n<p>The other night I did a little talk about <a href=\"http://gruntjs.com/\">Grunt JS</a> at the <a href=\"https://nvite.com/CodePenOttawa/e80d\">Ottawa Codepen Meetup</a>. I&#x2019;ve been using Grunt for some personal projects (including <a href=\"https://github.com/Tetsuro/tetchi-blog\">this blog</a>) and fell in love with how easy it is to set up and how much time it&#x2019;s saved me. If you haven&#x2019;t used Grunt before, I&#x2019;d recommend checking out Chris Coyier&#x2019;s &#x201C;getting started&#x201D; article <a href=\"https://github.com/Tetsuro/tetchi-blog\">here</a>.</p>\n<p><!--more--></p>\n<p>I&#x2019;m by no means a Grunt expert, but it was cool to share what I know with the attendees. More than anything it was a good opportunity to up my public speaking game. I noticed how much I lack in this department when I recently did my first ever best man speech at my friend&#x2019;s wedding. When I started the speech I was SO nervous; stuttering every other word and sweating with worry that my jokes would bomb. As I started to warm up and get the audience (who I barely knew) laughing more and more, I gradually got more comfortable and started talking like I would to a group of close friends. For the first time ever, I actually enjoyed talking in front of a crowd.</p>\n<p>Public speaking would be such a dope skill to master. The best man speech was a nice success, but I&#x2019;m so far from being good. I&#x2019;m hoping to get better at it by doing more talks at events like the CodePen Meetup. It really helps with your confidence and improves your ability to communicate your ideas across better. Doing talks related to your field helps reinforce your knowledge about the topic and gets you thinking about things that you might not actually know. Finally, they are good opportunities to consciously get rid of nasty speech habits (aka. &#x201C;like&#x201D;, &#x201C;um&#x201D;, &#x201C;you know&#x201D; every other word).</p>\n<p>I totally digressed from my original topic about Grunt, but whatever.</p>\n<p>Shoutouts to <a href=\"https://twitter.com/svinkle\">Scott</a> and <a href=\"https://twitter.com/brandonbrule\">Brandon</a> for organizing the meetup! Looking forward to attending the next ones.</p>\n</body></html>","wordpress_id":4051},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"talkin-bout-grunt-codepen-ottawa","wordpressId":4051,"newerPostSlug":"preventing-the-annoying-over-scrolling-inside-modals","olderPostSlug":"i-made-a-mixtape-mouthfeels"}}