{"data":{"wordpressPost":{"title":"March 2018: Smarch in Smashville Edition","content":"\n\t\t\t\t\n<!--more-->\n\n\n\n<h2>Stuff that happened</h2>\n\n\n\n<p>March had a lot of solo time. My girlfriend had gone back home to New Zealand at the end of February and all the way to March 26th, so it was just me and the cat for a solid month. I missed her company of course, but it was nice to have some alone time to focus on my hobbies and side projects.</p>\n\n\n\n<p>Speaking of solos, on the 17th I played a show at <a href=\"http://barentrenous.com/\">Bar Entre Nous</a> with the jazz trio that I play in. I had practiced like crazy leading up to the show so I was nowhere near as nervous compared to last year. I remember how nauseous I would get before shows last year, fearing that I&#8217;d bomb solos (which I did, but hey, that&#8217;s how you learn) or somehow de-rail the performance.</p>\n\n\n\n<figure class=\"wp-block-image alignwide\"><img src=\"http://localhost:9999/wp-content/uploads/2018/03/show-at-entre-nous.jpg\" alt=\"jazz show at Bar Entre Nous, Montreal\" /></figure>\n\n\n\n<p>\n    Show at Bar Entre Nous. JS on keys, me on upright, and Trev on drums.\n</p>\n\n\n\n<p>I felt great about the band and my performance. I wasn&#8217;t shy to take solos, and didn&#8217;t make any horrendous intonation mistakes (this is something I still struggle with sometimes, as the upright bass has no frets nor markers). It was awesome to hear the audience clapping after solos too &#8211; definitely a nice confidence booster!</p>\n\n\n\n<figure class=\"wp-block-image alignwide\"><img src=\"http://localhost:9999/wp-content/uploads/2018/03/bridgestone-arena.jpg\" alt=\"bridgestone\" /></figure>\n\n\n\n<p>Near the end of the month, I took a four-day trip down to Nashville, Tennessee for my good friend Jesse&#8217;s bachelor party. Jesse and I used to hang out on the regular back in 2009 to about 2012. We went separate ways but we remained very good friends.</p>\n\n\n\n<p>After landing in Nashville, we went straight downtown for the Leafs vs Predators game at Bridgestone Arena, where the Leafs proceeded to whoop the Predators 5-2. The atmosphere in Bridgestone Area was fantastic and I was impressed at how synced the fans were with their chants. We were also blessed with goals from the Holy Trinity (Auston Matthews, William Nylander, and Mitch Marner), which was awesome to see live.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"http://localhost:9999/wp-content/uploads/2018/03/shooting.jpg\" alt=\"shooting stuff in nashville\" /></figure>\n\n\n\n<p>The next days involved drinking, eating, go-karting, and shooting guns at a shooting range. Hoo boy, what a crazy experience that was. I&#8217;d never shot a gun before, so I was nervous as hell going into the shooting range (my palms were crazy sweaty). It was terrifying to hold something that could straight up murder someone. Doing something I&#8217;d only ever done in video games was pretty cool, but honestly I wouldn&#8217;t go out of my way to do it again.</p>\n\n\n\n<p>Unfortunately I snapped my no-drinking streak at 114 days during this trip. I ended up having some beers and a couple of shots&#8230; peer pressure is a bitch! I&#8217;ve started my no-drink again since coming back to Montreal.</p>\n\n\n\n<p>In all the Nashville trip was awesome and I can&#8217;t wait for Jesse&#8217;s wedding. I&#8217;m super happy for Jesse and I wish him and his future wife nothing but the best.</p>\n\n\n\n<h2>Things I learned</h2>\n\n\n\n<p>I didn&#8217;t have much time to do FED learning on the side this month, although I did start dabbling with <a href=\"https://www.gatsbyjs.org/\">Gatsby</a>. Gatsby is a new-ish static site generator that&#8217;s powered by React. My goal is to redo this blog using Gatsby and the WordPress REST API. It&#8217;ll be good to practice more React and update this blog&#8217;s front end at the same time; or as <a href=\"https://www.youtube.com/watch?v=pXEm08dsQOc\">Ricky</a> likes to say, get two birds stoned at once.</p>\n\n\n\n<h2>What&#8217;s on my mind</h2>\n\n\n\n<p>Man, they sure don&#8217;t make &#8217;em like they used to. Earlier in the month I had to take my BeatsX earphones to the Apple Store for repairs for the second time in less than three months. I&#8217;ve had the shittiest luck with Apple products as of late:</p>\n\n\n\n<ul>\n    <li>June 2017: Macbook, some keys on the keyboard got stuck and wouldn&#8217;t work.</li>\n    <li>November 2017: Macbook again, battery stopped charging. Had to replace logic board, wiping out all data.</li>\n    <li>November 2017: iPhone 7, camera stopped working.</li>\n    <li>November 2017: BeatsX, stopped connecting to any device.</li>\n    <li>December 2017: iPhone 7, the haptic feedback stopped working only a week after getting a replacement.</li>\n    <li>March 2018: BeatsX, right channel stopped working.</li>\n</ul>\n\n\n\n<p>All of the above required trips to the Apple Store and waiting on repairs. November was especially brutal because all three Apple products I had with me broke while I was in Naha, Japan, where there are no Apple Stores. I had to reinstall everything on my MacBook, I missed out on some good photo moments, and I had to buy some beater earphones in Japan. It&#8217;s really disappointing to see the quality of Apple hardware drop like this.</p>\n\n\n\n<h2>What I read</h2>\n\n\n\n<p>This month I read <a href=\"https://weaponsofmathdestructionbook.com/\">Weapons of Math Destruction</a> by Cathy O&#8217; Neil. In the book, O&#8217;Neil talks about how algorithms, if left unchecked, can really ruin lives and have negative effects on society as a whole. She goes over several dangerous algorithms (which she dubs Weapons of Math Destruction), such as the American justice system&#8217;s recidivism model, the University ranking system, credit card rating system, and more.</p>\n\n\n\n<figure class=\"wp-block-image aligncenter\"><img src=\"http://localhost:9999/wp-content/uploads/2018/03/weaopons-of-math-destruction.jpg\" alt=\"weapons of math destruction\" /></figure>\n\n\n\n<p>Overall I really enjoyed this book, and the anecdotes in it were really eye-opening. Her quote, &#8220;algorithms are opinions embedded in code&#8221; really stuck with me. We tend to think that mathematical models are objective, but in reality they have the biases and ideologies of their human creators embedded within them. It&#8217;s important to stop and question their original intentions and demand transparency.</p>\n\n\n\n<hr class=\"wp-block-separator\" />\n\n\n\n<p>That&#8217;s it for March! Thanks for reading, hope you have a great long weekend.</p>\n\t\t","wordpress_id":5432},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"march-2018-smarch-in-smashville-edition","wordpressId":5432,"newerPostSlug":"april-2018-go-leafs-go-edition","olderPostSlug":"february-2018"}}