{"data":{"wordpressPost":{"title":"Noobow: 1995-1997","content":"<p>Recently I was packing for <a href=\"https://www.tetchi.ca/adios-ottawa/\">my move to Montreal</a> and I came across a stack of comics that I had drawn from 1995 to approximately 1997.</p>\n<p><img src=\"https://www.tetchi.ca/wp-content/uploads/2016/07/nubo_tetsuro.jpeg\" alt=\"Noobow comic\" width=\"1000\" height=\"1291\" class=\"alignnone size-full wp-image-5077\" srcset=\"http://localhost:8888/wp-content/uploads/2016/07/nubo_tetsuro.jpeg 1000w, http://localhost:8888/wp-content/uploads/2016/07/nubo_tetsuro-232x300.jpeg 232w, http://localhost:8888/wp-content/uploads/2016/07/nubo_tetsuro-768x991.jpeg 768w, http://localhost:8888/wp-content/uploads/2016/07/nubo_tetsuro-793x1024.jpeg 793w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" /></p>\n<div class=\"sub\">Noobow: episode 1 of 57.</div>\n<p><!--more--></p>\n<h2>Noobow: the origins</h2>\n<p>The comic was called ぬーぼー (Noobow), and the recurring main character was the mascot of a Japanese chocolate bar of the same name. I discovered Noobow through advertisements in Japanese magazines that my grandparents sent us back in the early to mid-90s.</p>\n<p>I find it interesting how I became so attached to the mascot of a chocolate bar that I never even had the pleasure of eating. Having grown up in Canada, I had no way to get my hands on a Noobow bar. I think it was because the Noobow character was goofy-looking and mapped well with the slapstick-style humour that I wanted to create. Above all he was really easy to draw.</p>\n<p style=\"text-align: center;\">\n  <img src=\"https://www.tetchi.ca/wp-content/uploads/2016/07/Gufgr.jpg\" alt=\"Noobow choclate bar\" />\n</p>\n<div class=\"sub\">Noobow chocolate bar. I&#8217;m not sure if they still make them.</div>\n<h2>A peak into the past</h2>\n<p>Looking into these comics reminded me of little things from my past that I&#8217;d completely forgotten about. For example in the first comic I noticed the breakfast that Noobow is eating is something I used to eat all the time growing up: raw egg on top of a bowl of rice with soy sauce. I also love that the soy sauce bottle is the <a href=\"https://www.asianfoodgrocer.com/media/catalog/product/cache/1/image/800x800/9df78eab33525d08d6e5fb8d27136e95/k/i/kik_2.jpg\">Kikkoman bottle</a> that my mom used to buy when I was kid.</p>\n<p style=\"text-align: center;\">\n<img src=\"https://www.tetchi.ca/wp-content/uploads/2016/08/noobow_egg_n_rice.jpeg\" alt=\"noobow_egg_n_rice\" />\n</p>\n<div class=\"sub\">Egg + rice + soy sauce = breakfast of champions</div>\n<p>There are a bunch of other nuggets from the past that I noticed. As I read through them, I could vividly remember the thought process behind each one: truly a surreal feeling.</p>\n<h2>Why I made them</h2>\n<p>The main reason I wrote these comics was to make my older brother laugh. The ones with heavy eraser marks are the ones that failed to do so. They were heavily influenced by <em>Mr.Bean</em> skits that I&#8217;d watch with my family and Japanese <a href=\"https://en.wikipedia.org/wiki/Yonkoma\">yonkama</a> gag mangas. <em>Yonkoma</em> is a type of manga that&#8217;s limited to four panels: three panels to set up a scene and a joke, and a fourth for the punchline. I exceeded the four panel limit many times.</p>\n<p>A lot of them are based off inside jokes with my brother so don&#8217;t make much sense. Looking bac they are quite cringeworthy 😅</p>\n<h2>Moving on</h2>\n<p>Looking at the last, unfinished page made me a bit sad. I loved making Noobow comics and making my old brother laugh, but eventually I just ran out of fuel. I must&#8217;ve I picked up new hobbies and interests and Noobow faded into memory. This is also around the time I got my hands on <a href=\"http://vignette2.wikia.nocookie.net/pokemon/images/d/d7/GreenBox%28J%29.jpg/revision/latest?cb=20090206222053\">Pokemon Green</a> so that may be a factor too.</p>\n<p><img src=\"https://www.tetchi.ca/wp-content/uploads/2016/08/noobow-final.jpeg\" alt=\"final noobow comic\" /></p>\n<p>Thanks for the memories Mr. Noobow. It was fun drawing you and putting you in awful situations.</p>\n<hr />\n<p><em>Thanks for reading! Full Noobow comic series can be found <a href=\"https://www.dropbox.com/sh/nplttztcjiqdmc6/AAC73F2buwBsQOhbEL4xrvTZa?dl=0\">here</a>. Do you still have old pieces of art that you made when you were a kid? If you do, share them!</em></p>\n"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"ce8f5806-1f7c-5332-9e73-afb01f30b832"}}