{"data":{"wordpressPost":{"title":"Autodesk Maya: Exporting to FBX","content":"<p>For Senior Project at school, I was responsible for modeling and animating 3D fishes. The app that we were using required me to export the models into FBX file. I learned the hard way that exporting to FBX is a HUGE pain in the butt, and hopefully this article can smooth things out for anyone working with Maya &amp; FBX.</p>\n<h2 class=\"steps\">Thing to keep in mind when exporting to FBX</h2>\n<ul>\n<li>Deformer animations simply do not work. I&#8217;ve browsed through many, many forums looking for a solution but could not find an answer. What happens is that once exported to FBX, only the first frame will have the deformers applied, but not for any frames after that. This means that for the rest of the animation, the object being deformed will maintain the same shape from the first frame.</li>\n<li>Blend shapes work! You just have to re-arrange the Input Orders (explained later)</li>\n<li>Constraints may not alway work. I used parent constraints for my eyes and some of the controls, but they would do odd things when exported. For example, even though they&#8217;d work perfectly as an .mb file, in the FBX file there would be an offset on the objects that were constrained, so they wouldn&#8217;t be in the right positions.</li>\n<li>You have to delete non-deformer history after you smooth your mesh. Otherwise, even when your model is exported, it will still be unsmoothed.</li>\n<li>Make sure all your normals are facing the right way. To see normals, go to <strong>Display &gt; Polygons &gt; Face Normals</strong>. Not having the normals pointing the right way will mess up many things in the app/game, primarily the lighting.</li>\n</ul>\n<p>Below, I&#8217;ve outlined the steps to properly export an FBX file. There is also a <a href=\"http://www.youtube.com/watch?v=MqyGvEXuif4\" target=\"_blank\">supplementary video</a> that may help you get started. At this point, you should have the character modeled, textured, the joints and controls set up, and the mesh for any blend shapes created.</p>\n<p style=\"text-align:center;\">\n<img class=\"aligncenter size-medium wp-image-1547\" title=\"The Initial setup of the Maya scene\" src=\"http://localhost:8888/wp-content/uploads/2011/04/Screen-shot-2011-04-08-at-8.09.49-PM-588x317.png\" alt=\"initial setup\" width=\"588\" height=\"317\" />\n</p>\n<div class=\"sub\">Fig. 1: The initial setup</div>\n<p><!--more--></p>\n<h2 class=\"steps\">The proper steps for exporting to FBX</h2>\n<h3>1. Smooth-bind the mesh to your rig.</h3>\n<p>Make sure you have the Animation menu open. Select the root joint, then select the mesh. Go to <strong>Skin &gt; Bind Skin &gt; Smooth Bind</strong>. Now, when you move your joints, your mesh should move as well. Don&#8217;t smooth just yet! Keep working in smooth-preview mode for now (hit 3 on your keyboard).</p>\n<h3>2. Weight paint the non-smoothed mesh.</h3>\n<p>You should now go ahead and weight-paint your model. I won&#8217;t go over the details on how to weight paint here, but I found <a title=\"weight paint tutorial\" href=\"http://www.youtube.com/watch?v=xMuo8SsIaQA\">this tutorial</a> by unpicked1 very useful. It&#8217;s easier if you weight-paint before you smooth, since there are less vertices to worry about.</p>\n<p style=\"text-align:center;\"><img class=\"aligncenter size-medium wp-image-1535\" title=\"weight-painting the fish\" src=\"http://localhost:8888/wp-content/uploads/2011/04/Screen-shot-2011-04-08-at-7.32.36-PM-588x469.png\" alt=\"weight-painting the fish\" width=\"588\" height=\"469\" />\n</p>\n<div class=\"sub\">Fig. 2: Weight painting the fish, with Color Ramps.</div>\n<p>You only have to weight paint one side of your character. You can use the <strong>Mirror Skin Weight</strong> tool later to copy the weights from one side to another. When you use this tool, make sure your character is in its bind pose.</p>\n<h3>3. Animate the model.</h3>\n<p>Use your rig to animate the model. Walk, jump, swim&#8230; go nuts!</p>\n<h3>4. Smooth the mesh</h3>\n<p>Switch to the Polygons menu. Select the mesh, and go to <strong>Mesh &gt; Smooth</strong>. If you have any meshes for blend shapes, go ahead and smooth them too. You may be tempted to export to FBX right away, but if you do now, your FBX model&#8217;s mesh will not be smoothed. Once you smooth it, you may have to weight-paint certain areas that may not be moving as they should.</p>\n<p style=\"text-align:center;\"><img class=\"aligncenter size-medium wp-image-1540\" title=\"smoothed meshes\" src=\"http://localhost:8888/wp-content/uploads/2011/04/Screen-shot-2011-04-08-at-7.56.34-PM-588x350.png\" alt=\"smoothed meshes\" width=\"588\" height=\"350\" /></p>\n<div class=\"sub\">Fig.3: All meshes are now-smoothed, including the blend shapes.</div>\n<h3>5. Delete Non-Deformer History.</h3>\n<p>Go to <strong>Edit &gt; Delete by Type &gt; Options</strong>. Make sure that &#8220;All non-deformer history&#8221; is selected (Fig. 4).</p>\n<p style=\"text-align:center;\"><img class=\"aligncenter size-full wp-image-1544\" title=\"delete non-deformer history options\" src=\"https://www.tetchi.ca/wp-content/uploads/2011/04/Screen-shot-2011-04-08-at-8.07.56-PM.png\" alt=\"delete non-deformer history options\" width=\"574\" height=\"330\" />\n</p>\n<div class=\"sub\">Fig. 4: Delete Non-Deformer History Options</div>\n<p>Select the main mesh (not the blend shapes). Go to <strong>Edit &gt; Delete by Type</strong>. This deletes the smooth node from the mesh, so now when you export it, it will be smooth in the FBX as well! If you did a simple Delete History, it would have deleted the smooth, but all weight-paint information and animations will be lost.</p>\n<h3>6. Create blend shape.</h3>\n<p>Switch to the Animation menu. Select the blend shape mesh, Shift+Select the main mesh, then go to <strong>Create Deformers &gt; Blend Shape</strong>. The main mesh should now have a new attribute for the blend shape. When this new attribute gets closer to 1, the main mesh becomes more and more similar to the blend shape. Notice how in Fig.5, the goldfish&#8217;s mouth is now open like the blend shape.</p>\n<p style=\"text-align:center;\">\n<img class=\"aligncenter size-medium wp-image-1551\" title=\"blend shape created\" src=\"http://localhost:8888/wp-content/uploads/2011/04/Screen-shot-2011-04-08-at-8.19.16-PM-588x328.png\" alt=\"blend shape created\" width=\"588\" height=\"328\" />\n</p>\n<div class=\"sub\">Fig.5: The mesh now has a blend shape.</div>\n<h3>7. Change Input Orders</h3>\n<p>The problem right now is that the blend shape is now prioritized over the animations. This means that if the value for the blend shape attribute is set to 1, the mesh will take on the blend shape for the duration of timeline instead of doing the animations. To fix this, we must change the input orders of the main mesh. Right click and hold on the main mesh, and go to <strong>Inputs &gt; All Inputs</strong> (Fig. 6).</p>\n<p style=\"text-align:center;\">\n<img class=\"aligncenter size-medium wp-image-1555\" title=\"All Inputs menu\" src=\"http://localhost:8888/wp-content/uploads/2011/04/Screen-shot-2011-04-08-at-8.32.10-PM-588x324.png\" alt=\"\" width=\"588\" height=\"324\" />\n</p>\n<div class=\"sub\">Fig.6: Opening the All Inputs menu.</div>\n<p>You will now see all the inputs of that mesh. Middle-click and drag the Blend Shape node on top of the Tweak node (when you middle-click over the Blend Shape node, you should see a plus sign). See Fig.7.</p>\n<p style=\"text-align:center;\"><img class=\"aligncenter size-medium wp-image-1558\" title=\"before and after of inputs\" src=\"https://www.tetchi.ca/wp-content/uploads/2011/04/blendshape-588x204.png\" alt=\"before and after of inputs\" width=\"588\" height=\"204\" />\n</p>\n<div class=\"sub\">Fig. 7: Before and After of Inputs for main mesh.</div>\n<p>Now, even with the blend shape attribute set to 1, the model will retain its animation, PLUS have the blend shape applied.</p>\n<h3>8. Include blend shapes into animation</h3>\n<p>You can no go ahead and keyframe the blend shapes into your animation. For me, I used the fish&#8217;s blend shape to animate the opening/closing of the fish&#8217;s mouth (Fig. 8).</p>\n<p style=\"text-align:center;\"><img class=\"aligncenter size-medium wp-image-1563\" title=\"correct input orders\" src=\"http://localhost:8888/wp-content/uploads/2011/04/Screen-shot-2011-04-08-at-8.44.01-PM-588x376.png\" alt=\"correct input orders\" width=\"588\" height=\"376\" />\n</p>\n<div class=\"sub\">Fig. 8: Animated goldfish with the right input orders</div>\n<h3>9. Check export options &amp; export</h3>\n<p>Go to <strong>File &gt; Export Selection&#8230; &gt; Options</strong>. Under file type, select &#8220;FBX export&#8221;. Click the &#8220;Edit preset&#8221; button to open the FBX export options. In the options for the FBX export, look over the following:</p>\n<ul>\n<li>Under &#8220;Animation&#8221;, make sure the Animation checkbox is checked.</li>\n<li>Under &#8220;Bake Animation&#8221;, make sure the Bake Animation checkbox is checked. Also, set the Start and End values to the duration of your animation.</li>\n<li>Under &#8220;Deformed Models&#8221;, make sure all checkboxes are checked</li>\n</ul>\n<p>Once this is done. select your model or the group containing your model. Go to <strong>File &gt; Export Selection&#8230;</strong>. Export the FBX model to the directory of your choice. You should now have a fully-working FBX model.</p>\n<p>I made a supplementary video that guides you through this as well. You can check it out <a title=\"Supplementary video\" href=\"http://www.youtube.com/watch?v=MqyGvEXuif4\" target=\"_blank\">here</a>.</p>\n<h2 class=\"steps\">Conclusion</h2>\n<p>Anyway, those were my findings while working with FBX, and I couldn&#8217;t find information on this anywhere else.</p>\n<p>Hope it helps!</p>\n<p>*UPDATE* Caught embarrassing mistake. Thanks <a href=\"http://www.grantlucas.com/\">Grant</a>!</p>\n","wordpress_id":1460},"allWordpressWpComments":{"edges":[{"node":{"content":"<p>Hey there,</p>\n<p>I&#8217;m working on a fun little app with a developer, a character designer from Disney, and animator from Dream Works. </p>\n<p>I&#8217;m running into a similar problem, and my animator is unable to figure out how to successfully export the file as a proper FBX file format. </p>\n<p>We actually need the file to be converted to a DAE file format, but I&#8217;ve read that you can get there by first exporting it to a FBX format and then converting it to a DAE format afterwards. </p>\n<p>I was wondering if you&#8217;d be interested in helping us figure out how to properly convert the Maya animation to an FBX format. </p>\n<p>I can pay you for your time. </p>\n<p>Please let me know if you can help us out, it&#8217;d be greatly appreciated! </p>\n<p>Take care,<br />\nJack</p>\n","author_name":"Jack"}},{"node":{"content":"<p>Thanks, great blog!</p>\n<p>But i get really terrible issue´s by exporting fbx files with placement textures like crater or something.<br />\nHow should i proceed?<br />\nLook forward for your reply!</p>\n","author_name":"Marco"}},{"node":{"content":"<p>Great write-up!<br />\nYou should mention that the source of the trouble is that FBX is not a native Maya format, but a format for exchange of media between different applications. It&#8217;s not completely open per se, but Autodesk provides a comprehensive SDK that one can use to export/import FBX.<br />\nIf Autodesk allowed exporting all the features present in Maya (like all deformers), they&#8217;d also have to supply the proprietary code that applies all the deformations. Not necessarily open source it, but at least supply it with the SDK. And while most of that code is trivial , some of it may have some trade secrets (however ridiculously outdated).<br />\nEven if that wasn&#8217;t an issue, it&#8217;d still be a huge amount of work to essentially embed all the features of .ma/mb file into fbx.<br />\nEven if they decided to do that, what do you do with custom nodes? Do you export them and say &#8220;good luck on the other end&#8221;? 🙂<br />\nEven if all of the above was magically solved, it&#8217;d make already complex and versatile format even more complex. This means adoption would suffer and FBX wouldn&#8217;t be supported completely by anyone (because to support it would require a lot more effort, essentially as much as supporting loading a full Maya scene). Even worse, if adoption wasn&#8217;t an issue (like if Autodesk decided to extend FBX with a bunch of features to support more precise export from Maya scenes), it&#8217;d only mean that a lot of software that supports FBX fully now simply wouldn&#8217;t support those features. It&#8217;s even worse because after exporting FBX you&#8217;d never know what shows up in which other software you&#8217;re importing it.<br />\nI&#8217;m rambling, though 🙂</p>\n","author_name":"Sergiy"}},{"node":{"content":"<p>Thanks alot for this information!</p>\n","author_name":"Carin"}},{"node":{"content":"<p>Very helpful post! Thanks.</p>\n","author_name":"Mudit"}},{"node":{"content":"<p>Thank man, might be quote old but still really useful! I&#8217;m using this tutorial to create my own character in a psp game (dissidia 012).</p>\n","author_name":"jord"}},{"node":{"content":"<p>Thanks for reading! 🙂</p>\n","author_name":"tetchi"}},{"node":{"content":"<p>great tutorial!!<br />\nthanks man</p>\n","author_name":"maytha satika"}},{"node":{"content":"<p>is it possible to export animated scenes with referenced files? ex. all the characters and environment are referenced (all files are maya 2013 ascii) then animated and saved as a maya 2013 file. now i need to export it as fbx for import in maya 2011.  i tried exporting a single character as fbx (rigged without animation/maya2013 ascii) i used fbx 2011 in advanced options. when i imported the fbx in maya 2011 all the constraints were not imported, although i checked the constraints while exporting from maya 2013.<br />\nthis is basically what i need to do. convert all maya 2013 scene files (animated referenced files) to maya 2011 scene files. </p>\n<p>anybody knows how to solve this?</p>\n","author_name":"jestoni"}},{"node":{"content":"<p>@Cakewalkcg thanks for the kind words!</p>\n<p>@Feras Man, I wish I could tell you but I&#8217;ve been without Maya for almost 1.5 years&#8230; sorry man 🙁</p>\n","author_name":"tetchi"}},{"node":{"content":"<p>Do you know how to reduce the file size of an fbx?  right now, animations i&#8217;m exporting are coming out at hundreds of kilobytes, and I&#8217;d like to know if there was a way to reduce the size in any way.</p>\n","author_name":"Feras"}},{"node":{"content":"<p>Hi,</p>\n<p>      Very important tutorial. Almost lot of fellows skip the &#8220;Change Input Order&#8221; step while exporting to FBX. Nice to see you put it there.</p>\n<p>Keep up buddy.</p>\n<p>Regards,<br />\nCakewalkcg<br />\n&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8211;<br />\nVisit <a href=\"http://www.cakewalkcg.com\" rel=\"nofollow\">http://www.cakewalkcg.com</a> for free 3D models and video tutorials.</p>\n","author_name":"Cakewalkcg"}},{"node":{"content":"<p>Frikkin sweet!! I&#8217;m glad you guys found this handy!</p>\n","author_name":"Tetsuro"}},{"node":{"content":"<p>OMG! I need to do this for school too, and this has helped a LOT! Thank You!</p>\n","author_name":"Ian"}},{"node":{"content":"<p>Awesome, thanks Jeffrey! I&#8217;m glad someone found it useful!  🙂</p>\n","author_name":"Tetsuro"}},{"node":{"content":"<p>Great post man! I&#8217;ve been searching for hours for this info, and I finally hit the motherload for exporting maya objects. Thanks you!</p>\n","author_name":"Jeffrey"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"autodesk-maya-exporting-to-fbx","wordpressId":1460}}