{"data":{"wordpressPost":{"title":"Boomi: 3D Animation","content":"<p>On Monday I finally finished my fall semester, and one of the many things that I worked on was a 3D animation. Throughout the semester we learned to model, rig, weight, and animate in Autodesk Maya, and our term project was to create a 3D animated short.</p>\n<p>Here is the final animation, enjoy :)</p>\n<p><iframe src=\"http://player.vimeo.com/video/22106147\" width=\"588\" height=\"331\" frameborder=\"0\"></iframe></p>\n<p>Overall, I&#8217;m pretty happy with the result, but I wish I had more time to improve on certain areas. In particular, I want to improve the animations and timing. I was never trained in traditional animation, and I find most of Boomi&#8217;s animations a little &#8216;floaty&#8217;. In the future I&#8217;d like to study more about animation in order to get that tight animation that you see in Pixar movies. I would also like to have better voices and sound effects.<br />\n<!--more--></p>\n<h2 class=\"steps\">The Process</h2>\n<p>The first thing we had to do for our animations was create a storyboard, as well as 2D animatic, shown below. The animation was basically a series of panels and images representing each shot.</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"588\" height=\"355\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowFullScreen\" value=\"true\" /><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"http://www.youtube.com/v/dxozqUTbXM4?fs=1&amp;hl=en_US\" /><param name=\"allowfullscreen\" value=\"true\" /><embed type=\"application/x-shockwave-flash\" width=\"588\" height=\"355\" src=\"http://www.youtube.com/v/dxozqUTbXM4?fs=1&amp;hl=en_US\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object></p>\n<p>Once that was done, I started modeling Boomi. I used a model of a chubby character that I found on TurboSquid as a starting point, and modified it to make it fit Boomi&#8217;s proportion. I stuck on Boomi&#8217;s head on top, and voila! The model was complete. I kept his body parts as simple as possible because I wanted to make the rigging process as simple as possible (a realistic body wouldn&#8217;t really fit in with the cartoony style of Boomi).</p>\n<p style=\"text-align:center;\">\n<img class=\"alignnone size-medium wp-image-1325 lazy-load\" title=\"Boomi modeling \" data-src=\"https://www.tetchi.ca/wp-content/uploads/2010/12/Screen-shot-2010-12-22-at-11.41.23-PM-588x464.png\" alt=\"\" width=\"588\" height=\"464\" />\n</p>\n<div class=\"sub\">Modeling Boomi &#8211; smoothed (left side) vs. non-smoothed (right side)</div>\n<p>One thing that I learned was to smooth the mesh immediately. Maya has this cool feature where you can see a preview of a smoothed mesh by hitting the &#8216;3&#8217; key, and what&#8217;s cool is that when you render your image with Hardware Rendering or Mental Ray, the mesh will still be smoothed.</p>\n<p>The next step was to set up a rig for Boomi so that he could be animated. The rig is made up of joints, and it essentially acts as the &#8216;skeleton&#8217; for Boomi. Controls (the boxes, circles and various other shapes that you see around Boomi) were also created. The purpose of controls is to simplify the animation process. They allow you easily select and keyframe joints and attributes. </p>\n<p style=\"text-align:center;\">\n<img class=\"alignnone size-medium wp-image-1332 lazy-load\" title=\"All rigged up and ready to be animated\" data-src=\"https://www.tetchi.ca/wp-content/uploads/2010/12/Screen-shot-2010-12-22-at-11.52.47-PM-588x430.png\" alt=\"\" width=\"588\" height=\"430\" />\n</p>\n<div class=\"sub\">All rigged up and ready to be animated</div>\n<p>When the skeleton was first bound to the mesh, some of Boomi&#8217;s vertices that shouldn&#8217;t be affected would be affected by certain joints. For example, initially when I moved Boomi&#8217;s arm, his leg would deform as well. To fix this, I used the Weight Paint tool to specifically assign which vertices each joint should be affecting. At first I had tried weighting AFTER I smoothed the mesh &#8211; this was a huge mistake and I wasted so many hours doing this. When you smooth the mesh, you create a lot of extra vertices and that makes the weighting process much harder since you have to deal with a larger amount of vertices. It&#8217;s best to keep the mesh unsmoothed, and just switch back and forth between smoothed/unsmoothed (hit the 1 and 3 keys) as you go through the weight painting process.</p>\n<p>Once Boomi was weighted, we were to create some animation tests to make sure he can do all of the main movements without any odd deformities to the mesh. </p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"588\" height=\"355\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowFullScreen\" value=\"true\" /><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"http://www.youtube.com/v/GI-L9nhEHfs?fs=1&amp;hl=en_US\" /><param name=\"allowfullscreen\" value=\"true\" /><embed type=\"application/x-shockwave-flash\" width=\"588\" height=\"355\" src=\"http://www.youtube.com/v/GI-L9nhEHfs?fs=1&amp;hl=en_US\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object></p>\n<p>Finally, after the preparation of Boomi was complete, I started implementing Boomi into the sets that I created, using Maya&#8217;s Camera Sequencer and Trax Editor. I must say, the Trax Editor is a freakin&#8217; sweet tool &#8211; it allows you to use canned animations and loop it really easily (not only that, it also lets you adjust the speed of the cycles). It is perfect for things like walk cycles, dancing, and any kind of motion that might be looped. </p>\n<p>Hope you enjoyed the animation! To the students in my program who have to take this course next year &#8211; let me know if you have any questions and I&#8217;d be more than happy to help out!</p>\n"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"boomi"}}