{"data":{"wordpressPost":{"title":"Japan Trip 2015 Part 5: Okinawa","content":"<p>\t\t\t\tSweet home Okinawa baby! We landed in Naha, Okinawa on the 26th and immediately felt the island heat. The temperature in mainland Japan was cool and comfortable, but in Okinawa it was in the high twenties with a humidex of like, 40000%.</p>\n<p><!--more--></p>\n<h3>Naha</h3>\n<p>We first met up with my brother Kohei who lives in Naha and went for lunch at the nearby MOS Burger. MOS Burger is a Japanese chain and it&#8217;s something I always look forward to whenever I go back to Japan. Their burgers are nothing special in terms of size, but the quality and flavour make them godlike.</p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2015/11/mos_burger.jpg\" alt=\"Mos Burger mmm\" /></p>\n<div class=\"sub\">I typically crush two MOS burgers in one sitting.</div>\n<p>We took it pretty easy the first night. We had some Orion beer and delicious tsukemen (dipping noodles) and called it a night.</p>\n<h3>Churaumi Aquarium</h3>\n<p>The next morning we took a trip out to the Churuami Aquarium, about two hours away from Naha.</p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2015/11/DSCF1033.jpg\" alt=\"Whale Sharks at ChuraUmi\" /></p>\n<div class=\"sub\">Whale sharks are huge.</div>\n<p>No matter how many times I see the whale sharks I&#8217;m always mesmerized by them. They&#8217;re humongous but so harmless looking. There were a lot of other funky-looking sea creatures, including the biggest goddamn crab-lobsters I&#8217;ve ever seen in my life.</p>\n<p>There were cool sights outside of the aquarium too. We saw water tanks with manatees and turtles, as well as a nice beach where the boys got a little taste of Okinawa&#8217;s crystal-clear ocean water (not literally, that shit is salty as hell).</p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2015/11/sharhan_beach.jpg\" alt=\"Sharhan at Churaumi\" /></p>\n<div class=\"sub\">Sharhan&#8217;s solo album cover. Photo by Gary.</div>\n<p>In the distance you can see an island with a little mountain called Iejima Tacchuu. I remember hiking to the top of it with my family back in &#8217;98. Good times.</p>\n<h3>Tokashiki Island</h3>\n<p>On our third day in Okinawa we took a ferry from Naha to Tokashiki Island. Tokashiki is a small island about 35km west of the main Okinawa Islands.</p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2015/11/aharen_beach.jpg\" alt=\"Aharen Beach, Tokashiki, Okinawa\" /></p>\n<div class=\"sub\">Aharen Beach, Tokashiki Islands, Okinawa. Basically real life Far Cry. Photo by Gary.</div>\n<p>Words couldn&#8217;t describe how beautiful this island was. The crystal-clear water and white sand left us speechless. We immediately rented some snorkeling gear from the BnB and ran into the water like they do in sappy vacation commercials. Gary got a little too excited and forgot to empty his pockets before jumping in. He ended up losing a 10,000 yen bill and his driver&#8217;s license in the deep blue sea.</p>\n<p>The BnB we stayed at was called <a href=\"http://seafriend.jp/\">Seafriend</a>. If you&#8217;re thinking of going to Tokashiki, I can&#8217;t recommend these guys enough. They provide awesome food for dinner and breakfast, and rent out a bunch of beach gear. Snorkeling is a must; it was wicked to swim alongside beautiful tropical fishies.</p>\n<p style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.250%;\"><iframe src=\"https://streamable.com/e/5uvt\" frameborder=\"0\" allowfullscreen webkitallowfullscreen mozallowfullscreen scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\"></iframe></p>\n<div class=\"sub\">Sup Nemo, Marlin! Shot with Jared&#8217;s Lumix.</div>\n<p>After days of walking around cities and hiking up hills, it was awesome to unwind and just bum out at a beach. Chilling by the beach with good friends and beer was somewhat surreal. It was just so relaxing, it felt as if time had slowed down.</p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2015/11/beach_beer_buds.jpg\" alt=\"beach beer buds\" /></p>\n<div class=\"sub\">Beach, beer, buds</div>\n<h3>Back to Naha, Mario Kart time!</h3>\n<p>After enjoying the sweet sweet beach life, we took the ferry back to Naha to do some go-karting. Normally when you think &#8220;go-karting&#8221; you&#8217;d imagine ripping around inside a track. However, the place we went to let you take the karts out on actual city streets. Oh, and they let you cosplay as Mario Kart/superhero characters.</p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2015/11/mario-kart-okinawa.jpg\" alt=\"mario kart okinawa\" /></p>\n<div class=\"sub\">Marvel vs DC vs Mario Kart</div>\n<p>This was hands down the silliest thing I&#8217;ve ever done in my life. So many things could have gone wrong lol. Here are just a handful of the dangers that we encountered:</p>\n<ul>\n<li>The karts were sketchy at best. The guy at the rental shop gave us a list of twenty+ things <strong>not</strong> to do while driving, and that made us pretty nervous.</li>\n<li>The karts would stall often, and we blocked traffic a few times. Their turning radii were also quite horrible.</li>\n<li>The sun went down ten minutes after we started driving.</li>\n<li>Minh&#8217;s kart&#8217;s lights stopped working (lol). </li>\n<li>Sharhan&#8217;s Batman mask blocked 90% of his vision.</li>\n<li>We didn&#8217;t know where the hell we were going so at one point we ended up on one of the busiest roads, <a href=\"https://en.wikipedia.org/wiki/Japan_National_Route_58\">Route 58</a>. </li>\n<li>It was our first time driving in Japan, so it was like playing real life Mirror Mode (traffic direction is opposite in Japan).</li>\n<li>We weren&#8217;t exactly experts in Japanese traffic law. I&#8217;m pretty sure we cruised down some bus lanes on Route 58 when we weren&#8217;t supposed to. </li>\n</ul>\n<p>I suppose all of this added to the thrill. Even with the above dangers we had an absolute blast, and I would 100% do it again. Probably not during rush hour and in the dark next time, haha.</p>\n<style>.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }</style>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/S9baktdGvow' frameborder='0' allowfullscreen></iframe></div>\n<div class=\"sub\">Out fer a rip! Video taken by Jared.</div>\n<p>After karting we went to a restaurant with all-you-can-drink Awamori (Okinawan liquor) and had a toast to us not dying. We had a course meal of traditional Okinawan plates &#8211; really good stuff. Some of my cousins dropped by too, which was awesome since I hadn&#8217;t seen them in years.</p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2015/11/DSCF1215.jpg\" alt=\"DSCF1215\" /></p>\n<div class=\"sub\">Minh, Jared, and Shar. Kampai homies!!!</div>\n<p>The next morning we hopped on a plane to our next stop, Tokyo.</p>\n<h3>Takeaways</h3>\n<ul>\n<li>Check out the Churaumi Aquarium! Going early is best as it tends to get crazy busy in the afternoon.</li>\n<li>Highly recommend staying at <a href=\"http://seafriend.jp/\">Seafriend</a> if you&#8217;re thinking of going to Tokashiki Island. </li>\n<li>Empty your pockets before jumping into the ocean. </li>\n<li>Check out <a href=\"http://www.trike.jp/\">Blue Sky Resort</a> for some real life Mario Kart action. Don&#8217;t forget to get an International Driving Permit (we got ours through <a href=\"http://www.caa.ca/travelling/idp/\">CAA</a>).</li>\n</ul>\n<p><em>Big thanks to my bro Kohei for his help and showing us around the cool spots in Okinawa!</em></p>\n<hr />\n<p><a href=\"/japan-trip-2015/\">← Back to Japan Trip 2015 index</a>\t\t</p>\n","wordpress_id":4276},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"japan-trip-2015-part-5-okinawa","wordpressId":4276}}