{"data":{"wordpressPost":{"title":"Book Goals (mid-2017 update)","content":"<p>\t\t\t\tOne of my goals for this year that I mentioned in my <a href=\"https://www.tetchi.ca/2016-postmortem/\">2016 postmortem</a> was to get back into reading. I failed miserably at this last year so I decided to challenge myself to read at least one book a month. I&#8217;ve been doing pretty good on this, and I wanted to share some of the books that I&#8217;ve read so far.</p>\n<p><!--more--></p>\n<h2>1. Sapiens</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/dp/B00JTCH382/\"><img src=\"http://localhost:9999/wp-content/uploads/2017/04/Sapiens_A_Brief_History_of_Humankind.jpg\" alt=\"Sapiens cover\" /></a></p>\n<div class=\"sub\">Sapiens, by Yuval Harari</div>\n<p>Sapiens is a book about how humans went from simple primates to being on top of the food chain. The book goes into the several human revolutions (cognitive, agricultural, scientific) and each section blew my mind. For example, the whole idea of how humans developed the ability to believe in imaginary things (money, religion, corporations, etc) to unite and build empires was really eye-opening.</p>\n<p>Harari&#8217;s observation about how humans made a huge mistake by transitioning from a hunter-gatherer lifestyle to an agricultural (farming) one was also really interesting. We  assume that an agricultural lifestyle was the right choice because that&#8217;s how we live now, but in reality there were many downsides to this decision. Harari argues that we ultimately put ourselves in a situation where we can multiply more under worse conditions. What other things are we doing today that we might regret hundreds or thousands of years from now?</p>\n<p><em>Sapiens</em> is filled with many interesting observations on human history, and I can&#8217;t recommend it enough.</p>\n<p><strong>10/10 &#8211; a must read.</strong></p>\n<h2>2. Animal Farm</h2>\n<p>I was hesitant to include Animal Farm on this list because it  was such a short read and I read it way back in high school. In the end I decided to include it because it&#8217;s been long enough that I&#8217;d forgotten most of what happened.</p>\n<p>Animal Farm is about a group of farm animals that revolt against their human owners to form their own society. This newfound society starts off fair, but the pigs gradually start taking over and gradually become more and more like their past human masters.</p>\n<p>Even after all these years I still really enjoyed this book. [Spoilers] The part where the pigs stand up like humans still give me goosebumps[/Spoilers]. Animal Farm is a fantastic commentary of the Russian Revolution and there&#8217;s a reason why it&#8217;s a classic.</p>\n<p><strong>9/10 &#8211; a must read</strong>.</p>\n<h2>3. Forging Zero</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Forging-Zero-Legend-ZERO-Book-ebook/dp/B00BTKA42Y/\"><img src=\"http://localhost:9999/wp-content/uploads/2017/04/18585999.jpg\" alt=\"Forging Zero\"  /></a></p>\n<p><em>Forging Zero</em> is a science fiction book that follows Joe Dobbs, a 14-year old boy who is one of a million Earth kids who are conscripted by The Congress, a massive entity made up of many alien species. It follows Joe and his squad mates as they go through a rigorous bootcamp. There&#8217;s a subplot where Joe finds out that he&#8217;s part of an alien prophecy, and that he is the one that will take down The Congress.</p>\n<p>I enjoyed this book and the ending had a nice cliffhanger, but I&#8217;m not sure if I liked it enough to complete the trilogy.</p>\n<p><strong>7/10 &#8211; pretty ok</strong></p>\n<h2>4. Zulu</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Zulu-Caryl-Férey-ebook/dp/B005GKBZ5I/\"><img src=\"http://localhost:9999/wp-content/uploads/2017/04/zulu-cover.jpg\" alt=\"Zulu\"  /></a></p>\n<p>Zulu is a crime-thriller that takes place in South Africa. It follows detectives Ali Neuman and Brian Epkeen as they try to uncover the murders of young white women in South Africa.</p>\n<p>There were some brutally violent scenes that made me feel woozy &#8211; something I hadn&#8217;t experienced before in a book. There&#8217;s one scene in particular where I had to put the book down and go for a walk.</p>\n<p>Overall I really enjoyed the pace of the book and the &#8216;realness&#8217; of the characters.</p>\n<p><strong>8.5/10 &#8211; great thrilling read</strong></p>\n<h2>5. So Good They Can&#8217;t Ignore You</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Good-They-Cant-Ignore-You-ebook/dp/B0076DDBJ6\"><img src=\"http://localhost:9999/wp-content/uploads/2017/04/so-good-they-cant-ignore-you.jpg\" alt=\"So Good They Can't Ignore You\" /></a></p>\n<p><em>So Good They Can&#8217;t Ignore You</em> was recommended by my friend <a href=\"http://markdunkley.com/\">Mark</a>. It&#8217;s a book that debunks the myth that people should just follow their passions and the work will follow, and going into detail about how the cliché of wanting to leave your job for your &#8216;true passion&#8217; is a horrible idea.</p>\n<p>I really enjoyed this book because it really made me objectively think about what kind of skills I have under my belt, and what value I bring to the world. It also emphasizes the importance of craftsmanship (aka. being the best you can at your job and taking pride in what you do), which I often forget about under the flurry of everyday life and work deadlines.</p>\n<p><strong>9/10 &#8211; great read</strong></p>\n<h2>6. The Man in the High Castle</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Man-High-Castle-Philip-Dick-ebook/dp/B005MZN2B2/\"><img src=\"http://localhost:9999/wp-content/uploads/2017/04/the_man_in_the_high_castle_frontcover.jpg\" alt=\"Man in the High Castle\" /></a></p>\n<p>The Man in the High Castle takes place in an alternate universe where the Axis won World War II. It follows several story arcs spanning many characters, but the coolest part of the book was the book in it about another universe where the Allies won the war (i.e. our universe). The setting reminded me of the <a href=\"https://en.wikipedia.org/wiki/Fallout_(video_game)\">Fallout</a> series, which I really enjoyed.</p>\n<p>I read some discussions online about this book to try and understand the ending, but I&#8217;m still not sure if I fully grasped it. Regardless I really liked this book and will definitely read more books by Philip K Dick.</p>\n<p><strong>8/10 &#8211; great, trippy read</strong></p>\n<h2>7. Flowers for Algernon</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Flowers-Algernon-Student-Daniel-Keyes/dp/015603008X\"><img src=\"http://localhost:9999/wp-content/uploads/2017/06/41V5Rgmr4rL._SX315_BO1204203200_.jpg\" alt=\"\" /></a></p>\n<p>Flowers for Algernon is about a mentally challenged man called Charlie who undergoes a surgery that turns him into a genius. At first he is enthralled by the successful surgery, but he soon becomes more and more isolated due to his superhuman intelligence.</p>\n<p>This was hands down the saddest book I&#8217;d ever read, and had my eyes watery several times. It reminded me to always be kind to people.</p>\n<p><strong>9/10 &#8211; great read, hits right in the feels</strong></p>\n<h2>8. Ordinary Men: Reserve Police Battalion 101 and the Final Solution in Poland</h2>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.ca/Ordinary-Men-Reserve-Battalion-solution/dp/0060995068\"><img src=\"http://localhost:9999/wp-content/uploads/2017/06/514BFYwyKJL._SX326_BO1204203200_.jpg\" alt=\"Ordinary Men\" /></a></p>\n<p><em>Ordinary Men</em> retells the story of Police Battalion 101, and how during World War II, they turned from mostly ordinary middle-class German men into brutal, Jewish-slaying monsters.</p>\n<p><em>Ordinary Men</em> was a terrifying read for a couple of reasons. The first reason is of course the stories of the way the Jews were treated during WW2. In particular, the description of how the Jews were packed into trains, with very little room to move and in the dead of summer made me feel extremely uncomfortable.</p>\n<p>The second reason why this book shook me was that the &#8216;ingredients&#8217; for something like this happening is very much prevalent in today&#8217;s society as well. I put myself in the shoes of the men in the Battalion, and just the thought that I very well could have killed innocent people for the sake of pleasing my seniors or not being outcast by my comrades made me very uncomfortable.</p>\n<p>Next, I plan on reading about the atrocities that the Imperial Japanese army committed during the war. I am really curious to compare the paths in which the Japanese and Germans took in order to sink to that level.</p>\n<p><strong>9/10 &#8211; scary and insightful, highly recommend.</strong></p>\n<hr />\n<p>Currently I&#8217;m reading <a href=\"https://www.amazon.ca/dp/B004X2JGSI/ref=dp-kindle-redirect?_encoding=UTF8&amp;btkr=1\">Toxic Charity: How the Church Hurts Those They Help and How to Reverse It </a>, which is about how most charities are actually harmful to the people on the receiving end.</p>\n<p>I&#8217;m pretty happy with the pace of my reading so far &#8211; gotta keep it up! If you have any suggestions for me, don&#8217;t hesitate to reach out!\t\t</p>\n","wordpress_id":5257},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"book-goals-mid-2017-update","wordpressId":5257,"previousPost":{"slug":"deliberate-practice","wordpress_id":5310},"nextPost":{"slug":"mtl-murals","wordpress_id":5221}}}