{"data":{"wordpressPost":{"title":"Back in Business","content":"<p>Dazed, tanned, and broke. These three words pretty much sum up my state right now, after spending three weeks in Tokyo, Okinawa, and Taipei. I&#8217;m currently at Narita Airport waiting for my flight to Toronto, where I will catch another plane back to Ottawa.</p>\n<p><img data-src=\"https://www.tetchi.ca/wp-content/uploads/2010/04/Photo-on-2010-05-09-at-03.07-588x352.jpg\" alt=\"Photo on 2010-05-09 at 03.07\" title=\"Photo on 2010-05-09 at 03.07\" width=\"588\" height=\"352\" class=\"alignnone size-medium wp-image-1151 lazy-load\" /></p>\n<div class=\"sub\">Waiting at Narita Airport in Tokyo &#8211; taken with my webcam&#8230; I can&#8217;t find my actual camera</div>\n<p>It&#8217;s been a while since my last post, but now that I&#8217;m finally finished my winter semester I can start writing here more often. I will also try my best to catch up on unanswered comments! It&#8217;s starting to sink in that there are only two more semesters of school left&#8230; I can&#8217;t wait to finish completely!</p>\n<p>The highlight of this past semester was diving into the world of interactive multimedia. For one of our classes, we were taught an open-source programming language called Processing. My classmates Grant Lucas, Mark Pintar and I built the &#8216;faceTable&#8217;, which was an interactive table display that would display the user&#8217;s Facebook information by using customized <a href=\"http://reactivision.sourceforge.net/\" title=\"Reactivision\">Reactivision</a> markers. Words don&#8217;t do it justice &#8211; we will be posting videos of it in action on Vimeo once we make the demonstration videos. </p>\n<h2 class=\"steps\">Plans for the summer</h2>\n<p>This summer I&#8217;d like to find and share more hacks and tweaks in Shopify that would allow storeowners to add unique features to their store. I&#8217;d also like to write more tutorials to help storeowners get started with their stores. </p>\n<p>In my spare time, I plan on playing around with Processing and OpenFrameworks in an attempt to create some cool visual displays. Particle systems is an example of something I&#8217;d like to create using one of these two languages. I&#8217;ll also be playing shows with the band The Mudplots, as well as work on another band project that I have brewing :)</p>\n<p>Anyway, I&#8217;m off to kill some more time &#8211; two more hours until my flight to Toronto! Don&#8217;t fail me, Reddit&#8230;</p>\n<p><strong>UPDATE:</strong> A random elderly man from Calgary just approached me with a super-serious look on his face asking if I could check something for him using the wifi on my laptop. Thinking it was an emergency, I opened up my laptop. Turns out he just really needed to know the result of the Pittsburgh vs Montreal game for his hockey pool. Canadians are awesome :D</p>\n"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"back-in-business"}}