{"data":{"wordpressPost":{"title":"2018 Postmortem","content":"<p>Writing a yearly postmortem has become somewhat of a tradition for me (<a href=\"https://www.tetchi.ca/2016-postmortem/\">2016</a>, <a href=\"https://www.tetchi.ca/2017-postmortem/\">2017)</a> so I decided to do one again this year. Like the previous postmortems, I&#8217;m going to talk about 2018 wins, failures, and goals for the new year.</p>\n\n<h2>👍 Wins</h2>\n\n<h3>1. Continued reading a book per month</h3>\n\n<p>Last year I continued my one-book-a-month pace. In 2018, I read the following books:</p>\n\n<ul><li>The Girl Who Kicked the Hornet’s Nest</li><li>Tragic Design</li><li>Escape from Camp 14</li><li>Weapons of Math Destruction</li><li>How to American</li><li>Fifteen Dogs</li><li>Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future</li><li>Eat That Frog: 21 Great Ways to Stop Procrastinating and Get More Done in Less Time</li><li>Ten Arguments for Deleting Your Social Media Accounts</li><li>The Girl on the Train</li><li>Blood, Sweat, and Pixels: The Triumphant, Turbulent Stories Behind How Video Games Are Made</li><li>Name of the Wind</li><li>10% Happier</li></ul>\n\n<p>My favourite book from last year was the Canadian fiction <em>Fifteen Dogs</em>. It was touching, humorous, and thought-provoking.</p>\n\n<p>I&#8217;d like to keep up with this pace this year. I also started using Goodreads again, <a href=\"http://goodreads.com/tetchi\">hit me up</a> if you use it too!</p>\n\n<h3>2. Continued to train Brazilian Jiu Jitsu</h3>\n\n<p>I made some great strides in Brazilian Jiu Jitsu (BJJ) last year, including being <a href=\"https://www.tetchi.ca/december-2018-jolly-jitzin-edition/\">promoted to blue belt</a>. I continued to train 3-4 times a week and added strength and conditioning training to the mix. In two years I&#8217;ve gone from 140 pounds to 160 pounds. At age 30 I feel the strongest I&#8217;ve ever been 💪! My cardio could use some work though&#8230; I still tend to get tired pretty quickly when sparring.</p>\n\n<p>This year I&#8217;d like to attend BJJ competitions and work on developing a &#8220;game&#8221; so that I don&#8217;t just go into a fight blindly.</p>\n\n<h3>3. Grew as a front end developer</h3>\n\n<p>In the last quarter of 2018 I hopped on to a new project at work that required me to learn React, TypeScript, and GraphQL. I was overwhelmed at first but by the end of the year I had become quite comfortable with this new stack.</p>\n\n<p>The biggest challenge for me was TypeScript. Some of the syntax was confusing as hell and it took some time to understand all of its errors. There were many instances where I&#8217;d complete a feature and then spend almost double the time trying to squash TypeScript errors. This process was insanely frustrating and doubly so because TypeScript is (for the most part) correct. Over time I started to improve my code and was chastised by TypeScript less and less.</p>\n\n<p>I wrapped up 2018 with some new FED tools under my belt. There&#8217;s really no better way to learn than to dive straight into a project with an unfamiliar stack 😅.</p>\n\n<h3>4. Blogged once a month</h3>\n\n<p>In January last year I set out to write a monthly digest of my life. I ended up enjoying writing more than I thought! It was a nice outlet for sharing my progress/failures on various aspects of my life.</p>\n\n<p>I&#8217;ve been trying to cut back on social media use for a while now, so this blog has been a great outlet for sharing what&#8217;s going on in my life. This blog doesn&#8217;t have the same reach or exposure as social media sites but I feel like I can convey my thoughts better on it. I&#8217;m going to do my best to continue writing monthly posts here this year.</p>\n\n<h3>5. Bought a house</h3>\n\n<p>Right at the end of the year, Kylea and I bought our very own house. We were extremely nervous as this was the first home purchase for both of us, but ultimately very happy with our purchase.</p>\n\n<p>We&#8217;ve barely lived in it yet as we&#8217;re currently travelling in New Zealand, but we&#8217;re so stoked to make the place our own. I want to take the opportunity to do some hands-on projects, such as doing small renovations and growing herbs and vegetables. I&#8217;ve played 200+ hours of <a href=\"https://www.stardewvalley.net/\">Stardew Valley</a> so I&#8217;m basically an expert already.</p>\n\n<h2>👎 Failures</h2>\n\n<h3>1. Lost all interest in music &amp; jazz</h3>\n\n<p>Mid-last year I completely lost interest in playing jazz music. My last show was back in April last year. My upright bass started to collect dust, and I even stopped listening to jazz music.</p>\n\n<p>The problem was that I no longer wanted to play the upright bass. I felt uninspired by it and playing solos on it felt limiting. My growing interest in Brazilian Jiu Jitsu didn&#8217;t help either.</p>\n\n<p>This year I&#8217;m thinking of picking up the piano to try and kickstart my interest in jazz again. I&#8217;ve always loved the sound of piano in jazz and it&#8217;s such a great solo instrument.</p>\n\n<h3>2. Did not give back to the web community</h3>\n\n<p>One of my goals last year was to give back to the web community, and this was something I didn&#8217;t do at all. During the fall I had signed up to be a mentor on <a href=\"http://exercism.io/\">Exercism,</a> but that didn&#8217;t pan out at all. I had become too busy learning React, TypeScript, and GraphQL.</p>\n\n<p>This year I want to make an effort to give back to the community, either by contributing to open source projects or writing tutorials again. I want to lock down some time every weekend to really commit to it.</p>\n\n<h2>🎯 New Goals for 2019</h2>\n\n<ol><li>Get back into jazz by learning the piano</li><li>Work on open source projects (for real)</li><li>Continue practicing French</li></ol>\n\n<h2>🏆 2018 Best Ofs</h2>\n\n<h3>Best album</h3>\n\n<figure class=\"wp-block-image\"><img src=\"http://localhost:8888/wp-content/uploads/2019/01/little-dark-age.jpg\" alt=\"\" class=\"wp-image-7296\" srcset=\"http://localhost:8888/wp-content/uploads/2019/01/little-dark-age.jpg 900w, http://localhost:8888/wp-content/uploads/2019/01/little-dark-age-150x150.jpg 150w, http://localhost:8888/wp-content/uploads/2019/01/little-dark-age-300x298.jpg 300w, http://localhost:8888/wp-content/uploads/2019/01/little-dark-age-768x763.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></figure>\n\n<p>MGMT&#8217;s <em>Little Dark Age</em> was my favourite album of 2018. I hadn&#8217;t been following following MGMT much since the <em>Oracular Spectacular</em> days, so it was a nice surprise when this album popped up on my Spotify page.</p>\n\n<p><em>Little Dark Age</em> was the only album from 2018 that I enjoyed from beginning to end. The track &#8220;When You Die&#8221; in particular was on heavy repeat. Check out the <a href=\"https://www.youtube.com/watch?v=tmozGmGoJuw\">music video</a> for a good trip!</p>\n\n<h2>Best video game</h2>\n\n<figure class=\"wp-block-image\"><img src=\"http://localhost:8888/wp-content/uploads/2019/01/celeste-1024x576.jpg\" alt=\"\" class=\"wp-image-7297\" srcset=\"http://localhost:8888/wp-content/uploads/2019/01/celeste-1024x576.jpg 1024w, http://localhost:8888/wp-content/uploads/2019/01/celeste-300x169.jpg 300w, http://localhost:8888/wp-content/uploads/2019/01/celeste-768x432.jpg 768w, http://localhost:8888/wp-content/uploads/2019/01/celeste.jpg 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></figure>\n\n<p><em>Celeste</em> was a surprise hit and had me glued to my Switch last February. It may even be the best platforming game I&#8217;ve ever played in my life. The game was definitely not a cakewalk and it was so satisfying to complete a level after dozens, if not hundreds of attempts.</p>\n\n<p>Not only was the game challenging, the music and the touching story were amazing as well. If you haven&#8217;t played <em>Celeste</em> yet I highly recommend it.</p>\n\n<p><em>Overcooked 2</em> was a close second. It provided many hours of solid couch-coop fun.</p>\n\n<h3>Best movie</h3>\n\n<figure class=\"wp-block-image\"><img src=\"http://localhost:8888/wp-content/uploads/2019/01/spider-man-1024x576.jpeg\" alt=\"\" class=\"wp-image-7298\" srcset=\"http://localhost:8888/wp-content/uploads/2019/01/spider-man-1024x576.jpeg 1024w, http://localhost:8888/wp-content/uploads/2019/01/spider-man-300x169.jpeg 300w, http://localhost:8888/wp-content/uploads/2019/01/spider-man-768x432.jpeg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></figure>\n\n<p>Right before Christmas I went to see <em>Spider-Man: Into&nbsp;the&nbsp;Spider-Verse</em> with my buddy Tom. I&#8217;d been wanting to see this movie ever since seeing the trailer for the first time, and boy was it worth the wait. </p>\n\n<p>The unique art style and animation completely blew my mind. It was a mix of 3D and comic book patterns (such as thought bubbles and halftone textures). The story was fantastic as well, weaving between touching moments that had me teary-eyed and hilarious ones that had me dying with laughter.</p>\n\n<p>I can&#8217;t wait for more from the <em>Spider-Verse</em> series!</p>\n\n<hr class=\"wp-block-separator\"/>\n\n<p>Thanks for reading! Best of wishes in 2019 🍻!</p>\n","wordpress_id":7199},"allWordpressWpComments":{"edges":[{"node":{"content":"<p>Thanks for reading Evija, yes I&#8217;m really hoping to find the &#8216;spark&#8217; for jazz again this year! Strange how passions can just fizzle sometimes eh?</p>\n","author_name":"tetchi"}},{"node":{"content":"<p>Thanks for reading Ed!! 🙂</p>\n","author_name":"tetchi"}},{"node":{"content":"<p>Thanks for sharing. Shame about the jazz, I kept on waiting for the next gig invite. Hope it will come in 2019 🙂</p>\n","author_name":"Evija Sundman"}},{"node":{"content":"<p>So good. Thanks for the writeup, Tets!</p>\n","author_name":"Edward"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"2018-postmortem","wordpressId":7199}}