{"data":{"wordpressPost":{"title":"2017 Postmortem","content":"<p>\t\t\t\tLast year I wrote a <a href=\"https://www.tetchi.ca/2016-postmortem\">postmortem</a> at the end of the year. I liked looking back and see where I succeeded and where I failed, so I figured I&#8217;d write up another one this year.</p>\n<p><!--more--></p>\n<h1>👍 Wins 👍</h1>\n<h2>Win #1: Read a frigton of books by my standards</h2>\n<p>My biggest win this year was crushing more books. I wrote some thoughts about each book <a href=\"/book-goals-mid-2017-update/\">here</a> and <a href=\"/book-goals-end-of-2017-update/\">here</a>. I enjoyed flipping between fiction and non-fiction; it really helped with keeping reading entertaining.</p>\n<p>I was really surprised at how many books you can burn through if you just put in 30 minutes a day on your commute or before going to sleep. Reading has become a daily ritual for me and I&#8217;ll continue doing it next year.</p>\n<p><strong>2018 goals:</strong> Keep reading at least one book a month.</p>\n<h2>Win #2: Travelled quite a lot</h2>\n<p>This year I was lucky enough to travel to three different countries:</p>\n<p>1) <em>Iceland</em> for two weeks with the girlfriend, where we <a href=\"/iceland-2017/\">drove around the country in a campervan</a><br />\n2) <em>Sweden</em> where I attended the NordicJS conference in Stockholm<br />\n3) <em>Japan</em> where I showed my girlfriend and two friends around Tokyo, Osaka, Kyoto and Okinawa, and spent two weeks with my brother, his wife, and two kids in my hometown Naha.</p>\n<p>New Zealand is next on my list, although I&#8217;m not sure if I&#8217;ll get to travel next year. I also want to go back to Okinawa so that I can see my brother&#8217;s family again.</p>\n<p><strong>2018 goals:</strong> Travel less, save money for more trips in 2019.</p>\n<h2>Win #3: Continued training Brazilian Jiu Jitsu</h2>\n<p>This year I continued to go to Jiu Jitsu three to four times a week. I&#8217;ve become more comfortable with different techniques, but I still have a hard time submitting opponents while sparring. I feel like I can get pretty decent positional advantage over my opponents, but I fail at submissions. I eventually just tire out and leave myself vulnerable.</p>\n<p>I also noticed that I get caught up in negative thoughts when I see younger guys going to competitions (&#8220;why didn&#8217;t I start BJJ when I was younger?&#8221;) or when I can&#8217;t tap out newer students (&#8220;why am I not getting better?&#8221;). I want to learn to brush off these thoughts and keep improving at my own pace.</p>\n<p><strong>2018 goals:</strong> Don&#8217;t worry about competing, just focus on improving technique and strength. Keep improving at my desired pace, but stay consistent with attending classes.</p>\n<h2>Win #4: Continued to develop jazz skills</h2>\n<p>In 2017 I saw more improvements to my jazz bass improvisation skills. I started listening to more jazz music to be inspired, and worked on improving my solos in various ways.</p>\n<p>The highlight in the jazz department this year was recording five jazz standards at a studio with the band. I definitely want to do it again next year.</p>\n<p><strong>2018 goals:</strong> Continue jamming with the band at the Brasserie every two weeks and record again!</p>\n<h2>Win #5: Moved in to a dope new apartment with the girlfriend</h2>\n<p>In June I moved into a new apartment in the Mile End with my girlfriend. I can honestly say that it&#8217;s the best apartment that I&#8217;ve ever lived in. The location is great (everything is walking distance), the kitchen is baller, and the shower actually spits out hot water unlike my first place.</p>\n<p>Since my girlfriend was moving her stuff from Ottawa, I had to sell and get rid of even more of my personal possessions to make space for the both of us. It was tough saying goodbye to certain things, but it&#8217;s funny how I don&#8217;t even think about them anymore.</p>\n<p><strong>2018 goals:</strong> Keep apartment tidy, stay mindful of purchases that take up precious apartment space.</p>\n<h1>👎 Failures 👎</h1>\n<h2>Failure #1: Didn&#8217;t grow much as a FED at work</h2>\n<p>This is something that&#8217;s been on the back of my mind a lot, and  merits its own future post. I&#8217;ve been at Shopify for almost 9 years now, and working as a FED at Shopify for ~3 years. Still, I don&#8217;t feel like I have much of an impact in the company, and I feel like I&#8217;m just completing projects as they come, never going the &#8220;extra mile&#8221;. Next year, I&#8217;d love to level up to a senior position by taking on more responsibilities and teaching/mentoring opportunities.</p>\n<h2>Failure #2: French didn&#8217;t improve</h2>\n<p>I didn&#8217;t see much growth in my French skills this year. I still fall back to English when I&#8217;m in a conversation with a francophone, and still feel self-conscious about my shitty French. I need to overcome this next year.</p>\n<p>I did however start taking French lessons with my girlfriend and that&#8217;s been going well so far.</p>\n<h1>New goals for next year</h1>\n<h2>1. Start giving back to the web community</h2>\n<p>I&#8217;ve learned so much about front end development through free resources on the internet, and it&#8217;s high time that I start giving back. Recently I started hanging out in the <a href=\"https://www.freecodecamp.org/\">freeCodeCamp</a> forums, where I&#8217;ve been helping people figure out HTML, CSS, and Javascript issues.   I&#8217;m going to continue doing this with the hopes of unblocking others on their path to learn web development.</p>\n<p>Eventually, I want to write articles for <a href=\"https://guide.freecodecamp.org/\">the freeCodeCamp guide</a> and contribute to codebases in other open source projects.</p>\n<h2>2. Write more</h2>\n<p>I don&#8217;t like how this blog can go months without a single post. In 2018, I plan to write at least once a month, with a monthly summary of:</p>\n<ul>\n<li>what I learned (whether it be about front end development, jazz, or jiu jitsu)</li>\n<li>cool stuff that happened</li>\n<li>books I read</li>\n<li>music discoveries</li>\n<li>what&#8217;s on my mind</li>\n</ul>\n<hr />\n<p>That&#8217;s all I got for now, hopefully I can stick to these gaols! How did your 2017 go? What are your plans for 2018?</p>\n<p>Here&#8217;s to a sick 2018! 🥃\t\t</p>\n","wordpress_id":5368},"allWordpressWpComments":{"edges":[{"node":{"content":"<p>hehe tack evija! &lt;3</p>\n","author_name":"tetchi","date":"January 2nd, 2018"}},{"node":{"content":"<p>You go, Tets!!</p>\n","author_name":"Evija","date":"January 2nd, 2018"}},{"node":{"content":"<p>Thanks for reading, brotha &lt;3</p>\n","author_name":"tetchi","date":"December 31st, 2017"}},{"node":{"content":"<p>Fantastic post-mortem, man. Really inspiring to read. Thanks for sharing!</p>\n","author_name":"Ara","date":"December 31st, 2017"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"2017-postmortem","wordpressId":5368,"previousPost":{"slug":"january-2018","wordpress_id":5382},"nextPost":{"slug":"book-goals-end-of-2017-update","wordpress_id":5336}}}