{"data":{"wordpressPost":{"title":"An unexpected friendship","content":"<p>\t\t\t\tBack in April of last year I went to Japan and Vancouver with my good friend Gary. The trip involved many great moments like snowboarding in Niseko and Whistler, partying in Tokyo, and discovering new cities in northern Japan.</p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2017/01/gary_tets_niseko.jpg\" alt=\"Snowboarding in beautiful Niseko, Hokkaido\" /></p>\n<p>But my favourite moment from the trip was unexpectedly making friends with an elderly couple.</p>\n<p><!--more--></p>\n<p>Gary and I had split up after snowboarding in Niseko because he had a wedding to attend in Tokyo. I decided to stay in Hokkaido and explore more of Sapporo, Hakodate, and Otaru on my lonesome.</p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2017/01/hakodate.jpg\" alt=\"Pretty Hakodate\" /></p>\n<div class=\"sub\">Hakodate, Hokkaido &#8211; a small and beautiful city.</div>\n<p>I was scarfing down sushi at a quiet bar in Hakodate when an elderly couple sitting near me commented on my baseball cap, which had a Canadian flag on it.</p>\n<p>&#8220;Hey, we&#8217;ve been to Canada, we loved it!&#8221;, the old man said to me. He introduced himself as Hiroshi, along with his wife Kyoko.</p>\n<p>Hiroshi and Kyoko were from Chiba (near Tokyo), and like myself were first-time visitors to Hakodate. They were both in their 70s and full of energy.</p>\n<p>We ended up talking for hours about our past travels, exchanged tips about what to do in Hakodate, differences between Canadian and Japanese culture, etc. Hiroshi graciously ensured that my <em>ochoco</em> (cup for drinking sake) was always full throughout the entire night 🍶.</p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2017/01/new-friends.jpg\" alt=\"new friends!\" /></p>\n<div class=\"sub\">My new friends Kyoko-san and Hiroshi-san</div>\n<p>I genuinely loved chatting with Hiroshi and Kyoko and listening to their life story. Travelling alone has its benefits but can be a little lonely at times. Sometimes you just want someone to talk to face-to-face and have good laughs with. After traveling alone for a few days I was feeling quite exhausted, but I felt completely recharged after that night.</p>\n<p>Before we parted ways I asked if I could have their address so that we could keep in touch. They were more than happy to share, and we&#8217;ve been writing letters to each other ever since. I get so excited whenever I receive a letter from them; there&#8217;s just something more personal about handwritten snail mail.</p>\n<p><img src=\"http://localhost:9999/wp-content/uploads/2017/01/letter.jpg\" alt=\"one of many letters from Kyoko and Hiroshi\" /></p>\n<div class=\"sub\">One of many letters from Kyoko &#038; Hiroshi, this one in adorable Totoro puzzle form.</div>\n<p>I went into that bar for a quick bite but ended up forging a friendship with two really cool people. You never know what kind of interesting people you can meet through random encounters.\t\t</p>\n","wordpress_id":5180},"allWordpressWpComments":{"edges":[{"node":{"content":"<p>Thanks for reading Grant!! ❤️</p>\n","author_name":"tetchi","date":"January 28th, 2017"}},{"node":{"content":"<p>Great story and such a neat encounter 🙂</p>\n","author_name":"Grant","date":"January 24th, 2017"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"an-unexpected-friendship","wordpressId":5180,"newerPostSlug":"bjj-is-life","olderPostSlug":"2016-postmortem"}}