{"data":{"wordpressPost":{"title":"BJJ is life","content":"<p>Every now and then I get insanely addicted to a hobby. Past examples include Magic: the Gathering, soccer, various instruments&#8230; the list goes on. My latest addiction is Brazilian Jiu Jitsu (BJJ). I started training back in September and have been hooked ever since.</p>\n<p><img src=\"https://www.tetchi.ca/wp-content/uploads/2017/02/68vqjsaqbhgy.jpg\" alt=\"basically me getting wrecked on the regular\" /></p>\n<div class=\"sub\">Me getting wrecked at BJJ</div>\n<p>I&#8217;ve been training 3 to 5 times a week and I honestly can&#8217;t stop thinking about it. I often find myself replaying techniques and past sparring sessions in my head. I do this when I&#8217;m on the train, when I space out at work meetings, and even when I&#8217;m trying to sleep. It doesn&#8217;t help that I have two coworkers (who are brown and black belts, respectively) that train me weekly and help me figure out why I get my ass submitted so easily.</p>\n<p><!--more--></p>\n<h2>What makes BJJ so fun and addictive?</h2>\n<p>One thing that makes BJJ so fun is that there is an insane amount of strategy involved. For example, you could have your opponent in a <a href=\"http://www.yellmagazine.com/wp-content/uploads/2012/04/the-gracie-brothers-rear-naked-choke-video.jpg\">rear naked choke</a> and bait him into a <a href=\"http://bjjgo.com/sites/default/files/Techniques_Images/BJJ%20Technique%20Head%20and%20Arm%20Choke.PNG\">kata gatame choke</a> by deliberately letting him escape (a little technique that my friend Bernardo taught me). It&#8217;s insanely fun to experiment with different strategies against opponents to see what works and what doesn&#8217;t.</p>\n<p>Next, I love seeing progress. This is the first time I&#8217;ve taken up an individual sport; I find that I can better pinpoint my strengths and weaknesses way better than I can with team sports like soccer. Although I get submitted by my opponents regularly, I see myself getting better at defending myself and even starting string together different attacks. It&#8217;s rewarding to see progress in that regard.</p>\n<p>Finally, it&#8217;s made watching Ultimate Fighting Championship (UFC) a lot more enjoyable. Watching major UFC events with Bernardo has become a ritual, and it&#8217;s awesome to hear his thoughts on what moves the fighters are attempting and what kind of mistakes they might be making. Up until now I&#8217;ve only really watched hockey but it&#8217;s always nice to learn and appreciate another sport.</p>\n<h2>Downsides of my BJJ addiction</h2>\n<p>I love seeing progress in BJJ but I need to be careful not to let my other skills slide. I&#8217;ve noticed that I haven&#8217;t been practicing my upright bass as much as I used to&#8230; and that&#8217;s not a good sign.</p>\n<p>I&#8217;m still trying to figure out how to balance multiple hobbies. Ideally I want to be dope at both, but it&#8217;s hard to find time with full-time work and other obligations.</p>\n<hr />\n<p>If you&#8217;re looking for a new hobby I highly recommend Brazilian Jiu Jitsu. It&#8217;s fun as hell and both physically and mentally rewarding 👊</p>\n"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"handle":"bjj-is-life"}}