{"data":{"wordpressPost":{"title":"Deliberate practice","content":"<p>I recently read the book <a href=\"https://www.amazon.ca/Good-They-Cant-Ignore-You-ebook/dp/B0076DDBJ6\">So Good That They Can&#8217;t Ignore You</a>. In it the author touches on a concept called <a href=\"https://en.wikipedia.org/wiki/Practice_(learning_method)\">deliberate practice</a>, which is a learning method used to become really good at a skill or discipline.</p>\n<p>I first heard about deliberate practice in the book <a href=\"https://www.amazon.ca/Talent-Overrated-Separates-World-Class-Performers-ebook/dp/B001HD8NZ8/\">Talent is Overrated</a> a few years ago. I&#8217;ve always been interested in this concept as I have several skills in my life that I&#8217;m constantly looking to improve. In this post I talk about what I think are some approaches to good, result-wielding practice, using one of my favourite hobbies, jazz bass, as an example. My hope is that you can use these tips and apply them in the skill that you are looking to level up.</p>\n<p><!--more--></p>\n<h3>1. Be focused</h3>\n<p>Deliberate practice requires you to be completely focused on the task at hand. For example if you compare someone who practices guitar by playing chords while watching the latest House of Cards with someone who is <em>only</em> focused on playing his guitar, the latter is guaranteed to improve at a faster rate.</p>\n<p>Admittedly, I have a bit of trouble with focus. When I practice my bass, I am often tempted to check my chat notifications or see what&#8217;s new on Reddit. I&#8217;ve found the <a href=\"https://heyfocus.com/\">Focus</a> app for MacOS to be helpful with blocking distracting sites. I also make sure that my practice sessions are not too long (typically 30 minutes), as I find my focus begins to taper after some time. This is known as the <a href=\"https://en.wikipedia.org/wiki/Pomodoro_Technique\">Pomodoro technique</a> and I find it to be extremely effective.</p>\n<h3>2. Be consistent</h3>\n<p>Consistency is another important aspect of deliberate practice. It&#8217;s important to fit in deliberate practice whenever possible. How often you practice something is up to you (the more the better, of course) but it&#8217;s important to keep it up.</p>\n<p>I found an app for my phone called <a href=\"https://streaksapp.com/\">Streaks</a> to be very helpful with this. You add a maximum of six activities that you wish to make a habit, and check it off as you complete them. It&#8217;s essentially another to-do app, but I find it fun to use and the feeling of checking off a completed task is rewarding.</p>\n<p style=\"text-align: center;\">\n<img src=\"https://www.tetchi.ca/wp-content/uploads/2017/06/streaks.png\" alt=\"streaks app\" />\n</p>\n<h2>3. Be as specific as possible on what you want to improve</h2>\n<p>It&#8217;s not enough to set a broad goal such as &#8220;I want to get better at playing the guitar&#8221;. You need to be specific about what exactly you want to improve upon, and <em>only</em> focus on that aspect.</p>\n<p>I change the focus with jazz improvisation practice constantly; this can be anything from phrasing, dynamics, pitch accuracy, etc. I focus on one aspect until I get to the level I am happy with.</p>\n<p>Being as specific as possible trumps a generic goal because it gives you more concrete, bite-sized elements of your skill to work on.</p>\n<h2>4. Find the &#8220;sweet spot&#8221;</h2>\n<p>In the book &#8220;Talent is Overrated&#8221;, the author has this to say about deliberate practice:</p>\n<blockquote><p>\n  Deliberate practice is hard. It hurts. But it works. More of it equals better performance. Tons of it equals great performance.\n</p></blockquote>\n<p>There is no doubt that hard practice yields results, but if you make practicing too hard on yourself it can be detrimental. Similarly, if your practice is too easy you will likely be bored and see no improvement. Thus I believe it&#8217;s important to find a &#8216;sweet spot&#8217; for practice: a point in between <em>too hard</em> and <em>too easy</em> where you still feel challenged enough to improve but not so much that you burn yourself out.</p>\n<p>With music, I like to use <a href=\"https://www.seventhstring.com/xscribe/overview.html\">Transcribe</a> to adjust the speed of a song. When working on a specific aspect of jazz improvisation, I start at a low BPM (beats per minute) and gradually work my way up. When I can play and achieve my goal at higher speeds, I know I&#8217;m good to move on to my next point of focus.</p>\n<h2>5. Be open to feedback</h2>\n<p>Receiving external feedback can be tough. It&#8217;s easy to take feedback personally and become discouraged by it, but it&#8217;s best to use it to figure out what to focus on next.</p>\n<p>Around January, I was told by one of the members in the group that I needed to work on my pitch, and that some of the notes that I was playing were either too sharp or too flat.</p>\n<p>Initially, I was discouraged by this and my first thought was to become defensive and tell him how freaking hard it is to get the right pitch on the upright bass (the upright has no frets or visual markers). Instead I made the best of it and focused only on pitch for a few weeks, meticulously checking for any dissonance in my notes relative to the backing track&#8217;s chords. After a few weeks of practicing along to backing tracks and listening to recordings of myself, I was able to get to a level where there was very few pitch errors.</p>\n<p>Him and I parted ways and we no longer jam together (nothing personal, it just so happened that we went separate paths) but if we were to jam again I&#8217;m confident that he will pick up on way less erroneous notes. In the end I&#8217;m glad he gave me that feedback because I was able to further improve my game.</p>\n<h2>6. Critique yourself</h2>\n<p>Internal feedback is just as important as the external ones discussed above. When practicing jazz soloing, I regularly record my solos and try to pick out what I liked, what I disliked, or any reoccurring bad habits/clichés that I may be doing subconsciously. This is extremely valuable in covering your blind spots.</p>\n<p>It&#8217;s also important not to be too hard on yourself. Often I find myself getting frustrated at the seeming lack of progress, but when I compare myself to where I was a few years or even months  ago, I can objectively see that that&#8217;s not the case. Just a few years ago I was going to open jams and <a href=\"https://www.tetchi.ca/jammin/\">walking to basic 12-bar blues and slower jazz standards</a> (and <em>not</em> soloing) &#8211; both of which are a cakewalk for me now.</p>\n<p>You must not be discouraged even if you are not seeing any progress. It just may be a sign that you need to adjust your &#8216;sweet spot&#8217;.</p>\n<h2>7. Get uncomfortable &amp; show your work</h2>\n<p>Showing your skills off to the world can be extremely uncomfortable, but you need to power through that voice in your head telling you &#8220;you&#8217;re not good enough, you&#8217;re not ready to show people what you got&#8221;. The reason for this is that it&#8217;s one of the best ways to gather feedback, both external and internal.</p>\n<p>For me, I was extremely nervous and scared to go up on stage and improvise to jazz standards on my upright. On a set of ten songs, I&#8217;d solo on one or two of them. Without much experience and feedback to work from, I didn&#8217;t see myself growing.</p>\n<p>Nowadays I solo on ~80% of a set (which I record with my handy <a href=\"https://www.zoom-na.com/products/field-video-recording/field-recording/zoom-h2n-handy-recorder\">Zoom H2n recorder</a>. This gives me more to work with after the show to pick out things I need to work on.</p>\n<h2>8. Be inspired</h2>\n<p>Drawing inspiration from masters of your field is an incredibly powerful tool. It&#8217;s easy to fall into the trap of thinking &#8220;damn, I&#8217;ll never get to that level&#8230;&#8221; but this is the worst mindset to be in. Instead you should be inspired by them, using them as goals to set standards for yourself and eventually develop your own style.</p>\n<p>When I wanted to get better at jazz soloing, I turned to Youtube and Spotify and scoured through dozens of jazz songs with bass solos in them. I critiqued each solo, taking notes on what I liked or disliked about them. From there I could pick and choose techniques that I wanted to incorporate into my own style.</p>\n<p><img src=\"https://www.tetchi.ca/wp-content/uploads/2017/06/practice.png\" alt=\"spreadsheet of jazz bass solo critiques\" /></p>\n<div class=\"sub\">Spreadsheet game strong</div>\n<p>As an example I&#8217;ve been extremely attracted to Christian McBride&#8217;s style (check out his <a href=\"https://www.youtube.com/watch?v=Dhsi_p-KSG4&amp;feature=youtu.be&amp;t=190\">rad solo here</a>) and aiming to incorporate Christian McBride-style phrasing and fast licks into my own. Standing on the shoulder of giants, so to speak!</p>\n<hr />\n<p>I hope the advice in this post helps you with your hobbies and work. With proper deliberate practice, I believe that any skill can be taken to the next level.</p>\n<p><em>I owe a lot of these findings to my bass mentor. If you ever read this, thanks for helping me get to where I am today with my bass guitar &amp; upright guitar skills.</em></p>\n"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"handle":"deliberate-practice"}}