{"data":{"wordpressPost":{"title":"Battlefield 3","content":"<p>For the past couple of months I&#8217;ve been hooked on DICE&#8217;s latest game, Battlefield 3 (BF3). I was a huge fan of Battlefield 1942 so I knew that I would love BF3 right off the bat. </p>\n<p>BF3 is the <strong>best FPS I&#8217;ve ever played</strong>. Between BF1942 and BF3, I played a lot of FPS games but most of them were short-lived. One exception is TF2, which I played a lot until it went crazy with all the hats, crafting and micro-transactions.</p>\n<p>One of BF3&#8217;s great new features is &#8220;Battlelog&#8221;, which is EA&#8217;s social platform for BF3 players. The best part about Battlelog is its stat-tracking. Through Battlelog you can check your kill:death ratio, weapon stats, unlocks, awards, and reports of past rounds. I find myself logging into Battlelog after rounds to see how I did, and whether or not I&#8217;m about to unlock something. </p>\n<p><a href=\"http://localhost:8888/wp-content/uploads/2011/12/tetchi_bf3_stats-e1325197150463.png\"><img src=\"http://localhost:8888/wp-content/uploads/2011/12/tetchi_bf3_stats-e1325197150463.png\" alt=\"my bf3 stats\" title=\"my bf3 stats\" width=\"500\" height=\"460\" class=\"alignnone size-full wp-image-1964\" srcset=\"http://localhost:8888/wp-content/uploads/2011/12/tetchi_bf3_stats-e1325197150463.png 500w, http://localhost:8888/wp-content/uploads/2011/12/tetchi_bf3_stats-e1325197150463-300x276.png 300w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></a></p>\n<div class=\"sub\">Battlelog provides you with lots of sweet stats</div>\n<p>As for the actual gameplay, what makes BF3 so awesome is its emphasis on teamwork. This was made even more true when I was one day recruited by a platoon called <a href=\"http://battlelog.battlefield.com/bf3/platoon/2832655391303178979/\" target=\"_blank\" title=\"N7 Spectres platoon page\">N7 Spectres</a>. I was asked to join when I was having a pretty sweet game on Noshahr Canals. I was a little worried at first because I thought that being in a platoon meant daily practices and getting super-pissed at one another for messing up, but man, how wrong I was. N7 Spectres is a group of some of the coolest, friendliest and most importantly skilled players, and it makes playing BF3 even more fun.</p>\n<p>N7 Spectre&#8217;s founder, eGessDub, posts some pretty sweet gameplay videos on his Youtube channel <a href=\"http://www.youtube.com/user/EssDubGaming?blend=1&#038;ob=video-mustangbase\" title=\"essDubgaming youtube\">here</a>. Yesterday eGessDub posted a game with me in it! It&#8217;s pretty rad to re-experience the match from another person&#8217;s perspective. </p>\n<p><iframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/TPG9ykEBjSQ\" frameborder=\"0\" allowfullscreen></iframe></p>\n<div class=\"sub\">eGessDub&#8217;s latest replay video. Tearin&#8217; it up on Seine Crossing!</div>\n<p><!--more--><br />\nKnifing people in BF3 is seriously a metagame, and it&#8217;s one of my favourite aspects of the game. When you perform a knife attack from behind an enemy, you go into this wicked animation where you grab your enemy&#8217;s dog tag and stab him in the heart/throat. Knifing can be pretty difficult though, as it makes you vulnerable to nearby enemies, and the knife animation doesn&#8217;t kick in all the time (it&#8217;s a little buggy IMO). This makes performing a knife kill all the more satisfying. </p>\n<p>This has developed into an unhealthy addiction for me, as I&#8217;ll go out of my way to run behind an enemy and snatch his dog tag. Within Battlelog, there&#8217;s a section to see all of the stolen dog tags, and it has become my very own <a href=\"http://images.wikia.com/avp/images/f/f8/Trophywall-1-.jpg\">trophy room</a> like in  the movie <em>Predators</em>. The other week I lucked out and <a href=\"http://localhost:8888/wp-content/uploads/2011/12/dog-tags.png\" title=\"DICE dog tag\"> stole a dog tag from a DICE developer.</a></p>\n<p><a href=\"http://i.imgur.com/jafjX.jpg\"><img src=\"http://i.imgur.com/jafjX.jpg\" alt=\"Knifing an unsuspecting enemy from behind\"/></a></p>\n<div class=\"sub\">A screencap of the knifing animation. Image found on /r/battlefield3</div>\n<p>If you play Battlefield 3, you can find me on Battlelog <a href=\"http://battlelog.battlefield.com/bf3/user/tetchi/\">here</a>. Hit me up if you want to play some rounds :). If you don&#8217;t have BF3 yet, go get it NOW!!</p>\n"},"allWordpressWpComments":{"edges":[{"node":{"content":"<p>Thanks for reading buddy! Check out <a href=\"https://www.reddit.com/r/thalassophobia\" rel=\"nofollow\">https://www.reddit.com/r/thalassophobia</a> haha 😀</p>\n"}},{"node":{"content":"<p>What an awesome time! Thanks for sharing with us. Also, TIL the term thalassophobia. 🙂</p>\n"}},{"node":{"content":"<p>Thanks for reading Rayray! Yes, definitely hit me up! The beaches tended to get pretty busy as the day went, but there were definitely a few that were not busy at all (Hahei). The weather has been great and pretty hot at times. Though it doesn’t get as humid as Ottawa/Montreal and it’s really cool at night. Cheers brotha!</p>\n"}},{"node":{"content":"<p>That helicopter ride&#8230; what a perfect intro to the trip. Everything looks incredible. I really hope we get a chance to visit at some point as well. Going to bug you for pointers if that’ll happen. I like how sucluded most shots seem, not the overrun beaches that you expect from most places these days. What was the weather like? Looking forward to the second part.</p>\n"}},{"node":{"content":"<p>Oh crap I should have mentioned in the post, but yes I did! I got it back 3 days later.</p>\n"}},{"node":{"content":"<p>Wow. Looks like an amazing trip! Did you ever get your luggage in the end?</p>\n"}},{"node":{"content":"<p>Thanks for reading Evija, yes I&#8217;m really hoping to find the &#8216;spark&#8217; for jazz again this year! Strange how passions can just fizzle sometimes eh?</p>\n"}},{"node":{"content":"<p>Thanks for reading Ed!! 🙂</p>\n"}},{"node":{"content":"<p>Thanks for sharing. Shame about the jazz, I kept on waiting for the next gig invite. Hope it will come in 2019 🙂</p>\n"}},{"node":{"content":"<p>So good. Thanks for the writeup, Tets!</p>\n"}},{"node":{"content":"<p>Hey Techti,</p>\n<p>This solution worked great, thank you so much for posting this. I am trying to add a temporary total at the bottom of the form, do you have any insight on how to do this? Im using this as a wholesale form so cutomers will be charged via invoice, therefore the order total is 0, id like to display the order total at the bottom of the form, so I just need to write a function that does orderPrice*quantity for each product and adds them together, just not sure how to implement this. </p>\n<p>Thanks!</p>\n"}},{"node":{"content":"<p>Hi Tetchi, please HELP</p>\n<p>I’m having the same issue as it looks like a few others have had. I think I followed all the steps correctly, but when I put a number into the donation box on the checkout page and click update or checkout, it doesn’t update the total  help please</p>\n<p>Marco</p>\n"}},{"node":{"content":"<p>Hi, I&#8217;ve been having a go at this but I&#8217;m useless at html and completely stuck!  Is there anyone who could set up the donation box for me?  Happy to pay for the time 🙂</p>\n"}},{"node":{"content":"<p>Thanks for reading Dave! If you have any recommendations for video game books/documentaries, let me know! 🙂</p>\n"}},{"node":{"content":"<p>Thanks for the book tip! Wish more people dropped little tidbits like that. After reading about the complex history of making Doom, and more recently a great essay on Asteroids, something more modern will be most welcome. Here is to one day be reading all about the schenanigans behind GTA!</p>\n"}},{"node":{"content":"<p>Thanks so much for reading Jeremy!! Hmmm man that&#8217;s such a good question&#8230; I&#8217;d love to design some sort of turn-based multiplayer game like Carcassonne but I lack the creativity and skill lol.</p>\n"}},{"node":{"content":"<p>Testing!</p>\n"}},{"node":{"content":"<p>Test testing</p>\n"}},{"node":{"content":"<p>Thanks so much for reading pal 🙂</p>\n"}},{"node":{"content":"<p>Hey Rebecca, d, I&#8217;m so sorry &#8211; admittedly I&#8217;ve been horrible at replying to the comments on my old tutorials 🙁 </p>\n<p>I&#8217;d love to help out if I can. Can you tell me what you&#8217;re having trouble with, or what error messages you might be getting?</p>\n"}},{"node":{"content":"<p>Love the constant learner aspect &#8211; what video game concept would you produce in your hypothetical independent indie studio?</p>\n"}},{"node":{"content":"<p>Funny how everyone has the same problem and finds a fix but doesn&#8217;t post the solution..</p>\n"}},{"node":{"content":"<p>I love these updates! Thanks for writing them</p>\n"}},{"node":{"content":"<p>How to run this liquid code in an editor lets says ATOM, I just tried the basic theme from scratch but I don&#8217;t know how to execute that in ATOM. Do you have any idea or else can I use any other editor and let me know how to execute it.</p>\n"}},{"node":{"content":"<p>Thanks for reading Justin! Things are good over here, can&#8217;t complain, hope you&#8217;re doing good bro!!</p>\n"}},{"node":{"content":"<p>Man, shopify sounded unprofessional as hell but fun as fuck back in 2009, wish I was there to experience it :&#8217;)</p>\n<p>My time there was awesome though thanks to the FED crew; how you doin Tets? 😀</p>\n"}},{"node":{"content":"<p>@Mia thanks for reading!! 🙂 Trust me, even after 9 years I still feel like I&#8217;m new too haha. I guess the best thing to do is to not be intimidated by that fact and just soak up as much as possible.</p>\n<p>I ended up picking up a copy of Zelda, appreciate the thought though! 🙂</p>\n"}},{"node":{"content":"<p>I found your blog! Cause you were an Instagram suggestion, and I saw it in your profile. Very cool to read about your old time days at Shopify! After 1.5 years, I still feel like I&#8217;m super new. On another note, wanna borrow Zelda for Switch?</p>\n"}},{"node":{"content":"<p>Dude thanks so much for reading! I&#8217;m really to have met you too man, I always new you were a cool dude even before I met you in person. Loved that robot evolutiondesign icon! 😀 </p>\n<p>Really recommend the Switch especially if you travel a lot. It&#8217;s really sick to be able to hop in and out of gaming sessions! </p>\n<p>Love you bro and I swear I&#8217;ll visit Charleston soon!</p>\n"}},{"node":{"content":"<p>Great post! 2 months no booze! Good on ya. </p>\n<p>Some great memories there. 9 years is just insane to think about. So glad our paths crossed my man. It’s amazing to think about all the twists and turns that puts people places and things in your path along the way.</p>\n<p>On _Hornets Nest_ great ending to the trilogy and you’ll be super happy with the original films and you would have been fucking pissed if you had watched them before finishing the books. Films are good but the books are wayyyyy better. Not like they aren’t always better. </p>\n<p>Been looking at the switch myself, if fo no other reason than to get some fun “lighter” games than what I play on the PS4. I may have to make the jump myself. Seems like it may travel well too.</p>\n<p>Love you brother, glad I saw your post!</p>\n"}},{"node":{"content":"<p>hehe tack evija! &lt;3</p>\n"}},{"node":{"content":"<p>You go, Tets!!</p>\n"}},{"node":{"content":"<p>Thanks for reading, brotha &lt;3</p>\n"}},{"node":{"content":"<p>Fantastic post-mortem, man. Really inspiring to read. Thanks for sharing!</p>\n"}},{"node":{"content":"<p>I am following this tutorial to develop a theme but unable to show the sliders and i have three sliders in the homepage</p>\n"}},{"node":{"content":"<p>Tetchi,</p>\n<p>Thank you so much for this workflow.  I have gone through and added the entire content and am able to get everything to work except the Paypal button.</p>\n<p>I have wrapped the checkout buttons in div code but the PayPal button allows you to bypass the script.</p>\n<p>additonally my pop up is not as nice as yours that you show.  testing on google chrome web. </p>\n<p>Any suggestions would be amazing.  This will help me reduce the number of returns this year.</p>\n<p>Cheers.</p>\n"}},{"node":{"content":"<p>Hi! Great tutorial! I&#8217;m having the same trouble as everyone else&#8230; the donation box is showing up but it&#8217;s not adding to my cart. Please help! Thank you!</p>\n"}},{"node":{"content":"<p>This works well to stop page content from shifting, but if you have a background image instead of CSS colors it causes the image to shift over still. Any idea how to prevent that from happening?</p>\n"}},{"node":{"content":"<p>Hi Tetchi,</p>\n<p>I&#8217;m having the same issue as it looks like a few others have had. I think I followed all the steps correctly, but when I put a number into the donation box on the checkout page and click update or checkout, it doesn’t update the total and deletes the amount I put in.</p>\n<p>Help?</p>\n<p>Thanks!</p>\n<p>Toyo</p>\n"}},{"node":{"content":"<p>Oh man! Thanks for reading, Jon 🙂</p>\n"}},{"node":{"content":"<p>Come for the Shopify tutorial, stay for the summary of the book that I read a while ago and hadn&#8217;t fully absorbed 🙂</p>\n"}},{"node":{"content":"<p>Hey Kyle, I&#8217;m sorry for the confusion, this post has not be updated in a while! </p>\n<p>Variant Images is now a native feature in Shopify. You can read more about it here: <a href=\"https://help.shopify.com/themes/customization/products/select-variants-by-clicking-images\" rel=\"nofollow\">https://help.shopify.com/themes/customization/products/select-variants-by-clicking-images</a> &#038; <a href=\"https://help.shopify.com/manual/products/product-variant-images\" rel=\"nofollow\">https://help.shopify.com/manual/products/product-variant-images</a> 🙂</p>\n"}},{"node":{"content":"<p>Hi Tetchi,</p>\n<p>Variant-image is not available in the app store of shopify, any means to get it?</p>\n<p>Thanks<br />\nKyle</p>\n"}},{"node":{"content":"<p>I just wanted to say I&#8217;m glad this still exists! I have a client with a pretty old theme (Minimo) that is impossible to find documentation on.  Luckily this worked like a charm, once I realized I needed to change the image wrapper id. &#8211; Thanks for saving me huge re-development time.</p>\n"}},{"node":{"content":"<p>Hi,<br />\nI am trying to work out a way to add a table for my variants onto my product pages so customers can select multiple variants before adding branding and then hitting add to cart.<br />\nCan your table be added to a products page?</p>\n"}},{"node":{"content":"<p>Glad it helped Anton!</p>\n"}},{"node":{"content":"<p>&#8230;. due to DOCTYPE &#8230;.</p>\n"}},{"node":{"content":"<p>Very helpful post. Thank You! </p>\n<p>I realized that the second scrollbar displayed due to . But I don&#8217;t know how to solve it.</p>\n"}},{"node":{"content":"<p>Thanks for reading Grant!! ❤️</p>\n"}},{"node":{"content":"<p>Great story and such a neat encounter 🙂</p>\n"}},{"node":{"content":"<p>Thanks for reading, Toby! 🙂</p>\n"}},{"node":{"content":"<p>I just discovered the issue with VoiceOver and border independently&#8230; I felt an obligation to post it somewhere and was glad to see that you beat me to it. Thanks for the info&#8230; and for the details regarding Chrome and Firefox!</p>\n"}},{"node":{"content":"<p>I would love to hear about what fundamental things you learnt about yourself from your success this year.</p>\n"}},{"node":{"content":"<p>Amazingly perfect guide for newbies and even masters.</p>\n<p>Thanks for the help 🙂</p>\n"}},{"node":{"content":"<p>Strange! I&#8217;ll take a look shortly, Bogdan.</p>\n"}},{"node":{"content":"<p>I can&#8217;t figure-out how to repeat this demo page?<br />\nHere is codepen  <a href=\"https://codepen.io/Tvoyrotoptal/pen/ozporA\" rel=\"nofollow\">https://codepen.io/Tvoyrotoptal/pen/ozporA</a> where every element is the same ,but its working in a different way.<br />\nWhat im doing wrong?</p>\n"}},{"node":{"content":"<p>Ohhh I checked out YNAB too, actually! I opted for Wally because it&#8217;s completely free, but maybe I should give YNAB&#8217;s trial a shot. </p>\n<p>Agreed about the reactionary mindset. Manual input is where it&#8217;s at fosho 👍</p>\n"}},{"node":{"content":"<p>Nice! Wally looks pretty neat. I&#8217;ve been using YNAB for the past while for budgeting and have been really liking it.</p>\n<p>I totally agree with the manual entry of purchases. I used to use Mint but found that my attitude was very &#8220;reactionary&#8221;. &#8220;Ah crap, I spent X at coffee shops&#8230;.hopefully I don&#8217;t do that next month&#8221;. I feel that a lot of that was due to the automated nature of it. I didn&#8217;t really have to come face to face with my purchases.</p>\n<p>In YNAB, there&#8217;s an automated feature but I purposefully don&#8217;t use it as the manual entry really makes you come to terms with where your money went. I&#8217;m feeling much more pro-active now and in control.</p>\n<p>I&#8217;ll be curious to see how you find Wally a few months down the line! It looks like a slick app to use.</p>\n"}},{"node":{"content":"<p>@Shane</p>\n<p>Here&#8217;s the code that I used.  Should help you format yours. </p>\n<p>  I agree with the <a href=\"/pages/terms-of-use\" rel=\"nofollow\">terms and conditions</a>.</p>\n"}},{"node":{"content":"<p>Thanks!  Works great in the Shopify Minimal theme</p>\n"}},{"node":{"content":"<p>Raniel, to show a success or error message, you must set form erros to display INSIDE a {% form %} function.</p>\n"}},{"node":{"content":"<p>YEAH!!!!  nice TUTS TETCHI!!!</p>\n<p><a href=\"http://prntscr.com/btzvgq\" rel=\"nofollow\">http://prntscr.com/btzvgq</a></p>\n"}},{"node":{"content":"<p>NOW  I UNDERSTAND&#8230; VERY WELL SAID!</p>\n<p>Nice TUTS..</p>\n<p>actually this is my 2nd time AROUND to visit ur TUTS..</p>\n"}},{"node":{"content":"<p>Hey tetchi, </p>\n<p>NICE tuts&#8230;. very helpful..</p>\n<p>have a question,,,</p>\n<p>why the success message.. doesn&#8217;t show when reset password is done..</p>\n"}},{"node":{"content":"<p>here&#8217;s the code </p>\n<p><a href=\"http://prntscr.com/bq8dlh\" rel=\"nofollow\">http://prntscr.com/bq8dlh</a></p>\n"}},{"node":{"content":"<p>hi tetchi good TUTS..bro&#8230;</p>\n<p>i have q question&#8230; why<br />\ntheres no TAG over here..</p>\n<p><a href=\"http://prntscr.com/bq8d12\" rel=\"nofollow\">http://prntscr.com/bq8d12</a></p>\n"}},{"node":{"content":"<p>hey thanks Yulia! 🙂 See you round!</p>\n"}},{"node":{"content":"<p>Hi Tetchi,</p>\n<p>Thank you for this tutorial.</p>\n<p>Anyone knows any workaround for Amazon payment button?</p>\n<p>Thanks</p>\n"}},{"node":{"content":"<p>That&#8217;s so cool. Congrats!<br />\nJust moved to Mtl too, so welcome 😀</p>\n"}},{"node":{"content":"<p>Figure 3.4: This product is now forever alone, not unlike the author of this tutorial&#8230;.</p>\n<p>yes ur not alone because were here reading ur tuts.<br />\nHeheh LAUGHING OUT LOAD..</p>\n"}},{"node":{"content":"<p>You guys are gonna miss the hell out of me.</p>\n"}},{"node":{"content":"<p>Cool story.</p>\n"}},{"node":{"content":"<p>Pourquoi est-ce que tu es encore ici</p>\n"}},{"node":{"content":"<p>J&#8217;ai tellement hâte de te voir à Montréal! 🙂 🙂<br />\nPlein de belles choses t&#8217;attendent!</p>\n"}},{"node":{"content":"<p>k bai</p>\n"}},{"node":{"content":"<p>Goooood riddance!!!</p>\n"}},{"node":{"content":"<p>Great article Tetchi. Thanks 😉</p>\n"}},{"node":{"content":"<p>&gt; Plusieurs fois quand j’étais dans Montréal, j’ai essayé à parler avec les employés d’un magasin en français, mais ils répondraient en anglais.</p>\n<p>Celui-ci est très commun, même pour nous Anglophones qui se considèrent bilingue. J&#8217;ai donné un petit discours quelques années passée titré &lt;How to trick Francophones into thinking you speak French&gt;; je vais essayé de rappeler les points et peut-être nous pouvons le discuté avec un peu de café parfois 🙂</p>\n"}},{"node":{"content":"<p>thanks a lot for this.</p>\n"}},{"node":{"content":"<p>I&#8217;m also getting the same error message as Jonny&#8230;</p>\n<p>&#8220;The following were flagged as potential issues in this file:<br />\n• Line 1 — Liquid syntax error: Expected id but found number in &#8220;{{pages.404 }}&#8221; </p>\n<p>These issues may not affect your theme, but should be reviewed if you notice any problems.<br />\nNote: This message is only shown in development shops.&#8221;</p>\n<p>This shows up above my code and then when I try to load a non existing page, it takes me to the password page as if I am an external viewer.</p>\n<p>Any suggestions?</p>\n<p>Thanks</p>\n"}},{"node":{"content":"<p>@Franklyn thanks so much for reading 🙂</p>\n"}},{"node":{"content":"<p>Really inspiring stuff. I like your use of read more and having the topic as screen reader only.</p>\n"}},{"node":{"content":"<p>hi there, is there a chance to get the code for the version that shows ALL products? the link is broken unfortunately.<br />\nthx<br />\nben</p>\n"}},{"node":{"content":"<p>@keir thanks so much for reading bud! You should definitely check it out sometime! There are some sweet snowboarding spots too!</p>\n"}},{"node":{"content":"<p>Just finished the series dude! Loved it and my desire to go to Japan is growing stronger by the minute! (The Mario kart racing was bonkers!)</p>\n"}},{"node":{"content":"<p>@Atif send a link. I can take a look at it</p>\n"}},{"node":{"content":"<p>ahahaha. I done goofed bahd! It all turned out alright though 🙂</p>\n"}},{"node":{"content":"<p>Can&#8217;t believe you missed your flight bahd! 😀</p>\n"}},{"node":{"content":"<p>Hi, I wonder where I find that {% layout settings.customer_layout %} ? Is it now gone? It is strange that the system lets me create a new account.xxx.liquid so easily but I really don&#8217;t see a way to use it&#8230; Perhaps only via an app somehow?</p>\n"}},{"node":{"content":"<p>Hey there Emily, apologies for the late reply. </p>\n<p>Quite a lot has changed with theme settings since I wrote this in 2012 &#8211; theme settings are now pulled from a JSON file called settings_schema.json and not settings.html. More info here: <a href=\"https://docs.shopify.com/themes/theme-development/storefront-editor/settings-schema\" rel=\"nofollow\">https://docs.shopify.com/themes/theme-development/storefront-editor/settings-schema</a></p>\n"}},{"node":{"content":"<p>Hi, I don&#8217;t have a settings.html file for my Shopify theme, but I do have a json file-one called settings_data.json and another called settings_schema.json.</p>\n<p>Do I need to translate the GIST code from step 3 into JSON for this to work?</p>\n<p>Thank you!</p>\n"}},{"node":{"content":"<p>Hi, I&#8217;m having issues with the last step-I can&#8217;t find settings.html in the Template Editor. Would you be able to direct me to where I can find it?</p>\n<p>Thank you!</p>\n"}},{"node":{"content":"<p>Great article throwing light on &#8220;liquid&#8221; in shopify<br />\nShaily, GoWebBaby</p>\n"}},{"node":{"content":"<p>Hello,<br />\nI&#8217;m having the same issues that:<br />\nmani on October 17th, 2013, David on November 21st, 2014, and myfamilycart on February 24th, 2015<br />\nhave with creating multiple sets of the order form and quantities/pricing are doubled in the cart. Was this resolved and if so any help would be much appreciated!<br />\nMany thanks!</p>\n"}},{"node":{"content":"<p>@Edward super-duper recommended! You should play with Kyle P 😀</p>\n"}},{"node":{"content":"<p>Sounds awesome! I’ve got to check this out!</p>\n"}},{"node":{"content":"<p>Hey Tetchi. I&#8217;m having the issue where the donation box is there but nothing happens when I enter a number. ayoblak.myshopify.com. I&#8217;m using the lookbook theme. Think you can help? I&#8217;ve been searching for this type of solution for a while now.</p>\n"}},{"node":{"content":"<p>my desc area is not flowing to the right of page, stuck in step 4 , plz help</p>\n"}},{"node":{"content":"<p>Hi Tetchi, </p>\n<p>Thanks for the great tutorial of the online form. I have added this to my website and it works perfectly. I would like to do some further customisation. Can you please tell me how I can:</p>\n<p>&#8211; Change the quantity selection bar to a dropdown menu with multiples of 5;<br />\n&#8211; Change the layout of the table?</p>\n<p>Many thanks in advance.<br />\nRegards, Linet</p>\n"}},{"node":{"content":"<p>Hey Chris, you could check for the value of {{ template }} and output a different class based on its value. </p>\n<p>For example, you could have something like:</p>\n<p><body class=\"page {% if template contains 'alternate-template-name' %}page--alt{% endif %}\"></p>\n<p>&#8230;and then have CSS specific to the page&#8211;alt class name.</body></p>\n"}},{"node":{"content":"<p>How can I use the RTE but define a different class in the css (i would be making a alternate page template and needing the RTE content to use this new css class)</p>\n"}},{"node":{"content":"<p>Hello! This is a great form, and just what I am after &#8211; thanks!</p>\n<p>Is there anyway I can change the quantity input field into a dropdown select box? What I&#8217;d ideally like is to be able to select quantities of 20,30,40,50,60,70,80,90,100&#8230;. and so on? </p>\n<p>Thanks in advance!</p>\n"}},{"node":{"content":"<p>Firstly, thanks for such a great tutorial, it was a huge help for me with starting to make shopify themes.<br />\nSecondly, I don&#8217;t suppose you have / are planning on doing a responsive tutorial for this are you?</p>\n<p>Thanks</p>\n"}},{"node":{"content":"<p>@Grant haha, thanks for reading buddy 🙂</p>\n"}},{"node":{"content":"<p>Hahaha</p>\n<p>“what if he suddenly stood up and started stomping everyone? Is there a good hiding place nearby? Which friend would I be okay with leaving behind?”</p>\n"}},{"node":{"content":"<p>Thank you very much for these articles. They&#8217;ve been very helpful!</p>\n<p>For anyone looking for the Customer Area Layout and cannot find it, I think it&#8217;s part of an old version of Shopify. I think the current version uses the themes templates automatically.</p>\n<p>In your customer templates there is this code at the top &#8211; {% layout settings.customer_layout %} Remove this and you will get the same result as Figure 11.6.</p>\n<p>Hope that helps anyone who runs into this in the future</p>\n"}},{"node":{"content":"<p>So, I finished the tutorial while cross-referencing the updated Shopify docs.  Here is the resulting settings_schema.json that corresponds to this tutorial:</p>\n<p><a href=\"https://github.com/mikekuehn/tetchi-scratch-2015/blob/master/config/settings_schema.json\" rel=\"nofollow\">https://github.com/mikekuehn/tetchi-scratch-2015/blob/master/config/settings_schema.json</a></p>\n<p>Thx again Tetchi.</p>\n"}},{"node":{"content":"<p>Hi John,</p>\n<p>Parts 11-13 still work, if you delete the top line in each of the templates/customers/*.liquid files.  This line is {% layout settings.customer_layout %}</p>\n<p>These final parts are trickier because the settings format has changed a lot in recent versions of Shopify.  It no longer uses config/settings.html but instead uses config/settings_schema.json.</p>\n<p>Example: <a href=\"https://github.com/Shopify/Timber/blob/master/config/settings_schema.json\" rel=\"nofollow\">https://github.com/Shopify/Timber/blob/master/config/settings_schema.json</a><br />\nDocs: <a href=\"https://docs.shopify.com/themes/theme-development/storefront-editor/settings-schema\" rel=\"nofollow\">https://docs.shopify.com/themes/theme-development/storefront-editor/settings-schema</a></p>\n"}},{"node":{"content":"<p>I realize this tutorial is a bit old, and you probably aren&#8217;t supporting it anymore, but for the benefit of others:</p>\n<p>Guest login form appears to be deprecated. The cart &#8220;Checkout&#8221; button goes straight to <a href=\"https://checkout.shopify.com\" rel=\"nofollow\">https://checkout.shopify.com</a> which is unthemable (unless a Plus theme, which I don&#8217;t know how to setup yet!)</p>\n<p>Recover password has strange behaviour when the email is incorrectly entered. Once the form is submitted, the page refreshes and the error message shows up within div.recover-password, which is hidden.  Here is a simple fix. Add it to the script at the bottom of login.liquid:</p>\n<p>if( $(&#8216;.recover-password .errors&#8217;).length ) {<br />\n  $(&#8220;.customer-login, .guest-login, .recover-password&#8221;).toggle();<br />\n}</p>\n<p>This will (instantaneously) toggle back to the recover password form if there is an error shown there.  A bit inelegant, but it is a workaround for the behaviour of form.posted_successfully? &#8211; which always returns true for address forms.  See: <a href=\"https://docs.shopify.com/themes/liquid-documentation/objects/form#form-posted_successfully\" rel=\"nofollow\">https://docs.shopify.com/themes/liquid-documentation/objects/form#form-posted_successfully</a></p>\n"}},{"node":{"content":"<p>Thanks for this tips. It had help us understand about this variant things with Shopify. I hope that things will be improved soon by shopify so that we will not be looking for other solutions for this problem.</p>\n"}},{"node":{"content":"<p>Ray, Luke, Jonny:<br />\nStep 4 of the tutorial appears to be deprecated in the current version of Shopify.  It stumped me at first too.</p>\n<p>To get Shopify to use our own templates for the customer account pages, remove the first line {% layout settings.customer_layout %} from each customer template (theme_root/templates/customers/*.liquid)</p>\n"}},{"node":{"content":"<p>I was a bit confused by the JavaScript until I found the documentation for Shopify.OptionSelectors here: <a href=\"https://docs.shopify.com/support/your-website/themes/can-i-make-my-theme-use-products-with-multiple-options#instantiate-shopify-optionselector\" rel=\"nofollow\">https://docs.shopify.com/support/your-website/themes/can-i-make-my-theme-use-products-with-multiple-options#instantiate-shopify-optionselector</a></p>\n<p>To avoid listing unavailable product combinations, Shopify has provided another useful snippet: <a href=\"https://docs.shopify.com/manual/configuration/store-customization/advanced-navigation/linked-product-options\" rel=\"nofollow\">https://docs.shopify.com/manual/configuration/store-customization/advanced-navigation/linked-product-options</a></p>\n<p>Thanks again for the tutorial Tetchi!</p>\n"}},{"node":{"content":"<p>Awesome tutorial, thanks.</p>\n<p>But the CSS code that I added in the last step seems to have added a line that I guess needs to be just above the &#8220;next page&#8221; button, the problem is that it is actually located between the product images.</p>\n<p>I have managed to remove the line but I would rather want to know how to move it down?</p>\n"}},{"node":{"content":"<p>Great tutorial.  I got a bit hung up on offline theme editing &#8211; the tool you linked to may be deprecated?  (<a href=\"https://github.com/davidmurdoch/shopify-theme-sync\" rel=\"nofollow\">https://github.com/davidmurdoch/shopify-theme-sync</a>)  Ended up using the official shopify-theme gem (<a href=\"https://github.com/Shopify/shopify_theme\" rel=\"nofollow\">https://github.com/Shopify/shopify_theme</a>).  Works great, and now I can edit my themes from Sublime Text in Linux!</p>\n"}},{"node":{"content":"<p>Hey Tetchi,</p>\n<p>I&#8217;ve used this tutorial for the order form on <a href=\"http://3duckday.com/pages/order-form\" rel=\"nofollow\">http://3duckday.com/pages/order-form</a></p>\n<p>It works ok but it automatically adds 2 of the item upon initially clicking &#8216;+&#8217; and then then only way to revert to &#8216;0&#8217; is to select and delete the field entry. Using the &#8216;-&#8216; only returns the total to &#8216;1&#8217;. Any ideas what might be happening here?</p>\n<p>Thanks,</p>\n<p>Matt</p>\n"}},{"node":{"content":"<p>@Tea I miss that texmex &#038; BBQ pretty hard.</p>\n"}},{"node":{"content":"<p>This post makes me hungry.</p>\n"}},{"node":{"content":"<p>Nice post! Consider this mentally logged away for when I inevitably run into this issue in the future 🙂</p>\n"}},{"node":{"content":"<p>It&#8217;s incredible how few websites implement this, yet how much friendlier it is to the user to include it. This also extends to drawers or other popouts that have their own scrollable area.</p>\n"}},{"node":{"content":"<p>Mate you&#8217;re a star. Many thanks for this</p>\n"}},{"node":{"content":"<p>Hi Tetchi,<br />\nI was wondering if you could help me. I&#8217;ve been following your shopify theme tutorial which is great thanks!<br />\nI&#8217;m having problems with multiple dropdown fields to each of our 3 kinds of contact forms in our website. When I did a test only one of the dropdown field info showed up in the email. Why is this? I&#8217;m using a solo theme.<br />\nLooking forward to hearing from you.<br />\nCheers,<br />\nJoy Haines<br />\nQuick Print Tees</p>\n<p>password for website: sandman</p>\n"}},{"node":{"content":"<p>meridiths-catering.myshopify.com   site not launched yet&#8230;.any chance I could get email addresses of those that responded, my goal is to review their websites and reach out to find what works and what to avoid&#8230;as you see, I am on east coast and the chances that trade secrets could not be shared is slim&#8230;hoping they would help a fellow foodie&#8230;.thanks George</p>\n"}},{"node":{"content":"<p>Wow, Tetchi, this is exactly what I needed!  Only issue is that I can&#8217;t get the last gist (to adjust the theme settings) to work. I get a huge error message when I try to save it. Granted they&#8217;ve updated Shopify a bit since this but do you have any suggestions?  I&#8217;m using the Atlantic theme&#8230;at least I think I still am. Had some modifications made but I&#8217;m code-illiterate (hanging on by my fingernails!) so not totally sure..  thanks!</p>\n"}},{"node":{"content":"<p>I cant find the above either!</p>\n"}},{"node":{"content":"<p>No problem as such here but i&#8217;m getting the prompt:</p>\n<p>The following were flagged as potential issues in this file:<br />\nLine 1 — Liquid syntax error: Expected id but found number in &#8220;{{pages.404 }}&#8221;<br />\nThese issues may not affect your theme, but should be reviewed if you notice any problems.<br />\nNote: This message is only shown in development shops.</p>\n<p>on my 404.liquid file in the theme developer.</p>\n"}},{"node":{"content":"<p>Followed this to the letter so far but my homepage products wont display on two rows of 4. Its showing as two rows of three and one row of two. I get this error prompt on my index.liquid screen:</p>\n<p>The following were flagged as potential issues in this file:<br />\nLine 9 — Liquid syntax error: Expected end_of_string but found pipe in &#8220;product in collection.products | limit:8&#8221;<br />\nThese issues may not affect your theme, but should be reviewed if you notice any problems.<br />\nNote: This message is only shown in development shops.</p>\n<p>Any help?</p>\n"}},{"node":{"content":"<p>Hey tetchi, tks for the tutorial. Went quite well until Part11 onwards from there on it was a little confusing simply because I could be using an updated interface where things could have changed around; I couldn&#8217;t locate Template Settings Page and could not progress forward. in Part 14, I couldn&#8217;t find &#8216;settings.html&#8217; to edit. </p>\n<p>I was in the Windows environment and was using the default editor which may have partly contributed to the problem. I believe your tutorials were based on a Mac editor.</p>\n<p>Kindly give me some directions to move forward so as to complete the last 5 tutorial parts.</p>\n<p>Warm Regards,</p>\n"}},{"node":{"content":"<p>hey!  OMG LOVE!!  only issue is trying to hide the donation price in the checkout screen&#8230;am i possibly adding the CSS in the wrong order?</p>\n<p>Also is there a way&#8230;when one returns to checkout and has added  a donation the Donation also appears in the cart.  Way to hide that too?</p>\n<p>Anything typed in the donation box then gets added additionally&#8230;</p>\n<p>Just some thoughts &#8211; otherwise, this wasnt just a $$ saver but also, literally the perfect fix.  Love it.  Thank you.</p>\n"}},{"node":{"content":"<p>What do you mean by Theme settings and how do you navigate towards it?</p>\n"}},{"node":{"content":"<p>I have a shopify metafield that holds a variants original inventory level. I want to track each variant independently of each other. If I want to return the starting inventory number of each variant, I use this: {{ original_count }}</p>\n<p>How would I insert this into the javascript to return a percentage for each variant, rather than variant level compared to whole product level?</p>\n"}},{"node":{"content":"<p>I know this is a little dated but my price doesn&#8217;t change when you select a different variant. Im new to this stuff so trying to alter the script is pretty difficult for me.</p>\n"}},{"node":{"content":"<p>Hello,</p>\n<p>First of all, this is such a great tutorial.. </p>\n<p>I have question regarding on &#8220;Customer Area Layout”, I can&#8217;t find this.. </p>\n<p>Thanks.</p>\n"}},{"node":{"content":"<p>I have the same questions as Johannes.  Is it possible to update your post to include these instructions?  Thanks.</p>\n<p>I have the checkbox working on <a href=\"http://www.organicfamily.co\" rel=\"nofollow\">http://www.organicfamily.co</a>  just needs to be right justified and have a link to the Terms and Conditions page.</p>\n"}},{"node":{"content":"<p>Hi Tetchi&#8230;.Excellent tutorial&#8230;I have a question!&#8230;as the same way to edit the addresses, Is possible the user can edit their personal information like the email, the name, etc?</p>\n<p>Thank you</p>\n"}},{"node":{"content":"<p>can i show this bar in %&#8230;</p>\n<p>Thanks</p>\n"}},{"node":{"content":"<p>There is no snippet folder on the basic theme I upload?.. :/</p>\n"}},{"node":{"content":"<p>Note in the above comment the line to be included was not output as it contains HTML.  The missing line (without the beginning and ending angle brackets) is;</p>\n<p>link href=&#8221;{{ &#8216;css-carousel.css&#8217; | asset_url }}&#8221; rel=&#8221;stylesheet&#8221;</p>\n"}},{"node":{"content":"<p>I am trying to include a CSS file based on a condition in my settings.  I tried;</p>\n<p>  \t{% if setttings.slideshow_position %}</p>\n<p>  \t{% endif %}</p>\n<p>But the CSS file was not included (it&#8217;s full name is &#8220;css-carousel.css.liquid&#8221;.  I have also confirmed that &#8220;settings.slideshow_position&#8221; contains a value as I used &#8220;{{ settings.slideshow_position }}&#8221; as the first line following &#8220;&#8221; and the value is displayed on the page.</p>\n<p>Is there something wrong with my code?</p>\n"}},{"node":{"content":"<p>Hello</p>\n<p>I&#8217;m attempting to implement this tutorial using the Parallax theme to add captions to images added with the RTE.</p>\n<p>I&#8217;ve managed to display the alt tags, however they don&#8217;t want to sit under the images, but rather align with the text that wraps around the image?</p>\n<p>Is it possible to modify the snippet so that it creates a  rather than the  which I could then use to wrap the img and alt tag so they display correctly?</p>\n<p>Cheers</p>\n<p>Matt Thomson</p>\n"}},{"node":{"content":"<p>Fixed it. </p>\n<p>It looks like Shopify renamed my style.css and normalize.css files to have the .liquid ending. I renamed the file on my computer to have the .liquid ending and everything snapped into shape!</p>\n"}},{"node":{"content":"<p>Thank you so much for this tutorial! I&#8217;m learning a lot. </p>\n<p>One problem though&#8230; I&#8217;m not able to get the the thumbnails to &#8220;float&#8221; next to each other. I pasted the code to no change on my page ( the thumbnails are still stacked on top of each other ). Is there something new that needs to be done? My code is exactly the same as yours.</p>\n"}},{"node":{"content":"<p>Fantastic tutorial! It was a great help.</p>\n<p>One question.<br />\nMost of the time the person placing the order is not the recipient, so the shipping address will not be the same as the billing address. </p>\n<p>Is there a way for the buyer to input the shipping/recipient address somewhere on checkout page?</p>\n<p>Thank you</p>\n"}},{"node":{"content":"<p>The click event wasn&#8217;t registered for me, so I also got the same problem as many have reported that not checking the box allowed you to proceed.  After some debugging, I think that the jQuery(document).ready handler is executed when the Add to Cart page is up, but the Checkout button somehow wasn&#8217;t isn&#8217;t loaded that that moment, so the event handler is probably never attached.</p>\n<p>I am using the default shopify jquery in my themes.liquid:<br />\n{{ &#8216;//ajax.googleapis.com/ajax/libs/jquery/1.11.0/jquery.min.js&#8217; | script_tag }}</p>\n<p>I follow the example from:<br />\n<a href=\"http://stackoverflow.com/questions/5540561/jquery-click-event-not-firing\" rel=\"nofollow\">http://stackoverflow.com/questions/5540561/jquery-click-event-not-firing</a></p>\n<p>and change this example to use instead of:<br />\njQuery(&#8220;.submit-cart input[type=&#8217;submit&#8217;],.submit-cart input[type=&#8217;image&#8217;]&#8221;).click(function(){</p>\n<p>to:<br />\njQuery(document).on(&#8216;click&#8217;, &#8220;.submit-cart input[type=&#8217;submit&#8217;],.submit-cart input[type=&#8217;image&#8217;]&#8221;, function(){ // this works</p>\n<p>This attach the handler to the whole document, not the most efficient, but that worked for me as a workaround.</p>\n"}},{"node":{"content":"<p>Hi Tetchi,</p>\n<p>is there any solution to display variant value display under each product image thumbnail??</p>\n<p>My client has flavors and they want me to display each flavor name under each product thumbnail on product page.. Please guide me direction&#8230;</p>\n<p>Best,<br />\nSyed</p>\n"}},{"node":{"content":"<p>Nice! Thank you for sharing this wonderful tutorial.</p>\n"}},{"node":{"content":"<p>Back again, I managed to figure out everything except the drop down menu part.</p>\n"}},{"node":{"content":"<p>Although Shopify has updated its site, I was able to follow your instructions fairly easily. However, I uploaded the three social icons through &#8220;Files&#8221; but they do not appear in my Assets menu. How do I get them there?<br />\nI&#8217;m still trying to get my collections to appear in a drop down menu under catalog. Or show all the collections available to choose from on the catalog page.<br />\nI notice that most of your other comments are somewhat old so I hope you are still moderating this site. Thanks for the tutorial!</p>\n"}},{"node":{"content":"<p>Hey Tetsuro, thank you very much for your detailed step-by-step explanations and code samples. This is absolutely an invaluable tutorial. As a person who is trying to learn to code in Liquid, this the best and only detailed one I found around. I appreciate the time you put in. Cheers!</p>\n"}},{"node":{"content":"<p>Thank you so much for doing this &#8211; I wonder if you could me with something, I&#8217;ve followed all your instructions and pretty much everything has worked fine, except that I can&#8217;t work out why my logo is not centred like your is. </p>\n<p>Could you help please?</p>\n<p>My store is <a href=\"https://tracymac-first-theme.myshopify.com\" rel=\"nofollow\">https://tracymac-first-theme.myshopify.com</a></p>\n"}},{"node":{"content":"<p>Thanks so much for doing this, tetchi, I really appreciate all the work you&#8217;ve done on this. Where can I click to buy you a beer?</p>\n"}},{"node":{"content":"<p>I have exactly the same problem as mentioned by Mani on Oct 17 2013. I have created 3 sets of order forms by repeating the steps. After the 1st set was created and tested, everything was working nice as expected. But after I had created 2 more sets and have included 3 scripts in the theme.liquid, the quanities of products are showing as 3x times in the cart while the quantity is being selected as either 1 or 2 while adding to cart.</p>\n<p>The following are in my theme.liquid</p>\n<p>    {% include &#8216;order-form-script&#8217; %}<br />\n    {% include &#8216;order-form-script-medium&#8217; %}<br />\n    {% include &#8216;order-form-script-large&#8217; %}</p>\n<p>If I test by removing any 2 scripts here and keep 1, every thing works fine. So I suspect the quantity variable is adding 3x times the quantity mentioned in the form as all the 3 scripts are being executed one after another. But I am not well versed with web programing. Could I get some help to identify the variable name which is responsible for carrying the qty to the cart. I will use separate variables so that it doesn&#8217;t carry its value from one script to another.</p>\n"}},{"node":{"content":"<p>Hi, this is perfect 🙂</p>\n<p>Any chance of storing this variable globally and show it on all other pages and not just this one?</p>\n"}},{"node":{"content":"<p>hello, how can i use custom fonts for the header and also body texts. 🙂</p>\n"}},{"node":{"content":"<p>Fantastic job on this tutorial!<br />\nVery helpful and greatly expanded my understanding of liquid and the shopify customizing methods in general.</p>\n"}},{"node":{"content":"<p>I too have an image I need to put a caption under, but all of the paragraph text in the blog wraps around the image. Do you have a script for that?</p>\n<p>best regards</p>\n"}},{"node":{"content":"<p>Tetchi, </p>\n<p>Thanks for the great resource! Very helpful!</p>\n<p>Could you clarify which CSS classes are necessary and which aren&#8217;t? For instance, the .rte class I believe is generally for rich text input from the user. However, I didn&#8217;t see any .rte class in the css files for this template. Is there some other reason for including it (e.g. they are accessed by the Shopify scripts)? There are other CSS classes here that present the same question like index-page and index-collection. Could you please clarify?</p>\n<p>Also, generally, are there any CSS classes that are absolutely required for Shopify to work properly?</p>\n"}},{"node":{"content":"<p>Thanks for the great tutorial! I am using the &#8220;05/01/2013 updated version&#8221; of the scripts. I&#8217;m also seeing that each quantity is doubled when items are added to the cart. I would like to investigate this and solve it. Any suggestions? Thanks again.</p>\n"}},{"node":{"content":"<p>Each one of these transactions may need additional operations to take place.</p>\n<p>Performed range of clinical functions in a 70-bed neonatal ICU, assdessed patients&#8217; developmental stages and conditions, administered medications, maintained<br />\npatient charts and responded to medical emergencies.</p>\n<p>If we can prevent an emergency from happening in the first place,<br />\nwe are that much more effective in saving the lives of our children.</p>\n"}},{"node":{"content":"<p>Hey, just out of curiosity, how would you hide unavailable options from a dropdown? For example, I have mens and womens shirts with 6 mens sizes and 4 womens sizes but all six sizes show when I have &#8220;Womens&#8221; selected from the first dropdown when it should only show 4. </p>\n<p>It displays an &#8220;out of stock&#8221; on the button implying that these products exist when they do not and are just out of stock. Seems like if those options don&#8217;t exist, they shouldn&#8217;t show at all.</p>\n"}},{"node":{"content":"<p>Simply awesome &#8211; well written, easy to follow tutorial. </p>\n<p>I owe you a drink 🙂</p>\n"}},{"node":{"content":"<p>Hi if you don&#8217;t add a description you get undefined how to make it conditional?</p>\n"}},{"node":{"content":"<p>Hey there,</p>\n<p>I&#8217;m working on a fun little app with a developer, a character designer from Disney, and animator from Dream Works. </p>\n<p>I&#8217;m running into a similar problem, and my animator is unable to figure out how to successfully export the file as a proper FBX file format. </p>\n<p>We actually need the file to be converted to a DAE file format, but I&#8217;ve read that you can get there by first exporting it to a FBX format and then converting it to a DAE format afterwards. </p>\n<p>I was wondering if you&#8217;d be interested in helping us figure out how to properly convert the Maya animation to an FBX format. </p>\n<p>I can pay you for your time. </p>\n<p>Please let me know if you can help us out, it&#8217;d be greatly appreciated! </p>\n<p>Take care,<br />\nJack</p>\n"}},{"node":{"content":"<p>Hi Tetchi,</p>\n<p>Thanks so much for the great tutorial! You nailed it better than official Shopify forum! As a person not very comfortable with web programming, however, I can&#8217;t still figure out how to make your script work only for a certain product. Someone mentioned using &#8220;if statement&#8221;, but how the hell would you combine these two? </p>\n<p>I would really appreciate your advice!! Thank you!</p>\n"}},{"node":{"content":"<p>Thank you so much!!! 😀</p>\n"}},{"node":{"content":"<p>Thanks, great blog!</p>\n<p>But i get really terrible issue´s by exporting fbx files with placement textures like crater or something.<br />\nHow should i proceed?<br />\nLook forward for your reply!</p>\n"}},{"node":{"content":"<p>@Reina indeed, they&#8217;re not cheap&#8230; such cool designs though 😀</p>\n"}},{"node":{"content":"<p>Ok&#8230;so for other gun-jumpers like myself&#8230;..that ridiculously obvious fact I was missing, was the very next tutorial&#8230;#8 article.liquid.</p>\n"}},{"node":{"content":"<p>hmmm&#8230;I&#8217;ve ran this tut three times and after completing, when I click on anything that should take me to the blog post, I get the text that is currently in the (article.liquid) template&#8230;&#8230;&#8221;This is my article page!&#8221;.</p>\n<p>What ridiculously obvious fact am I missing? 🙂 </p>\n<p>thanks in advance</p>\n"}},{"node":{"content":"<p>^^ &#8220;&#8221;</p>\n"}},{"node":{"content":"<p>section 2.</p>\n<p>Closing tag for Price, reads  and is highlighted as an error.</p>\n<p>Great tutorials so far, thank you&#8230;..looking forward to the next 9 parts. 🙂</p>\n"}},{"node":{"content":"<p>:O I first came across B-Side Label in Tokyu Hands. &gt;.&lt; It was love at first sight, but it&#039;s quite pricey :.l</p>\n"}},{"node":{"content":"<p>Hi Tetchi,<br />\nThanks for detailed tutorials, you have been of a great help to many of us.</p>\n<p>I have a question related to customer accounts.</p>\n<p>Can you please guide me if there is at all possibility of entertaining login/signup errors on the same page without reloading the page?</p>\n<p>For example: if a user hits login or signup button without entering anything, the page reload and then throws related error. </p>\n<p>Can we handle this with jquery? I see that the errors refer to this form {{ form.errors | default_errors }} but i can&#8217;t find it anywhere.</p>\n<p>Thanks for your support in advance.</p>\n"}},{"node":{"content":"<p>Thanks for the note Amandeep! API Docs are being worked on as well, we&#8217;re working hard to make our documentation awesome across the board! Thank you very much for checking out my blog 🙂</p>\n"}},{"node":{"content":"<p>Yeah Shopify themes documentation is now quite improved.  But I feel Shopify API documentation needs to be improved a bit more. I read your blog for learning shopify tricks/techniques.  Looking forward to see more posts from you !!</p>\n"}},{"node":{"content":"<p>Thank you very much for these clear and easy to follow tutorials. You have been very helpful! This is a small thing, and I hate to point out a grammatical error, but you might want to edit &#8220;Instructions&#8230;has been sent&#8221; to &#8220;Instructions&#8230;.have been sent.<br />\nThanks again!</p>\n"}},{"node":{"content":"<p>Hi tetchi,</p>\n<p>Thank you for this blog &#8211; super helpful!  I was wondering if there was a way to order search results by collection so that search will display results for one collection (or product type or vendor) followed by another?  For example &#8211; I want to add a sold collection, but want the sold products to appear under available products in my search results.</p>\n<p>Thanks tetchi!</p>\n"}},{"node":{"content":"<p>Thanks for all the tutorials, there were certainly loads there that I hadn&#8217;t seen before!</p>\n<p>good work sir!</p>\n"}},{"node":{"content":"<p>very nice tut. I&#8217;m gonna implement this in my magento site.</p>\n"}},{"node":{"content":"<p>Thanks for the kind words Toby, have a good one 🙂</p>\n"}},{"node":{"content":"<p>Thanks so much for these tutorials, In 3 days, I&#8217;ve worked through all the 15 tutorials and gone from knowing absolutely nothing about shopify, to now feeling confident enough to go off and create my own theme! watch this space! thanks so much for the great tutorials</p>\n"}},{"node":{"content":"<p>Fantastic tutorials! thanks for creating these! I&#8217;m new to shopify and all excited, these tutorials are just what the web doctor ordered! great stuff!</p>\n"}},{"node":{"content":"<p>Hi Tetchi,</p>\n<p>U r awesome. Thank you so much for this.</p>\n"}},{"node":{"content":"<p>Awesome tutorial!!!!! Helped me a lot. I haven&#8217;t enough words to thank you buddy :). Will be waiting for more tutorials. Do you have any plans to write tutorials on PSD to Shopify and HTML to Shopify conversion? Will be waiting  for your next series on Shopify.</p>\n"}},{"node":{"content":"<p>You can delete all my comments 🙂 Its all ironed out. Funny how you figure things out right when you ask for help. Thank you for the awesome tutorial, you rock!!</p>\n"}},{"node":{"content":"<p>Sorry, two more cents to add &#8212; if I click &#8220;checkout&#8221; and then go back, I see the donation in the cart.</p>\n"}},{"node":{"content":"<p>Thank you for being a lifesaver! I am having the same issue as many of the others &#8211; when I put the donation amount into the box and click &#8220;update&#8221;, the donation amount does not post to the cart. I see that other people did get a solution, but it wasn&#8217;t posted here for me to sample 🙂  And just FYI, the URL I provided is a test site.</p>\n"}},{"node":{"content":"<p>Hi. Just starting on Shopify. One of their &#8216;gurus&#8217; pointed me to you and your help here on the 404 side which was bugging me like crazy was fantastic. Thanks so much. Will now look at what else you have written here<br />\nCheers<br />\nHaydn</p>\n"}},{"node":{"content":"<p>Hi,<br />\nAwesome job, thats what I was searching.<br />\nCould you give a small example of how to implement one bar with all the qantity stock?</p>\n"}},{"node":{"content":"<p>The <a href=\"http://wiki.shopify.com/Product_img_url\" rel=\"nofollow\">http://wiki.shopify.com/Product_img_url</a> link is going to a 404 error page.<br />\nBut I think the info can be found here <a href=\"http://docs.shopify.com/themes/filters/product-img-url\" rel=\"nofollow\">http://docs.shopify.com/themes/filters/product-img-url</a></p>\n"}},{"node":{"content":"<p>Just a note on this, I was confused with how the success message was shown when the &#8216;recover_customer_password&#8217; was submitted.</p>\n<p>When the page reloads, the liquid variable form.posted_successfully? is set to true ONLY within the form that was submitted, which in this case is hidden. By assigning the variable &#8216;reset_success&#8217; within the hidden form, it allows us to check if &#8216;reset_success&#8217; is true later on in the page with JavaScript, and subsequently show the form.</p>\n"}},{"node":{"content":"<p>Great write-up!<br />\nYou should mention that the source of the trouble is that FBX is not a native Maya format, but a format for exchange of media between different applications. It&#8217;s not completely open per se, but Autodesk provides a comprehensive SDK that one can use to export/import FBX.<br />\nIf Autodesk allowed exporting all the features present in Maya (like all deformers), they&#8217;d also have to supply the proprietary code that applies all the deformations. Not necessarily open source it, but at least supply it with the SDK. And while most of that code is trivial , some of it may have some trade secrets (however ridiculously outdated).<br />\nEven if that wasn&#8217;t an issue, it&#8217;d still be a huge amount of work to essentially embed all the features of .ma/mb file into fbx.<br />\nEven if they decided to do that, what do you do with custom nodes? Do you export them and say &#8220;good luck on the other end&#8221;? 🙂<br />\nEven if all of the above was magically solved, it&#8217;d make already complex and versatile format even more complex. This means adoption would suffer and FBX wouldn&#8217;t be supported completely by anyone (because to support it would require a lot more effort, essentially as much as supporting loading a full Maya scene). Even worse, if adoption wasn&#8217;t an issue (like if Autodesk decided to extend FBX with a bunch of features to support more precise export from Maya scenes), it&#8217;d only mean that a lot of software that supports FBX fully now simply wouldn&#8217;t support those features. It&#8217;s even worse because after exporting FBX you&#8217;d never know what shows up in which other software you&#8217;re importing it.<br />\nI&#8217;m rambling, though 🙂</p>\n"}},{"node":{"content":"<p>This tutorisl is great.</p>\n"}},{"node":{"content":"<p>Thanks for the tuts.</p>\n"}},{"node":{"content":"<p>Awesome! Thank you so much!</p>\n"}},{"node":{"content":"<p>Works perfectly, just what I was looking for &#8211; thank you so much!</p>\n"}},{"node":{"content":"<p>Hi Tetchi</p>\n<p>Thanks so much for this tutorial, is a huge help! I was wondering (and maybe this is out of your remit!) but if I wanted to only have the product variants appear if I add one how would that work or dose there always have to be one variant present?</p>\n<p>Thanks again man!</p>\n<p>Rory</p>\n"}},{"node":{"content":"<p>Tetchi, many thanks. I used it on <a href=\"http://www.pokloni-zdravje.si\" rel=\"nofollow\">http://www.pokloni-zdravje.si</a> and it works.</p>\n"}},{"node":{"content":"<p>Never mind, figured it out!</p>\n"}},{"node":{"content":"<p>I followed all your code, but when I checkout it is not adding the &#8220;donation&#8221; price to the $0.01.</p>\n<p>Any thoughts?</p>\n<p>By the way, this is a great fix!</p>\n"}},{"node":{"content":"<p>I am trying to make it so that when you click on an image within a table on a page the alt text shows up as a caption on the expanded image. I&#8217;ve followed these instructions but the captions are still not showing up. I can see the caption setting in the theme settings but nothing on the pages.</p>\n<p>I am not a web developer and I am in a bit over my head.</p>\n<p>Any help is much appreciated.</p>\n<p>Thanks,<br />\nCasey</p>\n"}},{"node":{"content":"<p>Hi, I&#8217;m a complete newbie. I&#8217;m really struggling to understand this whole liquid coding. I already have a html 5 theme that I want to use, but I have to get it into liquid coding first :/. I&#8217;m so confused as to where I even begin :?. Can someone help me out please? Can I email you it or can I get major pointers?</p>\n"}},{"node":{"content":"<p>Also when a user goes back to his store the Cart has the number of products entered&#8230; is there anyone that has done a script to simply automatically remove this from the cart when you return to the store? Assumption is that if someone returns to the store they are changing something so should also change their tip</p>\n"}},{"node":{"content":"<p>This is great!<br />\nAny ideas on how to manage the cart in case the user hits return to store within checkout?</p>\n"}},{"node":{"content":"<p>Hi &#8211; I am wondering if you have any updates on the align left/right and the captions.  Same thing &#8211; it works great if the images are centered on the page.</p>\n<p>Thanks,<br />\nAllison</p>\n"}},{"node":{"content":"<p>Hi tetchi.</p>\n<p>In my store I have used your script for four linked lists,<br />\nI have repeated all the steps four time for all the four lists (like created four &#8220;page.liquid&#8221; file and created four &#8220;order-form-script&#8221; snippets)&#8230;<br />\nIts working fine now but the problem is it is taking double the quantity to cart page after I click Add button, for example if i put 3 in quantity box it is showing 6 in cart page after I click add button..<br />\nHere is the link to my store:<br />\n<a href=\"http://www.manifestdestiny.in/pages/stack-em\" rel=\"nofollow\">http://www.manifestdestiny.in/pages/stack-em</a></p>\n"}},{"node":{"content":"<p>@Tim &#8211; sorry for the late response! This is actually being caused by a bug in Shopify where {{ form.errors }} is not being output properly. I will let you know once it&#8217;s fixed!</p>\n"}},{"node":{"content":"<p>Hi,</p>\n<p>Do you have a tutorial on sorting the collection based on newest to oldest? Currently shopify sort them based on created date. Is it possible to sort them based on published date instead?</p>\n<p>Thanks.</p>\n"}},{"node":{"content":"<p>Hi,</p>\n<p>One of the Shopify Expert (I think) managed to fixed it. There&#8217;s was a bug for the theme that i&#8217;m using. Anyway, can i trouble you to help me take a look at my page navigation? It seems like the spacing between the page no. are not the same.</p>\n<p>1   2    3  Next &gt;<br />\n&#8211; When it is at page 1, the spacing between Page no. 2 &amp; Page no. 3 are more<br />\n&#8211; When i&#8217;m at page 2, the spacing seems to be fine.<br />\n&#8211; But problem came back when i&#8217;m at Page 3.</p>\n<p>I tried checking the codes but couldn&#8217;t figure the issue, thus can i trouble you to help me take a look?</p>\n<p>Thanks!</p>\n"}},{"node":{"content":"<p>Hi Gwen, do you have a screenshot that you can show me? What is the URL of the shop you&#8217;re working on?</p>\n"}},{"node":{"content":"<p>Hey tetchi, this tutorial series has been a fantastic help to me.  Thanks so much!</p>\n<p>I&#8217;m having a problem with this section.  Basically, on your forgot your password form, if you submit an email address that isn&#8217;t in the database, it should show an error.  However, after hitting the submit button, the regular login form displays again with no message indicating that the email address is invalid.  Only after clicking &#8220;forgot your password&#8221; again do you see the error.</p>\n<p>I was pulling my hair out trying to figure out what I did wrong, but I notice the same behavior in your demo shop.  Is there a way we can have it so if the email address entered in the forgot your password box is not in the database, the page will reload with the forgot your password form shown by default?  Or at the very least, can we have the error message appear on the regular login form so the user isn&#8217;t completely in the dark?</p>\n<p>Thanks again for this great tutorial series.</p>\n"}},{"node":{"content":"<p>Hi&#8230;what a awesome find&#8230;I&#8217;ve been looking for a solution to adding gratuities to my lunch catering business.  I successfully followed everything but ran into the same issue as others above&#8230;the amount I entered in the field wouldn&#8217;t update or &#8220;stick&#8221;.    I think you mentioned that the link in the gist was to an old version&#8230;is the tutorial updated with the new?   I am VERY novice so I am just following your instructions kind of blindly!  </p>\n<p>Any help would be SO appreciated.</p>\n"}},{"node":{"content":"<p>I created a &#8220;donation&#8221; SKU in our store <a href=\"http://shopsantaclarasporting.myshopify.com/collections/goals-for-a-cure-collection/products/goals-for-a-cure-donation\" rel=\"nofollow\">http://shopsantaclarasporting.myshopify.com/collections/goals-for-a-cure-collection/products/goals-for-a-cure-donation</a> and it works!</p>\n<p>Thanks,<br />\nGabe</p>\n"}},{"node":{"content":"<p>Hi,</p>\n<p>I was having some problem with the country drop down box for &#8220;Add new address&#8221; &amp; Edit Address&#8221;.</p>\n<p>The drop down box was been cut off. I checked your code with mine but there&#8217;s no difference.</p>\n<p>Thus, can i trouble you to help me take a look or give me some advice?</p>\n<p>Thanks!</p>\n"}},{"node":{"content":"<p>Hi Tetchi</p>\n<p>Thank you for the amazing blog!  🙂 Can you help me with customizing the form?  Please feel free to email me.</p>\n"}},{"node":{"content":"<p>Thanks alot for this information!</p>\n"}},{"node":{"content":"<p>Where are you seeing the error? Do you have a screenshot or link you can send me?</p>\n"}},{"node":{"content":"<p>Hi,<br />\nI kind of follow your instructions through and through and still got an error,<br />\nLiquid error: Expected collection handle (String) but got NilClass.<br />\nAny idea how to fix that?<br />\nThanks.</p>\n"}},{"node":{"content":"<p>Hmm Audee, I&#8217;ll look into the error as I&#8217;m not too sure what could be causing that off the top of my head.</p>\n<p>Here is a download link to the completed Basic Theme: <a href=\"https://www.tetchi.ca/wp-content/uploads/2013/09/basic-theme.zip\" rel=\"nofollow\">https://www.tetchi.ca/wp-content/uploads/2013/09/basic-theme.zip</a> &#8211; hope it helps!</p>\n<p>&#8211; tetchi</p>\n"}},{"node":{"content":"<p>It directed me to this page (see the screenshot pls): <a href=\"https://dl.dropboxusercontent.com/u/2920298/shopify.jpg\" rel=\"nofollow\">https://dl.dropboxusercontent.com/u/2920298/shopify.jpg</a></p>\n<p>The same thing would also happen if I logged in via this link: <a href=\"https://www.shopify.com/login\" rel=\"nofollow\">https://www.shopify.com/login</a></p>\n<p>Then I am thinking that maybe it&#8217;s because I actually registered to Shopify based on Shopify Partner Program invitation? </p>\n<p>If you can send out your basic theme file, that would be nice 🙂<br />\nI&#8217;ve checked the skeleton theme before.<br />\nThank you very much for the help!</p>\n<p>~ A u d e e</p>\n"}},{"node":{"content":"<p>Hey Audee!</p>\n<p>Oh, that&#8217;s strange, I am not too sure why you are unable to download those; are you seeing any error messages? If so what is the error message?</p>\n<p>In the meantime, I can send you over the ZIP files for the basic theme that I&#8217;ve created. You can also check out Caro&#8217;s awesome &#8216;skeleton&#8217; theme: <a href=\"https://github.com/Shopify/skeleton-theme/archive/master.zip\" rel=\"nofollow\">https://github.com/Shopify/skeleton-theme/archive/master.zip</a> 🙂</p>\n<p>tetchi</p>\n"}},{"node":{"content":"<p>Herro Tetchi 🙂</p>\n<p>First of all, I&#8217;m really thankful as you wrote series of detailed tutorials. I&#8217;ve subscribed to your blog especially for the shopify tag 😉</p>\n<p>I wonder if you have a free Shopify theme that you can share? as I tried to download from this page: <a href=\"http://themes.shopify.com/#price=free\" rel=\"nofollow\">http://themes.shopify.com/#price=free</a> but always failed using my new account.<br />\nI think beside reading many tutorials, it will be nice to actually see the whole codes inside a ready stylized and customized theme instead of just a blank theme skeleton. </p>\n<p>Or you have some more tips regarding to the download problem?</p>\n<p>Thank you in advance and cheers ^_^</p>\n"}},{"node":{"content":"<p>Your tutorials are always very helpful! Thanks for taking the time to be clear, so technophobes like us can feel proud of ourselves! Lol!<br />\nFran</p>\n"}},{"node":{"content":"<p>@Shawn Not really, no. Shopify wasn&#8217;t really built for that kind of system, so I don&#8217;t think I&#8217;ll be working on a tutorial for that any time soon.</p>\n"}},{"node":{"content":"<p>You should do a tutorial about how to make  a Groupon like website </p>\n<p>Any plans for that?</p>\n<p>Cheers</p>\n"}},{"node":{"content":"<p>LOL Mark 😀</p>\n<p>A print version would be frikkin sweet for sure! Would absolutely love to get on that</p>\n"}},{"node":{"content":"<p>This is the most comprehensive tutorial I&#8217;ve seen to date! Well done Tets. Start working on the print version next 😉</p>\n"}},{"node":{"content":"<p>How do I make add to cart?</p>\n"}},{"node":{"content":"<p>Works beautifully!!! Thank you for this quick and straightforward tutorial. Very much appreciated.</p>\n"}},{"node":{"content":"<p>@Gaurav thanks buddy! 😀</p>\n"}},{"node":{"content":"<p>Superb work Tets!</p>\n"}},{"node":{"content":"<p>Very helpful post! Thanks.</p>\n"}},{"node":{"content":"<p>Hah, sorry, forgot I&#8217;ve asked the question already. You can delete it 😉</p>\n"}},{"node":{"content":"<p>Hello, me again :). I was just wondering recently &#8211; do you need to link to option_selection.js, shopify_common.js and customer_area.js files, and if yes, what does each of it do?</p>\n"}},{"node":{"content":"<p>Thanks so much for reading Darjan! I&#8217;m still working on the 14th part &#8211; the code itself is not hard but I&#8217;m just trying to figure out the best and easiest way to present everything. I&#8217;m aiming to finish by the end of this week. </p>\n<p>Cheers!</p>\n"}},{"node":{"content":"<p>Hey,<br />\nany news on the 14th part of the tutorial? I just did them all and i must say i&#8217;m really impressed with liquid and the whole Shopify thing. It&#8217;s really easy and powerful. I mostly ran wordpress and after that Magento, but all the problems with settings them up and making updates etc. was a real pain.</p>\n<p>Thanks for the easy tutorials 🙂</p>\n"}},{"node":{"content":"<p>Hey Kas, yep that is totally fine. option_selection.js, shopify_common.js, and<br />\ncustomer_area.js are stored on Shopify&#8217;s servers, and the jQuery script is stored on Google&#8217;s servers, so they don&#8217;t need to be added to the theme assets. 🙂</p>\n"}},{"node":{"content":"<p>Me again ;). I&#8217;ve got a question about the javascript files. We&#8217;ve added them, but they are not in the assets folder. Is it how it&#8217;s supposed to be?</p>\n"}},{"node":{"content":"<p>Hi Tetchi,</p>\n<p>Sorted out the problems mentioned above.</p>\n<p>But now looking into the following issues:<br />\n1. I need a temp total quantity at the bottom of the form. Showing how many items have been selected. tried using regular javascript but seems like I need some liquid to do this&#8230;</p>\n<p>cheers</p>\n"}},{"node":{"content":"<p>Awesome! I&#8217;ve been a little caught up with stuff and haven&#8217;t had time to finish the last one, I&#8217;m going to get it done ASAP! Cheers Kas.</p>\n"}},{"node":{"content":"<p>Thanks, i&#8217;ve just finished the whole tutorial and so far so good ;). Just waiting for the last part now!</p>\n"}},{"node":{"content":"<p>hey no worries Kas! Let me know if you run into something again.</p>\n"}},{"node":{"content":"<p>Hi Tetchi,<br />\nI have included the code in my website. It seems to work very well, but I have two little quetions here:<br />\n1. How can I manage to have the checkbox aligned to the right, just on top of the actual button (as on your example)? It always aligns to the left and there it seems a bit lost.<br />\n2. I did not understand how to create the link to my &#8220;Terms &amp; Conditions&#8221; page.<br />\nI would be greatful for help here.<br />\nOtherwise, great great tutorial! Thanks so much.<br />\nJohannes</p>\n"}},{"node":{"content":"<p>Oh yes, sorry. I don&#8217;t know why but I assumed straight away that it only shows the test PAGE, not a variant. Thank you! And sorry again</p>\n"}},{"node":{"content":"<p>That looks correct to me Kas &#8211; have a look at the variants of that product: <a href=\"http://take.ms/P7gQQv\" rel=\"nofollow\">http://take.ms/P7gQQv</a>. The options in the dropdowns look like they match with what&#8217;s shown in the admin page for that product. Let me know if you still need a hand.</p>\n"}},{"node":{"content":"<p>That is weird, because I get this: <a href=\"http://imageshack.com/scaled/large/9/it2w.png\" rel=\"nofollow\">http://imageshack.com/scaled/large/9/it2w.png</a><br />\n<a href=\"http://imageshack.com/scaled/large/855/pqqt.png\" rel=\"nofollow\">http://imageshack.com/scaled/large/855/pqqt.png</a></p>\n"}},{"node":{"content":"<p>I took a look at your product template (ex: <a href=\"http://cassia-test-shop.myshopify.com/collections/frontpage/products/awesome-sneakers\" rel=\"nofollow\">http://cassia-test-shop.myshopify.com/collections/frontpage/products/awesome-sneakers</a>) and it appears to be working fine. Selecting the different options changes the price and availability properly.</p>\n"}},{"node":{"content":"<p><a href=\"http://cassia-test-shop.myshopify.com/\" rel=\"nofollow\">http://cassia-test-shop.myshopify.com/</a></p>\n"}},{"node":{"content":"<p>Hey Kas, what&#8217;s the URL of the shop you&#8217;re working on?</p>\n"}},{"node":{"content":"<p>Heyah!<br />\nQuick question. I copied and pasted the JavaScript code as it was, without changing anything, and I think there is something wrong with it. It shows different variants as you can see on the screenshot you included in the post, but when I want to check what Size variants or Title variants are available, it just shows me &#8220;test&#8221;, not the actual variants (I hope this explanation makes sense 😉 ). Any ideas why it is happening? Again &#8211; I just copied and pasted the script, as I don&#8217;t know JavaScript, and didn&#8217;t change a thing.</p>\n"}},{"node":{"content":"<p>Hi Tetchi,</p>\n<p>First up &#8211; I would like to thank you very much for this tutorial &#8211; really helped out.</p>\n<p>Im currently using the above method to make a online paint shop. I would like to make the Quantity column into drop down menus &#8211; is this possible??<br />\nAlso it seems to be taking a considerable amount of time after clicking &#8216;add to cart&#8217; to go to shopping cart&#8230; I got 52 products (paint colours) that I am listing. Is there any way of making this process quicker (it is taking on average 20-30sec).</p>\n<p>much appreciated</p>\n"}},{"node":{"content":"<p>Hi Tetchi. No problems, here&#8217;s some more info.</p>\n<p>My theme so far (collections page): <a href=\"https://mortar-and-pestle.myshopify.com/collections\" rel=\"nofollow\">https://mortar-and-pestle.myshopify.com/collections</a><br />\nlist-collections.liquid file: <a href=\"https://github.com/stephsharp/shopify-tutorial-tetchi/blob/broken-pagination/templates/list-collections.liquid\" rel=\"nofollow\">https://github.com/stephsharp/shopify-tutorial-tetchi/blob/broken-pagination/templates/list-collections.liquid</a></p>\n<p>The way it is currently, there are 2 pages of collections that both display the same 4 collections. I am fairly sure this is because I am using</p>\n<p>{% paginate collections by 4 %}</p>\n<p>which returns 5 collections (the 4 displayed + frontpage), so there are 2 pages.</p>\n<p>What I really want is something like this:</p>\n<p>{% assign collection_links = linklists.featured-collections.links %}<br />\n{% paginate collection_links by 4 %}</p>\n<p>But that gives me the error:</p>\n<p>Liquid error: Array &#8216;collection_links&#8217; is not paginateable.</p>\n<p>Is it possible to paginate a link list, and if so, how?</p>\n<p>Thanks for your help 🙂<br />\nStephanie</p>\n"}},{"node":{"content":"<p>Hey Stephanie, it&#8217;s a little hard to troubleshoot without being able to see your work, but if you can post a link to your shop I can take a look.</p>\n"}},{"node":{"content":"<p>I used the code snippet you suggested to load collections using a link list, and it works fine except it breaks the pagination. Is there any way to get pagination working with the link list approach?</p>\n"}},{"node":{"content":"<p>Cheers Abdus &#8211; thanks for reading 🙂</p>\n"}},{"node":{"content":"<p>Thanks for great tutorials. These are helping me a lot 🙂</p>\n"}},{"node":{"content":"<p>Trying to do something similar to this &#8211; but NOT related to checkout. The textbooks for our college store are outsourced, and so we don&#8217;t list them in our Shopify store. Instead, we link out to our outsourced vendor&#8217;s affiliate page. We&#8217;d like to present a page in Shopify with some standard disclaimer text, require the customer to check a box that they understand, and then have the button/link take them to the other site. Suggestions?</p>\n"}},{"node":{"content":"<p>@H Thanks for the feedback. Looks like there aren&#8217;t too many other resources out there for this. </p>\n<p>As soon as I&#8217;m finished with the Shopify Theme from Scratch series, I&#8217;ll do a re-write of this article with better examples.</p>\n"}},{"node":{"content":"<p>Also bummed that this doesn&#8217;t work anymore. This is the only tutorial I found which shows shopify users how to do something like this, which is stranger because it&#8217;s a pretty common functionality.</p>\n"}},{"node":{"content":"<p>Thank man, might be quote old but still really useful! I&#8217;m using this tutorial to create my own character in a psp game (dissidia 012).</p>\n"}},{"node":{"content":"<p>Sorry Jody, I&#8217;ve never used BigCommerce before and I don&#8217;t plan to, so I won&#8217;t be able to help you there!</p>\n"}},{"node":{"content":"<p>TETCHI,<br />\nThanks, this worked great on my shopify shop&#8230; I need to do the same thing in Bigcommerce, for my father&#8217;s shop PJSIGNS.com<br />\nCould you pull it off?<br />\nThanks,<br />\nJody</p>\n"}},{"node":{"content":"<p>@Jim you most definitely can! The line item object contains the Product object as well, do you can use the &#8220;image&#8221; variable there. Ex:</p>\n<p>{% for line_item in order.line_items %}<br />\n     {{ line_item.product.image | product_img_url: &#8220;medium&#8221; | img_tag }}<br />\n{% endfor %}</p>\n"}},{"node":{"content":"<p>Hey thanks for the tutorial!</p>\n<p>I&#8217;m curious to know if there&#8217;s any way to call the featured image of a line item from the order.liquid page?  It doesn&#8217;t look like it&#8217;s possible with the line_item variable based on what&#8217;s shown on the documentation, thanks.</p>\n"}},{"node":{"content":"<p>Hey Are, sorry man I&#8217;m not sure if I understand your question.</p>\n"}},{"node":{"content":"<p>Hi, I&#8217;m working now on article.liquid, i&#8217;m  trying to change the way how the images and the text of the article are shown, Like a grid of the images and all the text of the article aligned to de right. I just can&#8217;t access to the images, for putting a css on . Or this just can be made at the moment when you are making the post? Thanks!</p>\n"}},{"node":{"content":"<p>Hi Tetsuro! Thank you for your helpful tutorials!</p>\n<p>I&#8217;ve been putting together a Shopify theme based on your &#8220;from scratch&#8221; tutorial series, and am trying to also utilize the sort-by-type technique from this entry. I&#8217;ve posted both pieces of code in what I think are the correct locations, and the dropdown is appearing, but search results are not being correctly limited. Any idea what the problem might be?</p>\n<p>Also, I&#8217;m unsure what you mean by &#8220;should be placed close to &lt;form&amp;rt;&quot; &#8212; I don&#039;t see this anywhere.</p>\n<p>Thank you so much for your help!</p>\n"}},{"node":{"content":"<p>Hi</p>\n<p>I am having the same problem as some of the others (when I add a value into the donation box and press update/checkout the donation is not added and the $ amount disappears).</p>\n<p>I&#8217;m wondering if it is because we use PayPal as the payment method and when the buyer clicks on Checkout button it takes them straight to PayPal rather than the interim Shopify page? </p>\n<p>Thanks<br />\nJames</p>\n"}},{"node":{"content":"<p>ok I still need help with the code on my page. I have tired putting the terms and conditions in several spots in the cart code and it shows up when the customer removes and item from the cart instead of before they can add one. my page is <a href=\"http://www.wholesale-furniture-co.myshopify.com\" rel=\"nofollow\">http://www.wholesale-furniture-co.myshopify.com</a> can someone please help.</p>\n"}},{"node":{"content":"<p>Hey Adi, check out the first part of this post &#8211; you can get to this page by going to <em>your-shop-url-here</em>.myshopify.com/collections</p>\n"}},{"node":{"content":"<p>From where i see my collection, means what is the url to see this collection page?</p>\n"}},{"node":{"content":"<p>My pleasure Cheryll 🙂</p>\n"}},{"node":{"content":"<p>Perfect! Thank You!  That worked beautifully!</p>\n"}},{"node":{"content":"<p>@Cheryll Looks like you have it set to &#8220;Accounts are required&#8221;. The register link will only be shown when you have it set to &#8220;Accounts are optional&#8221;. The code assumes that if you have it set to &#8220;Accounts are required&#8221;, you don&#8217;t want customers to create an account for themselves. </p>\n<p>If you&#8217;d like to make the Register form link appear regardless, use this code instead: <a href=\"http://pastie.org/pastes/8167599/text\" rel=\"nofollow\">http://pastie.org/pastes/8167599/text</a></p>\n"}},{"node":{"content":"<p>I can&#8217;t get this to work, but it&#8217;s exactly what I need! Any ideas?</p>\n"}},{"node":{"content":"<p>Hey Cheryll, I&#8217;ll get back to you tomorrow on this, I think I know the issue. I&#8217;m just on the road now so I can&#8217;t troubleshoot right away.</p>\n"}},{"node":{"content":"<p>Yes I have.</p>\n"}},{"node":{"content":"<p>No worries Kyle 🙂 Cheers!</p>\n"}},{"node":{"content":"<p>My goodness! What was I on when I did that?<br />\nThanks for the help tetchi, I appreciate it.</p>\n"}},{"node":{"content":"<p>@Cheryll Have you enabled customer accounts, as outlined in Part 11?</p>\n"}},{"node":{"content":"<p>I am having trouble with the create an account link.  I have copied and pasted and followed the directions but I seem to have missed something because it is not showing up.  </p>\n<p>Any ideas?</p>\n<p>Thanks in advance!</p>\n"}},{"node":{"content":"<p>@Kyle you&#8217;re loading jQuery after the script for selectCallback. The script tag that loads jQuery needs to go in the &lt;head&gt; section, not at the bottom of the theme. See Step 2 of <a href=\"https://www.tetchi.ca/shopify-theme-from-scratch-part-1/\" rel=\"nofollow\">Part 1</a>.</p>\n"}},{"node":{"content":"<p>Right here: <a href=\"http://kyle-test.myshopify.com/\" rel=\"nofollow\">http://kyle-test.myshopify.com/</a></p>\n"}},{"node":{"content":"<p>@Kyle That&#8217;s strange&#8230; would you happen to have the URL of your shop handy?</p>\n"}},{"node":{"content":"<p>Great tutorials man. I&#8217;m just having one issue right now.<br />\nWhen attempting step 5: &#8220;Plug in selectCallback&#8221;, it doesn&#8217;t split up the variants in the desired way. It seems like selectCallback isn&#8217;t being called in the mark up.</p>\n"}},{"node":{"content":"<p>Further to the above &#8230; I have a work around, which is basically putting the label info that I want to show (including a link) right after a dummy label which doesn’t show up as far as I have tried on Safari (Mac and iPad) or Firefox, but may do on another browser one day.</p>\n<p>I have substituted the html brackets for normal ones () in the hope it shows the code here:</p>\n<p>(input type=&#8221;checkbox&#8221; name=“agree&#8221; id=&#8221;agree” /)<br />\n(label for=“agree”) *Yes,(/label) I agree with the (a href=pages/terms-and-conditions target=“_blank”)Terms and Conditions(/a)</p>\n<p>Which on my site just shows the checkbox, followed by:<br />\nI agree with the <a href=\"pages/terms-and-conditions\" rel=\"nofollow\">Terms and Conditions</a></p>\n<p>Thanks again Tetchi, perhaps this will be useful for anyone else who has the same ‘no label showing’ issue I have had.</p>\n"}},{"node":{"content":"<p>Hi Tetchi</p>\n<p>This is exactly what I need for an ‘about-to-go-live’ Shopify store.  However, the checkbox appears but with no label text showing (I haven’t altered yours, just copied pasted).</p>\n<p>As a total newbie, perhaps I don’t know something obvious to most?  The checkbox appears in the place I want it, but is a box with no text next to it!!</p>\n<p>I haven’t put the final bit of code in the theme.liquid page yet as I guess I should get this bit right first!</p>\n<p>Thanks for any help.  It’s great to find this sort of thing so easily, excellent resource.<br />\nPhil</p>\n"}},{"node":{"content":"<p>Hi Fran,<br />\nIt won&#8217;t let me type out the code.  It keeps just highlighting terms and conditions.  You can email me at <a href=\"mailto:info@housekeepingstore.co.uk\">info@housekeepingstore.co.uk</a> and I&#8217;ll mail you back.</p>\n"}},{"node":{"content":"<p>Sorry Fran,<br />\nTried to answer you late last night and pasted in what I had put on mine, didn&#8217;t work, so here is the code I put in mine and it worked after that.  I did type some of it manually and didn&#8217;t paste it in.</p>\n<p>I agree with the<a href=\"/pages/terms-conditions\" rel=\"nofollow\">Terms and Conditions</a></p>\n<p>You have to put in your handle though for your terms and conditions page, mines is  terms-conditions you can see that I&#8217;ve put it after pages/.  Hope this works, I&#8217;m no expert and I have typed it out so hopefully I&#8217;ve not missed anything small.</p>\n<p>Good luck<br />\nLisa X</p>\n"}},{"node":{"content":"<p>Hi Fran,</p>\n<p>Thanks for your response. What I actually mean is, how did you make the &#8220;terms and conditions&#8221; bit hyperlink back to your t&amp;c page?</p>\n<p>Many thanks<br />\nFran</p>\n"}},{"node":{"content":"<p>Hi Fran,</p>\n<p>This is what I put in,</p>\n<p>      I agree with the<a href=\"/pages/terms-conditions\" rel=\"nofollow\">Terms and Conditions</a></p>\n<p>Hope this helps,<br />\nLisa</p>\n"}},{"node":{"content":"<p>Thank you Tetchi!</p>\n"}},{"node":{"content":"<p>Sorry folks. I was linking to an old version of the gist this whole time. I&#8217;ve gone ahead and updated that so the script is more fool-proof.</p>\n"}},{"node":{"content":"<p>Jamie, thank you very much for your help. It is huge for us to be able to get donations this way.</p>\n<p>A thousand thank yous!</p>\n"}},{"node":{"content":"<p>@Bruno, I fixed your shop for you and I have a recommend for the gist in the tut to make this less of an issue in the future.</p>\n"}},{"node":{"content":"<p>Ok here is a link to a screen shot I took of my code. Maybe you guys can help by seeing the code in the photo</p>\n<p><a href=\"http://applied-graphics.net/images/shopify%20cart%20code.jpg\" rel=\"nofollow\">http://applied-graphics.net/images/shopify%20cart%20code.jpg</a></p>\n"}},{"node":{"content":"<p>@Owen ah, I wrote this tutorial 3 years ago and I&#8217;ve since updated the &#8220;Terms and Conditions&#8221; one to auto-include jQuery. When I get a chance I&#8217;ll do the same with this one.</p>\n"}},{"node":{"content":"<p>Just curious&#8230;. is step one linking to another tutorial the correct link?  Doesn&#8217;t seem relevant to making sure jQuery is installed.</p>\n<p>I wasn&#8217;t able to get this working yet, will try again later.  I tried a method from a different tutorial and also got a status 400 error.</p>\n"}},{"node":{"content":"<p>Tetchi,</p>\n<p>BTW this is the best tutorial yet on shopify. Kudos!!!</p>\n<p>Fran</p>\n"}},{"node":{"content":"<p>Hi Lisa,</p>\n<p>How did you manually resolve the problem of linking the T &amp; c to a page? i had the &#8216;404&#8217; issues as well.</p>\n<p>thanks Fran</p>\n"}},{"node":{"content":"<p>Hi Tetchi,</p>\n<p>I am having the same problem as Kittypie, Kerry Lowes and Kristina (when I add a value into the donation box and press update/checkout the donation is not added and the $ amount dissapears).</p>\n<p>Did you find a resolution for this? My store is: <a href=\"http://mobia-bookstore.myshopify.com/\" rel=\"nofollow\">http://mobia-bookstore.myshopify.com/</a></p>\n<p>Thanks!</p>\n"}},{"node":{"content":"<p>Thanks for catching those Ben, I&#8217;ll make those amendments when I get a chance!</p>\n"}},{"node":{"content":"<p>$345 roundtrip? That&#8217;s a bargain and a half! Sounds like a wicked trip 🙂</p>\n"}},{"node":{"content":"<p>Yeah it was great, flew there for $345 roundtrip on Korean Air from SFO at apparently the best time of the year, March 20th-April 8th, got to see hanami and everything 😀</p>\n"}},{"node":{"content":"<p>@Ben that&#8217;s wicked! How long were you there for? I definitely want to check out Hiroshima next time I&#8217;m there.</p>\n"}},{"node":{"content":"<p>@Christo Woo! Part 10 is good to go now 🙂</p>\n"}},{"node":{"content":"<p>Yay!</p>\n"}},{"node":{"content":"<p>@Shawn Thanks! I was actually thinking of doing a tutorial that uses jQuery UI to drag and drop products to the cart, but I don&#8217;t think I&#8217;ll be able to work on it until I&#8217;m finished this tutorial series unfortunately!</p>\n"}},{"node":{"content":"<p>Hi,</p>\n<p>I am not sure what I am doing wrong but I keep getting a &#8220;Failed to load resource: the server responded with a status of 400 (Bad Request) &#8220;.</p>\n<p>Any advice?</p>\n"}},{"node":{"content":"<p>Hi tetchi</p>\n<p>Your Tutorials are great.</p>\n<p>Is there any chance you can do a tutorial on how to integrate Jquery UIs and plugin with Shopify?</p>\n"}},{"node":{"content":"<p>@Bernardo I&#8217;m told the fix is really close to being deployed. Thanks for your patience!</p>\n"}},{"node":{"content":"<p>I hope this is resolved soon. I just started lesson one 🙂</p>\n"}},{"node":{"content":"<p>Also, according to <a href=\"http://wiki.shopify.com/Product_img_url\" rel=\"nofollow\">http://wiki.shopify.com/Product_img_url</a>, it seems like using product_img_url: &#8216;original&#8217; is depreciated. What&#8217;s the right way to get the original image size?</p>\n"}},{"node":{"content":"<p>This makes up for the fact that there is still no continuation to the tutorial. Just had my first trip out to Japan in March/April, did an epic trip with friends on the JR Rail Pass all around Tokyo/Osaka/Kyoto/Hiroshima/Miyajima. Definitely my favorite place in the world after SF.</p>\n"}},{"node":{"content":"<p>That did not work either. Shoot!</p>\n"}},{"node":{"content":"<p>Ok here is my cart.liquid where would I paste the submit cart and div?</p>\n<p>    Shopping Cart</p>\n<p>  {% if cart.items == empty %}<br />\n    Your shopping cart is empty. Check out our <a href=\"/collections/all\" rel=\"nofollow\">catalog</a> to see what&#8217;s available.</p>\n<p>  {% else %}</p>\n<p>            &nbsp;<br />\n            Item<br />\n            Price<br />\n            Quantity<br />\n            Total<br />\n            &nbsp;</p>\n<p>          {% for item in cart.items %}</p>\n<p>              <a href=\"{{ item.product.url }}\" rel=\"nofollow\"></p>\n<p>              </a></p>\n<p>              <a href=\"{{ item.product.url }}\" rel=\"nofollow\">{{ item.title }}</a><br />\n              {% for p in item.properties %}<br />\n                {% unless p.last == blank %}<br />\n                  {{ p.first }}:<br />\n                  {% if p.last contains &#8216;/uploads/&#8217; %}<br />\n                  <a href=\"{{ p.last }}\" rel=\"nofollow\">{{ p.last | split: &#8216;/&#8217; | last }}</a><br />\n                  {% else %}<br />\n                  {{ p.last }}<br />\n                  {% endif %}</p>\n<p>                {% endunless %}<br />\n              {% endfor %}</p>\n<p>            {{ item.price | money }}</p>\n<p>            {{ item.line_price | money }}<br />\n            <a href=\"/cart/change?line={{ forloop.index }}&amp;quantity=0\" rel=\"nofollow\">Remove</a></p>\n<p>          {% endfor %}</p>\n<p>            {{ cart.total_price | money }}<br />\n            &nbsp;</p>\n<p>      {% if settings.allow_note %}</p>\n<p>        <a href=\"#\" rel=\"nofollow\">Add a note for the seller&hellip;</a><br />\n        {{ cart.note }}</p>\n<p>      {% endif %}</p>\n<p>        {% if additional_checkout_buttons %}</p>\n<p>          Or check out using:<br />\n         {{ content_for_additional_checkout_buttons }}</p>\n<p>        {% endif %}                       </p>\n<p>  {% endif %}</p>\n<p><!--/#col-main --></p>\n"}},{"node":{"content":"<p>It doesn&#8217;t looks like you can type in HTML here. Try using Pastie (<a href=\"http://pastie.org/\" rel=\"nofollow\">http://pastie.org/</a>) and link to your code snippet through that (I&#8217;ll see how I can enable HTML in comments when I get a chance).</p>\n"}},{"node":{"content":"<p>These two</p>\n<p>div class=&#8221;submit-cart&#8221;<br />\n/div</p>\n"}},{"node":{"content":"<p>I dont understand why I cant add the code to this post to show you guys? Every time I post the code disappears?</p>\n"}},{"node":{"content":"<p>The code still isnt showing up. Let me try this again:</p>\n<p>(I am trying to add this to my shopify website with the radiance theme. My code is a little different on the cart.liquid page and I cannot for the life of me figure out where to put: </p>\n<p>Everywhere I seem to place it will not let me add: </p>\n<p>Customers can check out without having to check the box and no popup comes up. Please help I would love to add this to my website.)</p>\n"}},{"node":{"content":"<p>Sorry that does not help. My last post should have read like this. I dont know why the code didnt show up:</p>\n<p>(I am trying to add this to my shopify website with the radiance theme. My code is a little different on the cart.liquid page and I cannot for the life of me figure out where to put:</p>\n<p>Everywhere I seem to place it will not let me add:</p>\n<p>Customers can check out without having to check the box and no popup comes up. Please help I would love to add this to my website.)</p>\n"}},{"node":{"content":"<p>Hi,</p>\n<p>I put mine in between cart subtotal and estimated shipping.  Hope this is of some help.</p>\n<p>Regards,<br />\nLisa</p>\n"}},{"node":{"content":"<p>I am trying to add this to my shopify website with the radiance theme. My code is a little different on the cart.liquid page and I cannot for the life of me figure out where to put:</p>\n<p>Everywhere I seem to place it will not let me add:</p>\n<p>Customers can check out without having to check the box and no popup comes up. Please help I would love to add this to my website.</p>\n"}},{"node":{"content":"<p>Thanks Ben, hoping to get back into action asap!</p>\n"}},{"node":{"content":"<p>Hi,  Thanks for all your help, managed to do it by keeping the original paste and adding the link manually.  Works now, thank you so much!!!!</p>\n<p>Lisa</p>\n"}},{"node":{"content":"<p>THE CAT DOESN&#8217;T MAKE ANYTHING BETTER</p>\n<p>Just kidding. Great work so far, hope issues are resolved soon 🙂</p>\n"}},{"node":{"content":"<p>@Christo oh shucks, thanks so much for the kind words! Glad you like the tutorials!</p>\n"}},{"node":{"content":"<p>Dude! Thank you so much! It&#8217;s super fun to build this site and you write very well. You&#8217;re truly awesome</p>\n"}},{"node":{"content":"<p>Hey Lisa, the code I pasted should do that already &#8211; it simply contains a link to /pages/terms-and-conditions, where &#8216;terms-and-conditions&#8217; is the handle of your page.</p>\n"}},{"node":{"content":"<p>Hi, Sorry I&#8217;m being a pest now.  Here is the screenshot.<br />\n<a href=\"http://snag.gy/DNzVs.jpg\" rel=\"nofollow\">http://snag.gy/DNzVs.jpg</a></p>\n<p>What I would really like is in this screenshot I would like the terms and conditions to be highlighted and just be able to click on that to take you to my terms and conditions page.  Any chance????</p>\n<p><a href=\"http://snag.gy/O415P.jpg\" rel=\"nofollow\">http://snag.gy/O415P.jpg</a></p>\n<p>Thanks Lisa</p>\n<p>Oh still not working when I put my terms and conditions handle in.  Also the original code you sent me isn&#8217;t the same as in the blog.  When I wanted to put it back to how it was I copied and pasted the code from the last mail you sent me but it didn&#8217;t work so I had to go and copy it from the original blog.  Hope this makes sense.</p>\n"}},{"node":{"content":"<p>Hey Lisa, can you clarify what you mean by &#8220;coming up separately&#8221;? Do you have a screenshot you can show me? Also for the 404, make sure the handle of your T&#038;C page matches up with the handle in the code.</p>\n"}},{"node":{"content":"<p>Hi,</p>\n<p>Have tried that but the text and the box are coming up separately and even though I have put my handle in for my terms and conditions page it is bringing up 404 error.</p>\n<p>Please help, Thank you!</p>\n"}},{"node":{"content":"<p>That&#8217;s easy enough! Instead of this:</p>\n<p>&lt;input type=&#8221;checkbox&#8221; id=&#8221;agree&#8221;/&gt;<br />\n&lt;label for=&#8221;agree&#8221;>I agree with the Terms and Conditions&lt;/label&gt;</p>\n<p>do this:</p>\n<p>&lt;input type=&#8221;checkbox&#8221; id=&#8221;agree&#8221;/&gt;<br />\n&lt;label for=&#8221;agree&#8221;>I agree with the&lt;/label&gt;&lt;a href=&#8221;/pages/terms-and-conditions&#8221;&gt;Terms and Conditions&lt;/a&gt;</p>\n<p>&#8230; where &#8220;terms-and-conditions&#8221; is the handle of your T&#038;C page. </p>\n<p>Cheers 🙂</p>\n<p>tetchi</p>\n"}},{"node":{"content":"<p>Yes exactly that, so if they want to look at the terms and conditions, they can do so easily.<br />\nHope this makes sense.  </p>\n<p>Thanks for getting back so quickly.</p>\n"}},{"node":{"content":"<p>Hey Lisa! I&#8217;m glad I could help 🙂 </p>\n<p>> Now I am trying to link terms and conditions information to this button.</p>\n<p>By that, do you mean you&#8217;re trying to add a link to your T&#038;C page in the label for the checkbox (like this: <a href=\"http://take.ms/V4vSC\" rel=\"nofollow\">http://take.ms/V4vSC</a>)?</p>\n"}},{"node":{"content":"<p>Thank you so much for this tutorial managed to do it.  Struggled a bit when I placed the snippet in originally I put terms and conditions then I noticed the dashes in between.  Sorted!!!  Now I am trying to link terms and conditions information  to this button.  Any ideas would be great!<br />\nThank you so much I still don&#8217;t understand how you come up with compter codes.</p>\n"}},{"node":{"content":"<p>Hey Melissa, try looking for the closing  tag instead, and placing the ‘include’ right above it. So it’ll look like this:</p>\n<p>{% include ‘terms-and-conditions’ %}</p>\n"}},{"node":{"content":"<p>I can not get the last code to work in the theme.liquid can you please show me where in the script it should go. I got the first step down and that is there. I just need the other step to work.</p>\n"}},{"node":{"content":"<p>Works perfect &#8211; thank you very much for this.</p>\n"}},{"node":{"content":"<p>Hey thanks Rahul 😀 !!!</p>\n"}},{"node":{"content":"<p>You are awesome!!!</p>\n<p>Thanks a lot for these wonderful tutorials.</p>\n"}},{"node":{"content":"<p>Thanks so much for reading Jessica! I&#8217;m happy to hear it&#8217;s been helpful for you! 🙂</p>\n"}},{"node":{"content":"<p>Just have to say thank you for posting these tutorials. It&#8217;s been extremely helpful to see things being built step-by-step with easy to understand explanations. Will be following along as you add the remaining tutorials! Thank you!!!</p>\n"}},{"node":{"content":"<p>A Windows Editor would be nice, for sure. </p>\n<p>All core functionalities will be in the theme, i.e. customers will be able to browse through products, add products to the cart, make customer accounts, etc. through this basic theme.</p>\n"}},{"node":{"content":"<p>Woohoo! Finally caught up with you :). You really need to tell the devs to make a Desktop Editor for Windows&#8230;broke my mac and waiting for the new one to come out and I can only do the next best thing here, which is write all this up in Sublime and then copy and paste the entire file every time into Shopify.</p>\n<p>One question &#8211; if someone builds an entire theme from scratch through this tutorial (and up to this part), how comprehensive is it, exactly? What I mean by that is will all core functionality be covered to the extent that no links/options should break anywhere on a site?</p>\n"}},{"node":{"content":"<p>One super minor thing, but as per the product .csv uploaded way back when, this product is only showing 1 product image besides the featured image (just the Beatles cover, not the other three sneakers)</p>\n"}},{"node":{"content":"<p>@Ben Ah, I can see how that can be confusing! Thanks for catching that, I&#8217;ve changed it back to &#8220;style.css&#8221;. </p>\n<p>It&#8217;s not required to add a .liquid extension to stylesheets. It&#8217;s only necessary if you want to use Liquid for theme settings in your stylesheet (will be covered in later chapters :)). If you do have stylesheet with a .liquid extension, it will still be parsed as a regular stylesheet by theme.liquid.</p>\n"}},{"node":{"content":"<p>Ah weird so that&#8217;s intentional? There&#8217;s an autogenerated .css file that comes from a .css.liquid file? Does that hold true for any .css.liquid file?</p>\n"}},{"node":{"content":"<p>Hey tetchi,</p>\n<p>Great tutorial, I&#8217;m going through this to migrate a theme from WordPress and make sure I have all the basic functionality of Shopify covered.</p>\n<p>One thing on your zip file &#8211; in the assets directory, style.css is named &#8220;style.css.liquid&#8221; instead of &#8220;style.css&#8221;. Minor thing but might switch a few people up.</p>\n<p>Cheers,<br />\nBen</p>\n"}},{"node":{"content":"<p>If you could email me I can provide screen shots. But I can try to explain a little better. I followed the steps as you outlined and the captions appear. However, In your example the picture is centered and the caption appears below as it should. For me, I like to align my photos to the left and then wrap the text around the picture. When I do this, the caption to my picture appears above the above the page text instead of below the picture. The code for the incorrect page appears like this </p>\n<p>\t\t<!-- articleHeader --></p>\n<p>             Ok<br />\nladies&#8230;so not everyone has the privilege of having King Dong in their bedroom<br />\nnight after night.&nbsp; But that&#8217;s not<br />\nnecessarily a bad thing.&nbsp; For every guy that</p>\n<p>However if I do not wrap the text around the image the caption appears as it should. Also is there a way to decrease the space between the caption and the Picture?</p>\n"}},{"node":{"content":"<p>I&#8217;m not sure if I follow. Do you have an example you can show me?</p>\n"}},{"node":{"content":"<p>I notice this will only work when you do not wrap the text around the image. Otherwise it pushes you caption above the text. Any ideas on how to get around this. I really like the concept.</p>\n"}},{"node":{"content":"<p>@AJ No worries! Glad I could help. It was actually more of a syntax error, I wasn&#8217;t calling some variants properly</p>\n<p>@Nick I just tried out your form, and it appears to be working fine! I added 1 of every item in your form, and it did just that: <a href=\"http://take.ms/zAoSx\" rel=\"nofollow\">http://take.ms/zAoSx</a>.</p>\n"}},{"node":{"content":"<p>Thanks heaps the url is <a href=\"http://www.catcaps.myshopify.com\" rel=\"nofollow\">http://www.catcaps.myshopify.com</a>, it hasn&#8217;t been launched or finished yet so i put the link for order form under shipping info tab, i think the store front is passworded in which case it is just &#8216;password&#8217; thanks for all your help.</p>\n"}},{"node":{"content":"<p>Awesome! It seems like that did it, and I can still set the initial value to 1 without causing any errors. Thank you very much for your help!!!</p>\n<p>What was the typo you fixed??</p>\n<p>Again, my sincerest thanks. 🙂</p>\n"}},{"node":{"content":"<p>@Lise thank you so much for the kind words! Glad it worked! 🙂</p>\n"}},{"node":{"content":"<p>@Nick I&#8217;m just on the road now for a conference, I&#8217;ll take a look when I&#8217;m back! What is your shop URL?</p>\n"}},{"node":{"content":"<p>As a non-programmer may I thank you from the bottom of my heart for doing a tutorial that a non-geek can understand. I just tried following your instructions, and it just worked. THANK YOU!</p>\n"}},{"node":{"content":"<p>Hi,<br />\nHope you enjoyed your holiday,  i have used the updated code for the page.order-form.liquid and carolines fix to the order-form-script, unfortunate to no success, the site will only add some of the products list to the cart, i have tryed to alter the var length statements, but nothing seems to work.</p>\n<p>Your blog is awesome and so are you.</p>\n"}},{"node":{"content":"<p>Hey AJ, I found a small typo in the page.order-form.liquid &#8211; try with the new code and let me know how that goes: <a href=\"https://gist.github.com/Tetsuro/2932738/raw/7c0c5aea3cd59b35194f61e2c6c0b1c7f852f9fb/page.order-form.liquid\" rel=\"nofollow\">https://gist.github.com/Tetsuro/2932738/raw/7c0c5aea3cd59b35194f61e2c6c0b1c7f852f9fb/page.order-form.liquid</a>.</p>\n"}},{"node":{"content":"<p>@AJ still in Japan at the moment, I&#8217;ll take a look when I&#8217;m back home.</p>\n"}},{"node":{"content":"<p>Excuse me &#8211; I was incorrect. The script did NOT work, it only added 11 of the 13 otems in one kit, because it was getting the var length from the number of items on the previous linklist. When I make the following change, I can use 1 script for every package we offer:</p>\n<p>//{% assign linklist = linklists[&#8216;kit-vac-a-tee&#8217;] %}<br />\n//var length = {{ linklist.links.size }};</p>\n<p>var length = 250;</p>\n<p>Thoughts?</p>\n"}},{"node":{"content":"<p>Here is an interesting one. I have a total of 3 linklists on 3 seperate pages that I am using this with. Each page template is the same, except for the linklist name that is called. Strangely though &#8211; they all WORK without me changing the following line in the order-form-script.liquid file:</p>\n<p>&#8230;<br />\n{% assign linklist = linklists[&#8216;NAME-TO-CHANGE&#8217;] %}<br />\n&#8230;</p>\n<p>Why does the script work, even though it only references the first of 3 linklists?</p>\n<p>Thanks, hope you had a great trip.</p>\n"}},{"node":{"content":"<p>Hey Julia, try looking for the closing &lt;/body&gt; tag instead, and placing the &#8216;include&#8217; right above it. So it&#8217;ll look like this:</p>\n<p>{% include &#8216;terms-and-conditions&#8217; %}<br />\n&lt;/body&gt;</p>\n"}},{"node":{"content":"<p>Thank you for this nice and easy tutorial!</p>\n<p>However, I have some difficulties to implement the last step. I do not understand where to put the code in the theme.liquid. Everywhere I tried it, the shop gave me the error message, that it could not find the snippet.</p>\n<p>So, the checkbox appears, but you can go on to check out, wheather it is checked or not.</p>\n<p>Could you maybe take a look at the code if I send it to you and tell me, maybe by marking the spot, where to put it?</p>\n<p>That would be great!</p>\n<p>Sadly I have no idea about code, I&#8217;m following blindly.</p>\n"}},{"node":{"content":"<p>thanks for reading Ricky!!</p>\n"}},{"node":{"content":"<p>@Drew Thank you so much for reading! 🙂</p>\n"}},{"node":{"content":"<p>Thanks a ton for the tutorials tetchi!</p>\n<p>You did a great job of breaking things down step by step. It made figuring out how to work with the Liquid Templating system very easy. I&#8217;m really looking forward to the next tutorial, keep up all of the good work!</p>\n"}},{"node":{"content":"<p>Excellent, many thanks for this!!</p>\n"}},{"node":{"content":"<p>Hey guys, I&#8217;m going to be away on vacation for the next two weeks,  I&#8217;ll try and take a look as soon as I&#8217;m back!</p>\n"}},{"node":{"content":"<p>Hi Tetchi,<br />\nThis is awesome information, thanks. I am still learning Shopify templates and Liquid. When I went to create this page.order-form.liquid, it is not taking (no little HTM sign like other templates). It shows up as a new template but does not allow me to select this template in the Page section. I cannot figure out why.</p>\n<p>Please help :'(</p>\n"}},{"node":{"content":"<p>Here is one more quick question &#8211; If I wanted to have a button at the top and bottom of my table to add to cart, I need a unique ID for each button or 1 of them wont work. My first button is called id=&#8221;submit-table&#8221;, my second one is called id=&#8221;submit-button2&#8243;. How can I add this second ID to the script without copying the entire function and changing the following line to the new name, as such:</p>\n<p>&#8230;..$(&#8220;#submit-table2&#8221;).click(function(e) {&#8230;..</p>\n<p>Thanks.</p>\n"}},{"node":{"content":"<p>Ooooh geez, hahahaha. WHHHHYYYY did they do that. That hurts my brain. Thanks for responding so speedily! Much appreciated. Can&#8217;t wait to keep reading more! 🙂</p>\n"}},{"node":{"content":"<p>Thanks for reading! 🙂</p>\n"}},{"node":{"content":"<p>@Rachel Thank you very much for reading! 🙂</p>\n<p>{{ page_title }} is actually the correct Liquid there 🙂 It&#8217;s a global variable used to output the page&#8217;s title (listed here: <a href=\"http://docs.shopify.com/themes/liquid-variables/global\" rel=\"nofollow\">http://docs.shopify.com/themes/liquid-variables/global</a>). {{ page.title }} would output the title of a page that you would make in the Pages section of the admin (part of the &#8220;page&#8221; object: <a href=\"http://docs.shopify.com/themes/liquid-variables/page\" rel=\"nofollow\">http://docs.shopify.com/themes/liquid-variables/page</a>). It&#8217;s very easy to mix those up though, haha!</p>\n"}},{"node":{"content":"<p>great tutorial!!<br />\nthanks man</p>\n"}},{"node":{"content":"<p>I believe that in Step 3, it should be &#8220;page.title&#8221; rather than &#8220;page_title&#8221;&#8230; Unless I&#8217;m mistaken?</p>\n<p>Thank you so much for writing this! Super helpful 🙂</p>\n"}},{"node":{"content":"<p>@Amandeep</p>\n<p>Thanks, I&#8217;ll try it out. Looks similar to what I was trying out with straight up, old fashioned HTML tables (yeah, I really need to get a good handle on CSS). </p>\n<p><a href=\"http://jsfiddle.net/sYtQ8/\" rel=\"nofollow\">http://jsfiddle.net/sYtQ8/</a></p>\n<p>It seemed to me, even though none of the CSS related to the product.description was stripping out the HTML, it just wasn&#8217;t passing the color through the call (even though it worked marvelously in the admin panel). </p>\n<p>Cheers,<br />\nRodolfo</p>\n"}},{"node":{"content":"<p>I have a similar issue ( great tut btw ): i cannot add products to the cart. I have no inventory tracking, i have my order form in a pop up modal. This pop up modal is available from all pages.</p>\n<p>If you view: <a href=\"http://herzog-group7717.myshopify.com/\" rel=\"nofollow\">http://herzog-group7717.myshopify.com/</a>  &#8211; scroll to the bottom left of the page and click configuration, then head to slide 4. My input boxes are all disabled ( i have stock and 1 default variant ), i just cant get this to work.</p>\n"}},{"node":{"content":"<p>@Rodolfo</p>\n<p>May be this will help : <a href=\"http://jsfiddle.net/vQq8v/\" rel=\"nofollow\">http://jsfiddle.net/vQq8v/</a></p>\n"}},{"node":{"content":"<p>@Ricky Hello from Ottawa! Thanks, that&#8217;s good to know 🙂</p>\n"}},{"node":{"content":"<p>Hi from Fukuoka. Nice weather here atm.</p>\n"}},{"node":{"content":"<p>@Amandeep I&#8217;m not too familiar with metafields, but I can certainly work on a tutorial after I&#8217;m done with this series 🙂</p>\n"}},{"node":{"content":"<p>Hi Amandeep! The example is here: <a href=\"http://www.revvapor.com/products/caramelcappuccino\" rel=\"nofollow\">http://www.revvapor.com/products/caramelcappuccino</a></p>\n<p>The idea was to have the English translation in a lighter color &#8211; let&#8217;s say a lighter grey. </p>\n<p>I can probably also do some funky crafting with tabs and <!-- Split --> but I&#8217;d rather avoid that option since the description is shared with Vend. But if tabs and &lt;!&#8211; split is the only way to divide it out, then that might have to be the option.</p>\n"}},{"node":{"content":"<p>@Rodolfo</p>\n<p>Can you post the link/url?</p>\n"}},{"node":{"content":"<p>Thanks for the reply Tetchi. I am working on a shopify project (Online Book Store) and as you know we do not really have so many fields by which we can show Author, ISBN Number etc. So Is there way by which I can add custom fields (like we can add in WordPress). I&#8217;ve read about MetaFields but how can  I use them in my store? May be you can write a blog post/tutorial on this 🙂</p>\n<p>Thanks<br />\nAmandeep</p>\n"}},{"node":{"content":"<p>@Leon Thanks for reading! 🙂</p>\n"}},{"node":{"content":"<p>Hey Leon &#8211; you can add a link to your frontpage collection through the &#8220;Links&#8221; tab in your admin 🙂</p>\n"}},{"node":{"content":"<p>Hey Tetchi, quick question, I&#8217;ve been trying to create two columns in the description for a product (achieved through a hasty table scaffold), but I would like the two columns to have different styles (they&#8217;re two different languages). I tried using table style, but looks like that only works within the product description on the admin side, not on the web side. Any ideas?</p>\n"}},{"node":{"content":"<p>It seems like that could have something to do with this issue, but we don&#8217;t actually set the inventory amount. We manufacture things here so we haven&#8217;t messed with that at all.</p>\n<p>So under products in the chart I just see little infinite symbols.</p>\n"}},{"node":{"content":"<p>@AJ are the products in your link list sold out? Do they have any inventory left?</p>\n"}},{"node":{"content":"<p>Sorry code was removed. Here is a screenshot:</p>\n<p><a href=\"http://www.lmktechnologies.com/OLDSITE/tetchi-screenshot.jpg\" rel=\"nofollow\">http://www.lmktechnologies.com/OLDSITE/tetchi-screenshot.jpg</a></p>\n"}},{"node":{"content":"<p>To be more specific, this is the chunk of code I am having the issue with (I think). Originally this was showing up with a 0 in the quantity fields, and they were grayed out so I could not edit them. I added value=&#8221;1&#8243; just to see if the script worked. It does and it adds one of everything to the cart, but why would the input fields be grayed out? Thanks.</p>\n<p>**************************************************************</p>\n"}},{"node":{"content":"<p>This is awesome &#8211; however, for some reason the input for quantity is grayed out and I am unable to click in it and set the value. If I set &#8220;Value=&#8221;1&#8243;&#8221; in the code so it shows up there by default, then it&#8217;s still grayed out. I can&#8217;t click it to change it, but if I hit add it adds 1 of each item to the cart.</p>\n<p>Any ideas what I do not have set correctly?</p>\n<p>Thanks, and great tutorial!!</p>\n"}},{"node":{"content":"<p>@Amandeep Unfortunately not &#8211; there is no way to check for how many time a product/variant has sold via Liquid. It&#8217;s not part of product.js either 🙁</p>\n"}},{"node":{"content":"<p>Nice work man!! Really Helpful. I just have a question, Is there any way by which we can show List of Best Selling Products. This shouldnt be a category but should be generated dynamically. </p>\n<p>Thanks<br />\nAmandeep Singh</p>\n"}},{"node":{"content":"<p>That worked!! Look forward to the other parts 😉 Thanks a lot so far!</p>\n"}},{"node":{"content":"<p>Thanks, all working so far, however, I see that in your theme you have a link called &#8216;Front Page&#8217; on the home page. I don&#8217;t have such link after going through all steps.</p>\n<p>The products are shown under &#8216;catalog&#8217; in my case but the text that I created is not showing above the products under &#8216;catalog&#8217;.</p>\n<p>I can only find the page with the text above and products below if I navigate manually to: </p>\n<p>myurl.myshopify.com/collections/frontpage</p>\n<p>Thanks!</p>\n"}},{"node":{"content":"<p>Worked straight out of the box, and the tutorial was easy to follow. Thanks!</p>\n<p>Would it be possible to change the formatting of the box if the script returns a &#8220;fail&#8221;?<br />\nI&#8217;m thinking that if the customer forgets to check the box initially, and receives the error-pop-up, the box and text would then be highlighted (e.g. red color) to show the customer where to go next&#8230;</p>\n"}},{"node":{"content":"<p>Sorry about that guys! It&#8217;s all fixed now, thanks to Caro!</p>\n"}},{"node":{"content":"<p>Hey!</p>\n<p>I&#8217;m using the alternate version to display ALL products. Would the script file stay the same??<br />\nIt&#8217;s not working on my site. </p>\n<p>Thanks!</p>\n<p>Andrea</p>\n"}},{"node":{"content":"<p>Hi Nick,</p>\n<p>Replace the following in order-form-script:</p>\n<p>var length = {{ linklist.size }};</p>\n<p>With:</p>\n<p>var length = {{ linklist.links.size }};</p>\n"}},{"node":{"content":"<p>Hi Tetchi,<br />\nThis script has also been very usefull, i was wondering if it was possible to generate table as follows:</p>\n<p>Pic                           title                                    price                                varient                           quantity<br />\n (pic)                       Coat                                   15.0                               s                                     (input cell)<br />\n                                                                                                                  m                                    (input cell)<br />\n                                                                                                                  L                                     (input cell)</p>\n<p>Where s,m,l, are the varients of the product coat, and upon inputing into cell, the cart will update with these order. this would be qreatly appreciated have strugggled creating a order form for shopify shop for a looooong time</p>\n"}},{"node":{"content":"<p>Tetchi Thanks for your help,<br />\ni have followed your scripts exactly, my order form table will only add the first three product to cart,could you provide advice</p>\n<p>regards</p>\n"}},{"node":{"content":"<p>Great info but I am trying to let this work on the top menu of Shopify. Like: making &#8211; I agree&#8230;&#8230; &#8211; visible just beneath the menu links -, visitor needs to check and if not, visitor is not allowed to use the menu item links. (not allowed to see info) Is this also possible with your solution? See in script:</p>\n<p>jQuery(document).ready(function(){<br />\n    jQuery(&#8220;.submit-cart input[type=&#8217;submit&#8217;],.submit-cart input[type=&#8217;image&#8217;]&#8221;).click(function(){<br />\n      if(jQuery(&#8216;#agree&#8217;).is(&#8216;:checked&#8217;)){<br />\n        jQuery(&#8220;.submit-cart input&#8221;).submit();<br />\n      }</p>\n<p>and understand this should be changed. Any hints or ideas. Thanks again for the info.<br />\nKind regards.</p>\n"}},{"node":{"content":"<p>@Kevin oh you&#8230; stahp it</p>\n"}},{"node":{"content":"<p>This is radical and you are radical.</p>\n"}},{"node":{"content":"<p>Oh! Well, I do kind of do that on this blog: <a href=\"https://www.tetchi.ca/category/tutorial/\" rel=\"nofollow\">https://www.tetchi.ca/category/tutorial/</a>. Whenever I have a &#8220;oh snap, you can do that?&#8221; moment, I write about it here. Most of them involve a combination of Liquid and jQuery. For example:</p>\n<p>&#8211; <a href=\"https://www.tetchi.ca/shopify-tutorial-captions-for-blog-article-and-pages/\" rel=\"nofollow\">https://www.tetchi.ca/shopify-tutorial-captions-for-blog-article-and-pages/</a><br />\n&#8211; <a href=\"https://www.tetchi.ca/shopify-tutorial-limiting-storefront-search-to-certain-product-types/\" rel=\"nofollow\">https://www.tetchi.ca/shopify-tutorial-limiting-storefront-search-to-certain-product-types/</a><br />\n&#8211; <a href=\"https://www.tetchi.ca/shopify-tutorial-how-to-create-a-part-picker-form/\" rel=\"nofollow\">https://www.tetchi.ca/shopify-tutorial-how-to-create-a-part-picker-form/</a></p>\n<p>&#8230; to name a few. 🙂</p>\n"}},{"node":{"content":"<p>So to clarify, I hope, what I was saying on Twitter is that when I started using Liquid I thought of it more or less as a simple templating language. I knew from reviewing the Shopify Resources page that there was logic and variable capabilities built, but the way I tend to learn is by absorbing what I need in that moment for a specific task and I think all I was able to &#8220;see&#8221; was if/then statements and loops. Which I mean with your average theme you could get away with using just that.</p>\n<p>I&#8217;ve since come to realize after looking through some themes that you can do things with Liquid that you might otherwise rely on javascript or to accomplish. </p>\n<p>SO, getting to the point, what I&#8217;d like to see for a tutorial would be more &#8220;cool&#8221; real work examples of using Liquids logic and variables. Maybe even a short one off of something that made you go, &#8220;Awesome! I didn&#8217;t know I could do that with Liquid.&#8221; I&#8217;ve had that experience myself, more than once.</p>\n"}},{"node":{"content":"<p>Haha, that&#8217;s exactly it! 🙂</p>\n"}},{"node":{"content":"<p>So just for clarification when you say &#8220;keep it straight OG&#8221; you&#8217;re referring to the Original Guru, right??</p>\n<p>Nice post, can&#8217;t wait for the whole series.</p>\n"}},{"node":{"content":"<p>Hey Paul, AFAIK it doesn&#8217;t affect load times all that much. I can check with the devs for a definite answer though!</p>\n"}},{"node":{"content":"<p>This maybe outside the realm of what you&#8217;re doing here, but I&#8217;ve been wondering, does it slow your shop down or effect load times in any significant way if you go very modular or DRY with a theme? </p>\n<p>For example I&#8217;ve got a theme I&#8217;m working on and most any bit of Liquid I find I&#8217;m repeating more than once I pull and make into a snippet and just use include.</p>\n"}},{"node":{"content":"<p>What are you shop URLs? I&#8217;m wondering if it&#8217;s conflicting with some other JS.</p>\n"}},{"node":{"content":"<p>Yup, me too. Same problem as the other two guys. Can&#8217;t get the donation to actually take. Just disappears when I put it in.</p>\n"}},{"node":{"content":"<p>Hi,<br />\nI&#8217;m having the same problem as Kittypie. Althought I can see the donations box, when I input an amount it will not add to the total. Please can you help?</p>\n"}},{"node":{"content":"<p>This worked brilliantly &#8211; thanks a million!</p>\n"}},{"node":{"content":"<p>I think I followed all the steps correctly and the donation box is showing up on the checkout page, but when I put in a random figure into the donation box on the check out page and click update total, it doesn&#8217;t update it at all and deletes the amount I put in. </p>\n<p>I also wondered if there&#8217;s a way to link the &#8220;Donation&#8221; text (by clicking on it) in the checkout page to another page where customers are given more information about donating.</p>\n"}},{"node":{"content":"<p>Dude just made a goodreads account! Username is &#8220;tetchi&#8221;. 🙂</p>\n"}},{"node":{"content":"<p>Hey Jamie! I&#8217;d actually not heard of goodreads before, I&#8217;m going to check that out! Shantaram looks pretty damn good.</p>\n<p>I read &#8220;Wind Up Bird Chronicles&#8221; by Murakami a while back, it was weird, but pretty cool.</p>\n"}},{"node":{"content":"<p>Oh one more if you haven&#8217;t read it. This is brilliant too -&gt; <a href=\"http://www.goodreads.com/book/show/21.A_Short_History_of_Nearly_Everything\" rel=\"nofollow\">http://www.goodreads.com/book/show/21.A_Short_History_of_Nearly_Everything</a></p>\n"}},{"node":{"content":"<p>Nice post!<br />\nSo I HIGHLY recommend Shantaram<br />\n<a href=\"http://www.goodreads.com/book/show/33600.Shantaram\" rel=\"nofollow\">http://www.goodreads.com/book/show/33600.Shantaram</a></p>\n<p>One of the best books I&#8217;ve ever read. Also not sure what Haruki Murakami you&#8217;ve read. Are you on goodreads? We should connect up reading lists if you are. The Neil Young book is on my short list too.</p>\n"}},{"node":{"content":"<p>Holy crap! Just tried it out, and it works. Thanks again, Caro! Changing the code in my post now. </p>\n"}},{"node":{"content":"<p>@Dan: It&#8217;s pretty much the same principle at the code in this tutorial. You could have one product in the link list with each of its variants in a checkbox, but you&#8217;ll have to adjust the code a bit so that:</p>\n<p>a) you can select multiple checkboxes in one list<br />\nb) add all selected variants of the same product</p>\n"}},{"node":{"content":"<p>What if I wanted to make them check boxes, i.e select 3 of the following 6, how would I do that?</p>\n"}},{"node":{"content":"<p>Tets, I am pretty sure you can do this also:</p>\n<p>{% assign num =  num | plus: 1 %}</p>\n<p>That was not always possible, but I believe it is now.</p>\n"}},{"node":{"content":"<p>is it possible to export animated scenes with referenced files? ex. all the characters and environment are referenced (all files are maya 2013 ascii) then animated and saved as a maya 2013 file. now i need to export it as fbx for import in maya 2011.  i tried exporting a single character as fbx (rigged without animation/maya2013 ascii) i used fbx 2011 in advanced options. when i imported the fbx in maya 2011 all the constraints were not imported, although i checked the constraints while exporting from maya 2013.<br />\nthis is basically what i need to do. convert all maya 2013 scene files (animated referenced files) to maya 2011 scene files. </p>\n<p>anybody knows how to solve this?</p>\n"}},{"node":{"content":"<p>hey Thea! As far as I know they don&#8217;t have an online shop.. hope they open one soon (and ship to North America haha)</p>\n"}},{"node":{"content":"<p>hey man,<br />\nI went to this shop last week in Harajuku and loved it. I was wondering if you know whether they sell they&#8217;re stuff online or not?<br />\ncheers</p>\n"}},{"node":{"content":"<p>Hi Tetchi, thanks for getting back to me. I have emailed you a screenshot with further details as no way to attach items to this. Thanks for your time.</p>\n"}},{"node":{"content":"<p>Hmm Martin, I&#8217;m not sure if I follow. Do you have an example or a mockup you can show me of what you&#8217;re looking to achieve?</p>\n"}},{"node":{"content":"<p>Hi, this is great almost exactly what I am after. My only problem is that I have 2 products on my page, but the first one has multiple variants they choose. Then the second is just an extra quantity box to add an add-on module(s).</p>\n<p>Don&#8217;t suppose you know if this is possible or not?</p>\n<p>any help greatly appreciated.</p>\n<p>cheers.</p>\n"}},{"node":{"content":"<p>haha anytime dude 😛</p>\n"}},{"node":{"content":"<p>How come we never see these awesome shirts in action? &#8230;and how about you host one of these at your place with friends? aka&#8230; for me 😉</p>\n"}},{"node":{"content":"<p>This is sweet &#8211; thanks Tetchi!</p>\n"}},{"node":{"content":"<p>Followed the tutorial and it worked &#8211; sort of:  When I click the checkout button, I get the message telling me I need to agree to the terms, but when I click OK in the message box, I am taken to the checkout page.</p>\n"}},{"node":{"content":"<p>Thanks, I&#8217;m not a programmer and run a small business.  I have never done anything like this before your tutorial made it happen easy, first time. Geoff</p>\n"}},{"node":{"content":"<p>thanks Craig!</p>\n"}},{"node":{"content":"<p>Really smart solution.  Love it.</p>\n"}},{"node":{"content":"<p>Thanks Jamie! 😀</p>\n"}},{"node":{"content":"<p>Great job Tets! 😀 + first comment 😉</p>\n"}},{"node":{"content":"<p>Hello,</p>\n<p>Thank you for posting this information, it is very helpful. </p>\n<p>I am having one issue.</p>\n<p>The last step of placing {% include &#8216;order-form-script&#8217; %} right above the closing .</p>\n<p>When I do this, it puts a small table with an add button all the way at the top of the page in the header, near the log in, cart and check out buttons.</p>\n<p>Any suggestions as to why this is happening?</p>\n<p>Thanks,<br />\nEric</p>\n"}},{"node":{"content":"<p>Hi! So happy I found your tutorial. I am using the new standard theme and followed your instruction, but unfortunately I am able to continue the check-out process without checking the terms and conditions box?</p>\n<p>I am a coding beginner, so any help is highly!!!!! appreciated&#8230;</p>\n<p>Regards,<br />\nRoman</p>\n"}},{"node":{"content":"<p>Hey Ben, </p>\n<p>No problem at all, here&#8217;s an altered version of the code where it lists ALL products in a shop: <a href=\"https://raw.github.com/gist/4151207/13c9360f714ea96ce0d8a846d78e03db4e1749ee/gistfile1.txt\" rel=\"nofollow\">https://raw.github.com/gist/4151207/13c9360f714ea96ce0d8a846d78e03db4e1749ee/gistfile1.txt</a>. You can paste that into page.order-form.liquid. 🙂</p>\n<p>Make sure you create a Smart Collection called &#8220;All&#8221; that contains all products in your shop first (you can set its condition to &#8216;price is greater than zero&#8217;).</p>\n<p>Hope that helps!</p>\n<p>Tetchi</p>\n"}},{"node":{"content":"<p>Needed this for a client&#8217;s site ourselves, outstanding! Worked like a charm, great work! Thank you!</p>\n"}},{"node":{"content":"<p>Hi there,<br />\nI&#8217;m using this script which is great and almost exactly what I&#8217;m after, although I&#8217;d like to display all products rather than using a link list.</p>\n<p>Could you please provide a quote for a mofified version of this code to work with all products?</p>\n<p>Thanks, Ben</p>\n"}},{"node":{"content":"<p>Hey guys, check out the new Variant Images app here: <a href=\"http://apps.shopify.com/variant-images\" rel=\"nofollow\">http://apps.shopify.com/variant-images</a> &#8211; it&#8217;s a much easier way to associate product images to variants!</p>\n"}},{"node":{"content":"<p>I really want to add this feature to my website but am having the same trouble as a few others, I cannot find where put the code in correctly, and I am using the ENVY theme. Can somebody please help me out???</p>\n"}},{"node":{"content":"<p>Hi Mate, I have implemented your code. It doesn&#8217;t seems to be working. I  have gone by step by step. I skipped hiding the thumbnails. But surely that wont effect the functionality? Any Suggestions?</p>\n<p>Cheers,</p>\n"}},{"node":{"content":"<p>Hi This is a very helpful blog I wanted to add an agreement checkbox on my checkout page but I want it for a specific products or collection only I have been reading through and you can do that by doing if on {{ item.product.title }} but I am not an advance programmer and I just started learning it can please show an example, thank you this would be very helpful</p>\n"}},{"node":{"content":"<p>Hi Tetsuro,</p>\n<p>We are so happy to have found this tutorial which enables us to add the &#8220;I agree&#8221; checkbox (a legal requirement here in Germany)! </p>\n<p>A couple of questions:</p>\n<p>1. How/where we can resize the font of the &#8220;I agree with Terms &amp; Conditions&#8221; text?</p>\n<p>2. Also, we&#8217;d like to have the whole text in one line, not split into 3 rows.<br />\n    I guess if we try to adjust the padding or the margin (?) of &#8220;.cart_table tr td&#8221; in the style.css, that should do the trick, right?</p>\n<p>Many thanks in advance!</p>\n<p>Regards,<br />\nAndrea<br />\nPS: We are using Jitensha Theme &#8211; and love it!</p>\n"}},{"node":{"content":"<p>Hi,<br />\nI just launch different size options for my product and this is exactly what I was looking for. But like Yasuko &amp; Brian I&#8217;m not using Radiance and just don&#8217;t understand how to implement step 2 and 3. I&#8217;m using Minimal theme. Your help would me very much appreciated!<br />\nThanks!</p>\n"}},{"node":{"content":"<p>Hi,</p>\n<p>I am trying to get the right image to show up when people select a color variation for my products using the New Standard theme which already has the selectCallback function. I am a half-noob with coding but handdled the various necesary changes quite allright so far.</p>\n<p>I followed instructions given above, change all ALT tags to correspond to my 10 color option names, found the different parts in the product.liquid code and edited as explained. </p>\n<p>When I do all these changes, on the site I no longer have any product image showing up nor the little box to choose from the available options (Even my logo and top menu disappear when I am on the product page). I tried various edits using pieces of codes that were posted above, sometimes I got my images and thumbs back on the screen but without the select color box.</p>\n<p>After edits following the above pattern, my product.liquid code from lines 236 to 272 looks like it (I replaced &#8220;Your Option Name Here&#8221; by &#8220;Title&#8221; because this is what it shows on the left side of SKU on my product document):</p>\n<p> // OPTION SELECT<br />\n  {% if product.variants.size &gt; 1 %}</p>\n<p>  {% assign look_for_image_match = false %}<br />\n  {% assign option_index = 0 %}<br />\n  {% for option in product.options %}<br />\n    {% assign downcased_option = option | downcase %}<br />\n    {% if downcased_option contains &#8216;color&#8217; or downcased_option contains &#8216;colour&#8217; or downcased_option contains &#8216;style&#8217; %}<br />\n      {% assign look_for_image_match = true %}<br />\n      {% assign option_index = forloop.index0 %}<br />\n    {% endif %}<br />\n  {% endfor %}<br />\n  Shopify.doNotTriggerClickOnThumb = false;</p>\n<p>{% assign option_to_match = &#8216;Title&#8217; %}<br />\n{% assign option_index = 0 %}<br />\n{% for option in product.options %}<br />\n  {% if option == option_to_match %}<br />\n    {% assign option_index = forloop.index0 %}<br />\n  {% endif %}<br />\n{% endfor %}</p>\n<p>var selectCallback = function(variant, selector) { </p>\n<p>       //Swapping images JS<br />\n    var optionValue = variant.options[{{ option_index }}];<br />\n    var imageSrc = $(&#8220;#thumbs img[alt='&#8221;+optionValue+&#8221;&#8216;]&#8221;).attr(&#8216;src&#8217;);<br />\n    if (imageSrc != &#8216;undefined&#8217;) {<br />\n      //Change &#8216;_thumb&#8217; with the image size that you are using for the thumbnails<br />\n      imageSrc = imageSrc.replace(&#8216;_thumb&#8217;,&#8221;);<br />\n      $(&#8216;#active-wrapper img&#8217;).attr(&#8216;src&#8217;, imageSrc);<br />\n    }  </p>\n<p>    if (variant &amp;&amp; variant.available) {<br />\n      // selected a valid variant that is available.<br />\n      jQuery(&#8216;#add&#8217;).removeClass(&#8216;disabled&#8217;).removeAttr(&#8216;disabled&#8217;).val(&#8216;Lägg i varukorg&#8217;).fadeTo(200,1); // remove unavailable class from add-to-cart button, and re-enable button</p>\n<p>What am I doing wrong? Any advice / help / recommandation is welcome!<br />\n/Marianne</p>\n"}},{"node":{"content":"<p>Great work guys! </p>\n<p>@Colin:  killer script</p>\n"}},{"node":{"content":"<p>Thank You!!!!</p>\n"}},{"node":{"content":"<p>Hi ! </p>\n<p>What a great tutorial !</p>\n<p>I&#8217;m trying to follow your tutorial. I&#8217;m totally new in liquid and already completing step one in the tutorial I&#8217;m stuck. I hope you can give me a hint on this..</p>\n<p>I&#8217;ve have completed step 1. Adding the checkbox in cart.liquid &#8211; this is easy however the &#8220;I agree with the&#8230;&#8221;-text conflicts with my checkout button.</p>\n<p>How do I make it look nice layout-wise? I guess this is very basic..but how do I add som line spacing before and after? Can you give me a clue?</p>\n<p>Thank you 🙂 </p>\n<p>All the best from Copenhagen</p>\n"}},{"node":{"content":"<p>Hi &#8211; need an &#8216;agree to T&#8217;s &amp; C&#8217;s&#8217; checkbox added to my cart &#8211; help someone please? I&#8217;m also code challenged.</p>\n<p>Thanks so much</p>\n"}},{"node":{"content":"<p>PS: password is &#8220;skeelt&#8221;</p>\n"}},{"node":{"content":"<p>Hey Tetchi!</p>\n<p>This blog is great and did help me on the Default theme for Shopify, but now that i have changed to the &#8220;Clearflex&#8221; Theme (lighthouse version), I am unable to locate the &#8220;selectCallback&#8221; in either file association you mentioned. Am I missing something? </p>\n<p>Could you help a n jsquery novice like myself understand better how to use the change() method? Where do i implement this js code if my theme does not use &#8220;selectCallback&#8221;?</p>\n<p>Appreciate it!<br />\nJosh</p>\n"}},{"node":{"content":"<p>Worked perfectly! Thanks so much for the tutorial.</p>\n<p>For those of you having trouble with the &#8220;update cart&#8221; button needing to have the check box checked to function, this is what worked for <a href=\"http://www.vedgecandle.com\" rel=\"nofollow\">http://www.vedgecandle.com</a></p>\n<p>Put the code from step two around each button (Vedge Candle uses the regular checkout and PayPal) separately instead of wrapping the whole mess. I&#8217;d recommend checking your code again and if the &#8220;update cart&#8221; button is inside the the &#8230; then get it out! The screen shot for step #2 shows it inside the code, which may be causing some of these problems. That said, there may be a reason I don&#8217;t know for why it&#8217;s in there, but this is what worked for us.</p>\n<p>Also, html code (<a href=\" \" rel=\"nofollow\">text</a>) should work fine to link the &#8220;Terms and Conditions&#8221; text from step #1 to where ever you want it to go.</p>\n<p>Thanks so much again!</p>\n"}},{"node":{"content":"<p>Sure Maggie, I&#8217;ll get it for you! 🙂</p>\n"}},{"node":{"content":"<p>I am code-challenged and having trouble. Is anyone willing to do this for me? I do appreciate 🙁</p>\n"}},{"node":{"content":"<p>Thanks buddy!</p>\n"}},{"node":{"content":"<p>Looks super fresh, man. Love it!</p>\n"}},{"node":{"content":"<p>Beginners should get a copy of this book 🙂</p>\n"}},{"node":{"content":"<p>@Edwin Fixed &#8211; thanks for catching that and apologies for the confusion!</p>\n"}},{"node":{"content":"<p>Hi Tetchi,</p>\n<p>The link provided for the Order Form template is the same link for the javascript.</p>\n<p>I believe the correct code is this.</p>\n<p><a href=\"https://gist.github.com/2932738\" rel=\"nofollow\">https://gist.github.com/2932738</a></p>\n<p>Did a quick google search on GIST for order form liquid and found it.</p>\n"}},{"node":{"content":"<p>@Cakewalkcg thanks for the kind words!</p>\n<p>@Feras Man, I wish I could tell you but I&#8217;ve been without Maya for almost 1.5 years&#8230; sorry man 🙁</p>\n"}},{"node":{"content":"<p>This tutorial is awesome, thanks very much. I was able to implement it and the snippet @Brad references above (to pass the color thumb to the cart page) with no problems.</p>\n<p>The only issue is what @Jeff is experiencing. On product pages where I have a single item that doesn&#8217;t have a color variant, the price does not display. My workaround is to add a color variant and alt tag to those single items, but that is going to be a pain for my client to remember to do that when adding one-off products. Jeff&#8217;s solution did not seem to work for me either.</p>\n<p>Has anyone figured out why the price disappears on a product that does not have a color variant and alt tag on the image?</p>\n<p>Thanks!</p>\n"}},{"node":{"content":"<p>Do you know how to reduce the file size of an fbx?  right now, animations i&#8217;m exporting are coming out at hundreds of kilobytes, and I&#8217;d like to know if there was a way to reduce the size in any way.</p>\n"}},{"node":{"content":"<p>Hi,</p>\n<p>      Very important tutorial. Almost lot of fellows skip the &#8220;Change Input Order&#8221; step while exporting to FBX. Nice to see you put it there.</p>\n<p>Keep up buddy.</p>\n<p>Regards,<br />\nCakewalkcg<br />\n&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8211;<br />\nVisit <a href=\"http://www.cakewalkcg.com\" rel=\"nofollow\">http://www.cakewalkcg.com</a> for free 3D models and video tutorials.</p>\n"}},{"node":{"content":"<p>So in case anyone has the same problem, I got it all working, followed your steps in the other blog( <a href=\"http://blog.tetsutakara.com/593/\" rel=\"nofollow\">http://blog.tetsutakara.com/593/</a> )? and used the noConflit script.</p>\n"}},{"node":{"content":"<p>thanks I got this working now!!!! very helpful!!</p>\n"}},{"node":{"content":"<p>Thanks for the Tutorial, very slick and easy to follow. One problem though, it works fine for me in IE for me, but can&#8217;t seem to get it to work in Chrome or Firefox? I&#8217;ve checked with firebug and view source..JS/Jquery is in the header and the div is wrapping the proceed to checkout button.</p>\n<p>Any thoughts?</p>\n<p>Cheers</p>\n"}},{"node":{"content":"<p>Thank you Tetsuro;-)</p>\n<p>And a very nice deed to make the instructions even easier to implement.</p>\n<p>Oliver</p>\n"}},{"node":{"content":"<p>Any chance we can inject the SKU instead of the option name? I&#8217;ve been trying to merge this functionality along with Caroline Schnapp&#8217;s (there is a forum post from her on how to grap the sku with jQuery).</p>\n"}},{"node":{"content":"<p>Thanks Sara 😉 and yep, made it easier to follow!</p>\n"}},{"node":{"content":"<p>haha love it! Love your blog. I can see you&#8217;ve updated the TC&#8217;s tutorial! Great work</p>\n"}},{"node":{"content":"<p>Thanks Caro! You da best!</p>\n"}},{"node":{"content":"<p>Awesome rewrite, Tets! Thank you for taking the time!</p>\n"}},{"node":{"content":"<p>haha thanks bro! IIRC I wrote most of the story&#8230; lol</p>\n"}},{"node":{"content":"<p>What?!?! That&#8217;s awesome work Tetsuro! hhahaha it&#8217;s almost as good as the original. Who wrote the storyline?</p>\n"}},{"node":{"content":"<p>Tetsuro,</p>\n<p>Excellent Tutorial.</p>\n<p>A few Questions Please:</p>\n<p>1.<br />\nCheckout Buttons Displaced on Cart Page After Adding the Code:<br />\nI followed your tutorial &#8211; but my Checkout Page now looks like this:</p>\n<p><a href=\"http://bit.ly/LsrCXG\" rel=\"nofollow\">http://bit.ly/LsrCXG</a></p>\n<p>Any suggestions on how to correct the code to make all the Buttons look spacial-y correct again?</p>\n<p>2.<br />\nCheckout with PayPal Button:<br />\nI need to also make sure that if the customer selects the &#8220;Checkout with PayPal Button&#8221; that the customer is also required to put a check-mark in the &#8220;I agree to Terms&#8221; checkbox. </p>\n<p>Currently, if they choose the &#8220;Checkout with Paypal&#8221; Button, they are allowed to completely by-pass the &#8220;I agree to Terms&#8221; Check Box and proceed straight to the Checkout page(without having to click the Checkbox).</p>\n<p>Is there some Code that I can add that requires Customers to Also have to put a check-mark in the Checkbox &#8211; before they are permitted to proceeed to the Checkout page &#8211; when they select &#8220;Checkout with Pay Pal&#8221; Button?</p>\n<p>3. How to Make the Text Following the Checkbox a LINK to the actual &#8220;Terms&#8221;:<br />\nIs there a way to make the &#8220;I Agree with the Terms&#8221; text &#8211; that immediately follows the checkbox &#8211; a LINK to the actual &#8220;Terms&#8221; page?</p>\n<p>Making this text (after the checkbox) LINK to the actual &#8220;Terms&#8221; &#8211; would enable the Customer to read the &#8220;Terms&#8221; before s/he checked the checkbox.</p>\n<p>4. Do I need to also use the &#8220;NoConflict&#8221; Script?<br />\nLike Maximilliano (above in the Comments) I added   id=”checkout”  to my cart.liquid file, right after   name=”checkout” .</p>\n<p>However, Unlike Maximilliano, I did NOT use/implement the &#8220;NoConflict&#8221; Script &#8211; but instead just used the &#8220;Standard&#8221; script that you first recommended in the tutorial.</p>\n<p>So, do you suggest I go back now and implement/use the &#8220;No-Conflict&#8221; Script &#8211; or is it OK for me to just stick with using the &#8220;Standard&#8221; Script that  I did implement?</p>\n<p>For instance, might the &#8220;No-Conflict&#8221; Script improve anything (like make the &#8220;Checkout Buttons&#8221; appear spacial-y correct on the Cart page)?</p>\n<p>Much Appreciated,<br />\nSanford</p>\n"}},{"node":{"content":"<p>Hi,</p>\n<p>I am experiencing the same problem as Andrew and Jake.</p>\n<p>Is there any solution for that?</p>\n<p>thank you,</p>\n<p>e</p>\n"}},{"node":{"content":"<p>Thanks Ryan! And yeah haha, we&#8217;ll keep this belt in our room 😉</p>\n"}},{"node":{"content":"<p>Nice work! Glad we are keeping the belt upstairs from those &#8220;designers&#8221; downstairs&#8230; 🙂</p>\n"}},{"node":{"content":"<p>Thank you Kemp! Miss ya bro.</p>\n"}},{"node":{"content":"<p>Love your work Tets! Keep it up.</p>\n<p>&#8211; Kemp</p>\n"}},{"node":{"content":"<p>Thanks this really helped me.</p>\n<p>If I have set up the checkbox so that it only shows when products with a certain tag are in the cart, how would I change the jQuery script so that it only works when the checkbox exists?</p>\n<p>At the alert comes up even if the checkbox isn&#8217;t showing on the cart? (I tried adjusting the script but my javascript &amp; jQuery skills are not good enough to get it to work). </p>\n<p>Any help would be appreciated. </p>\n<p>Cheers</p>\n<p>Raph</p>\n"}},{"node":{"content":"<p>Could you make something similar &amp; sell it on themeforest? I really like this style&#8230;.</p>\n"}},{"node":{"content":"<p>hey sean, shoot me an email tetsuro at shopify.com, I&#8217;ll see if I can help you out.</p>\n"}},{"node":{"content":"<p>Hey Sean, yes I found my pencil sharpener haha. Regarding my workflow, I highly recommend this book: <a href=\"http://www.vonglitschka.com/2010/12/24/vector-basic-training-book/\" rel=\"nofollow\">http://www.vonglitschka.com/2010/12/24/vector-basic-training-book/</a>. It&#8217;s like my bible when it comes to vector work lol</p>\n"}},{"node":{"content":"<p>Hi Tetchi</p>\n<p>Like the shaggy dog. Did you find your *** pencil in the end ? or did you get it vectorized ? Can I ask, how do you go about vectorizing a traced / drawn image?</p>\n<p>Sean</p>\n"}},{"node":{"content":"<p>Hi Tetsu,</p>\n<p>Many thanks for your script and instruction. Followed all steps and it didn&#8217;t work, then reverted to using appropriate first 4 steps and used No Conflict version at step 5, and all seems to work now, Great stuff, thanks </p>\n<p>Cheers</p>\n<p>sean</p>\n"}},{"node":{"content":"<p>No, Shopify themes can only be used on Shopify stores.</p>\n"}},{"node":{"content":"<p>I was wondering if this shopify theme could be use on other webstores too?</p>\n"}},{"node":{"content":"<p>I have the theme minimal, but I am having no luck getting the function to work.  I have tried to reset the product variants and product images, nothing.  The site still runs the same after cut and paste of the new code.  Has anyone tried to hot wire this to the minimal theme.  Do you Rockstars have any suggestions.  Thanks.</p>\n"}},{"node":{"content":"<p>Ah I had to change it because it had to be a &#8220;current&#8221; neighbourhood.I was actually thinking of changing it back to Bytowne for the final version, it sounds cooler.</p>\n"}},{"node":{"content":"<p>why didn&#8217;t you stick with  bytowne?</p>\n"}},{"node":{"content":"<p>That&#8217;s awesome. I agree with Jesse, would be great on a shirt.</p>\n"}},{"node":{"content":"<p>@Eddie @Jesse for you guys, anything! 🙂 I&#8217;ll try to make a screen for this in the future hehe</p>\n"}},{"node":{"content":"<p>Can I has this on a t-shirt?</p>\n"}},{"node":{"content":"<p>I need a print of this.</p>\n"}},{"node":{"content":"<p>haha thanks for watching guys!! Kev we gotta make a silly video for MYM like this!</p>\n"}},{"node":{"content":"<p>This is too awesome. It&#8217;s exactly the kind of animation I want for the first MYM video!</p>\n"}},{"node":{"content":"<p>PINGU!!!!! Also, I love the seal friend.</p>\n"}},{"node":{"content":"<p>This is simply fantastic! I have been able to get it to work without a hitch (so far) but did have a quick question that I am hoping one of you rockstars can help me with.  </p>\n<p>It appears as though this code overrides the &#8220;featured&#8221; image on the product page and displays the image associated with the first color listed.  Basically what I am getting at is, I have a detail image of each my products (not associated with any variant) that I would still like to display as the &#8220;featured&#8221; image.  Is this possible?  </p>\n<p>Any help would be greatly appreciated!</p>\n"}},{"node":{"content":"<p>Sure Marta, shoot me over an email at tetsuro at shopify.com and I can take a look. It&#8217;s just a matter of outputting {{ variant.inventory_quantity }} in its appropriate location 😛</p>\n"}},{"node":{"content":"<p>Hi Tetsuro, thanks so much for the code.<br />\nBut of course I have a question too 🙂<br />\nDo you by any chance know, what shall I add to this code so my barchart displays also quantity? Below or on top of the barchart?</p>\n"}},{"node":{"content":"<p>Thank you.  That&#8217;s super nice of you to share this info.  Any chance you would be able to do a tutorial using the Radiance theme to show how you could turn that template to sell one off items.  For example, when a customer clicks buys and goes through the pay pal process, I&#8217;d like it to show on the website that the product is sold.  Is it possible to add in code to this theme to enable this function for products that one off items?  What would you advise?  Cheers from NZ 😉</p>\n"}},{"node":{"content":"<p>Hi,<br />\nthanks, this was really helpful.<br />\nI seem to have the same problem as Mette, I don&#8217;t seem to get the checkbox to work. It takes me to the next step both with and without a checked box.</p>\n<p>It would be helpful if you could email me the whole section from theme.liquid to see if I have placed this wrongly in the  section as I am no programmer&#8230;</p>\n<p>I also need help on how to include a link to the actual Terms and Conditions in the cart, since they only appear on the next page (and its required that people actually can read them to accept them). This can be a separate popup page &#8211; have no clue on how to create this&#8230;</p>\n<p>Thanxs a lot for your help!</p>\n<p>Evy</p>\n"}},{"node":{"content":"<p>Hi, I am working with the free trial, and I am going to get the Adaptable template.<br />\nI&#8217;d like to know if there is the chance to apply this feature product by product. In other words, can i select to which products I want to upload this feature?<br />\nthanks</p>\n"}},{"node":{"content":"<p>I think I may have solved my earlier question by adding a conditional statement into the javascript code</p>\n<p>I first went about alerting the value of optionValue on all pages which returned a value of Default Title for products without variants.</p>\n<p>I then inserted the if statement into the second line of js:</p>\n<p> var optionValue = variant.options[{{ option_index }}];<br />\n   if(optionValue != &#8216;Default Title&#8217;) {<br />\n    var imageSrc = $(&#8220;#thumbs img[alt='&#8221;+optionValue+&#8221;&#8216;]&#8221;).attr(&#8216;src&#8217;);<br />\n    if (imageSrc != &#8216;undefined&#8217;) {<br />\n      //Change &#8216;_thumb&#8217; with the image size that you are using for the thumbnails<br />\n      imageSrc = imageSrc.replace(&#8216;_thumb&#8217;,&#8221;);<br />\n      $(&#8216;#active-wrapper img&#8217;).attr(&#8216;src&#8217;, imageSrc);<br />\n     }<br />\n   }</p>\n<p>Seems to be working well. Hope this helps out someone else. Cheers!</p>\n"}},{"node":{"content":"<p>This is great, thanks very much.</p>\n<p>One question though. I&#8217;ve implemented this successfully for products with a variant named Color. For products without a variant, the price no longer displays on the product details page.</p>\n<p>How can I have the price display for all products whether they have variants or not?</p>\n"}},{"node":{"content":"<p>Yep&#8230; cause I&#8217;ve been working on this! haha</p>\n"}},{"node":{"content":"<p>It&#8217;s been a while since you updated!</p>\n"}},{"node":{"content":"<p>Thank you so much!  Exactly the info I needed 🙂</p>\n"}},{"node":{"content":"<p>One huge issue I&#8217;m having (as is your demo) is getting the zoom functionality working after selecting an option. I&#8217;m using cloud-zoom on my project..would love anyone who has an idea how to accomplish. Great work so far!</p>\n"}},{"node":{"content":"<p>This is a great solution &#8211; Thanks for posting this!  I have one question&#8230;it seems that it works great for all product images with a Alt Tag.  But for products with no variants that don&#8217;t need an Alt Tag&#8230;it seems to conflict with the functionality of the rest of the page.  For instance, the images don&#8217;t even load and the main menu drop-down navigation does not work.  It seems that an Alt Tag for the Featured Image is mandatory, or it breaks functionality.  Any help would be greatly appreciated!</p>\n"}},{"node":{"content":"<p>Hi guys, I&#8217;m having the same issue as Andrew. </p>\n<p>The script runs when the customer clicks on the “Update Cart” button as well. Could you please help me resolve that? </p>\n<p>Also, the check box is appearing above the text and not in line for me and not sure how to fix that. </p>\n<p>Thanks in advance!</p>\n"}},{"node":{"content":"<p>Excellent post&#8230; worked straight away!<br />\nReally needed this to work in order to use SagePay and 3D Secure (UK).<br />\nThanks!</p>\n"}},{"node":{"content":"<p>@Kat: I&#8217;m using this snippet for displaying the associated product image in the cart <a href=\"https://gist.github.com/1946527\" rel=\"nofollow\">https://gist.github.com/1946527</a></p>\n"}},{"node":{"content":"<p>@Colin:  Thank you for posting your approach!  I read through your readme but I can&#8217;t figure out test steps</p>\n<p>1) include the script in your layout template<br />\n  {{ &#8216;shopify.variantimages.js&#8217; | asset_url | script_tag }} </p>\n<p>? &#8211; Do I insert this line into theme.liquid. If so can I put it anywhere?</p>\n<p>2) Copy this right before the &#8220;new Shopify.OptionSelectors(&#8221; line.</p>\n<p>? &#8211; In what file / asset am I looking for the &#8220;new Shopify.OptionSelectors(&#8221; line?  I did a search in theme.liquid but could not find the line of code there. </p>\n<p>Thanks &#8211; I still a rookie but I take instruction well.</p>\n<p>@Tetchi &#8211; Thanks for sharing your insight and getting this started.  If anyone needs to know how to build a surfboard then feel free to ask me 🙂</p>\n"}},{"node":{"content":"<p>@Kat Unfortunately not right now, I will work on a solution when I have time!</p>\n"}},{"node":{"content":"<p>Hello! Thank you so much for this &#8211; it&#8217;s just the feature I needed! I was wondering if there was a way to have the correct thumbnail image reflected in the cart so that it shows the selected variant? Right now, the thumbnail in the cart defaults to the featured image of the product page&#8230;</p>\n<p>Thank you!</p>\n"}},{"node":{"content":"<p>@Brad: Awesome! I&#8217;m honoured 🙂 Your theme friggin rules!</p>\n<p>@Colin: Awesome implementation, using filename makes a lot of sense. I need to do what you and Caro do and put my stuff on Github! </p>\n<p>@Tony: Please shoot me and email at tetsuro at shopify.com, and I can help you out.</p>\n"}},{"node":{"content":"<p>UPDATE: I added 2 different colors with &#8220;Create a new variant&#8217; and I see the two options in a drop down on the product page however it still doesn&#8217;t seem to be working. For the variants I am setting the color as the title&#8230; am I doing this correctly? I notice in the screen shot you have &#8216;COLOR&#8217; and than the colors under that but I am not sure sure how this was done as I am unable to create &#8216;Sub-variants&#8217; under the title&#8230; unless I am missing something?</p>\n<p> I am not sure if that is wrong or if the code is. Here&#8217;s is what the area of my product.liquid looks like. I appreciate any help you can offer.</p>\n<p>\t{{ product.description }} </p>\n<p>\t&lsaquo; See more {{ product.type | link_to_type }}. </p>\n<p>{% assign option_to_match = &#8216;Color&#8217; %}<br />\n{% assign option_index = 0 %}<br />\n{% for option in product.options %}<br />\n  {% if option == option_to_match %}<br />\n    {% assign option_index = forloop.index0 %}<br />\n  {% endif %}<br />\n{% endfor %}</p>\n<p>// &lt;![CDATA[<br />\nvar selectCallback = function(variant, selector) {<br />\n  if (variant &amp;&amp; variant.available == true) {</p>\n<p>       var optionValue = variant.options[{{ option_index }}];<br />\n    var imageSrc = $(&quot;#thumbs img[alt=&#039;&quot;+optionValue+&quot;&#039;]&quot;).attr(&#039;src&#039;);<br />\n    if (imageSrc != &#039;undefined&#039;) {<br />\n      //Change &#039;_thumb&#039; with the image size that you are using for the thumbnails<br />\n      imageSrc = imageSrc.replace(&#039;_thumb&#039;,&#039;&#039;);<br />\n      $(&#039;#active-wrapper img&#039;).attr(&#039;src&#039;, imageSrc);<br />\n    }</p>\n"}},{"node":{"content":"<p>Hi guys.</p>\n<p>I am trying to get this working but do not understand where to put this code. I&#8217;m not an expert but I know the basics and my way around code so I&#8217;m hoping I could implement this feature myself with your help. </p>\n<p>I am using the monochrome theme and searched my product.liquid file for the text you mentioned above to replace the code to hide the thumbnails but I cannot find anything with &#8216;&lt;ul id=&quot;thumbs&quot;&#039; in there. Am I looking at the wrong file? </p>\n<p>Could you guys let me know how to do this step by step with Monochrome? I appreciate ANY help you can give me with this.</p>\n<p>Thank you!</p>\n"}},{"node":{"content":"<p>Great article tetchi!  </p>\n<p>Last year I had a client that asked for this functionality but also wanted clicking on the thumbnail to change the selected variant.</p>\n<p>I made them upload images with the option names in the filename.  This also makes sense when you look at the files on their filesystem so they didn&#8217;t mind.</p>\n<p>Anyways, I thought I would post it up to my github (<a href=\"https://github.com/cmcdonaldca/Shopify.VariantImages.js\" rel=\"nofollow\">https://github.com/cmcdonaldca/Shopify.VariantImages.js</a>) and maybe someone will take the best of both.  Or just use yours&#8230; which is great as it is!</p>\n<p>Colin</p>\n"}},{"node":{"content":"<p>Awesome post, Tets! </p>\n<p>I&#8217;ve included this new feature in the Responsive theme based on your tutorial.</p>\n"}},{"node":{"content":"<p>Thanks guys 🙂 Jamie, I will send you the deets for our next one when it&#8217;s announced!</p>\n"}},{"node":{"content":"<p>Nice one Tetsu! Where are the design challenges distributed? I need to get these too!</p>\n"}},{"node":{"content":"<p>OMG!! I LOVE IT! Only you can come up with something like that! Very well done too!</p>\n"}},{"node":{"content":"<p>Thanks Mark!</p>\n"}},{"node":{"content":"<p>Really great tutorial. Thanks Tets!</p>\n"}},{"node":{"content":"<p>Hey Rachel, Brendon &#8211; shoot me an email if you&#8217;d like a hand 🙂</p>\n"}},{"node":{"content":"<p>haha sweet! That&#8217;s what I like to hear 🙂</p>\n"}},{"node":{"content":"<p>Thank you for this tutorial, it worked beautifully! I&#8217;m in the process of deciding whether or not to switch to Shopify from a WordPress cart and this particular feature is something i really wanted, so your tutorial is a +1 for Shopify for me ;o)</p>\n"}},{"node":{"content":"<p>Woo hoo!</p>\n<p>A question with a long history. Great to read it all &#8211; sad to say I&#8217;m so inept I can&#8217;t make it work&#8230;</p>\n<p>I think I&#8217;m having a problem with the id input but not really sure!</p>\n<p>Got the check box up which was great but, then&#8230;</p>\n<p>Any help greatly appreciated!</p>\n"}},{"node":{"content":"<p>hey Tetchi,</p>\n<p>Great tutorial, thanks for this.</p>\n<p>Mine does not appear to be working. Would you be able to take a look?</p>\n<p>It might be that I have added 2 checkboxes?<br />\nOr that I have done something wrong with naming the id as checkbox (I didn&#8217;t understand that part fully)</p>\n<p>thanks for your help<br />\nRachel 🙂</p>\n"}},{"node":{"content":"<p>@Yasuko No worries!! 🙂</p>\n"}},{"node":{"content":"<p>tetchi, my site works good!<br />\nthank you for you help!</p>\n"}},{"node":{"content":"<p>@Yasuko @Brian @mkengi shoot me an email and I&#8217;ll see what I can do! I&#8217;m just fixing up some of the code in this article, so I may not be able to get to you right away. </p>\n"}},{"node":{"content":"<p>^ Hey guys, sorry I made some silly mistakes. </p>\n<p>1) As Czarto pointed out, I messed up on of the variable names.<br />\n2) I forgot to include a really key line of code. Hopefully this will fix the above problems in Couture.</p>\n"}},{"node":{"content":"<p>Hi Tetchi,<br />\nThank you very much for this post.</p>\n<p>Like, thelovedone above, I’ve been trying to incorporate this into my site, but with no success. I’m using the Couture theme. I am confusing at step 3. This may be too stupid to ask, but I don&#8217;t know witch file to add those codes you mentions on step 3. In other words, where I can find &#8220;selectCallback&#8221; function&#8230;? </p>\n<p>If you could help me out,  I would really appreciate it !!! </p>\n<p>Thank you!</p>\n"}},{"node":{"content":"<p>Nice Kitt! Good call 🙂</p>\n"}},{"node":{"content":"<p>Hi Tetsuro, nice work with the code.</p>\n<p>I prefer to use radio buttons to show the variants of my product. How can I move the bar chart for each variant to display next to the radio button for the variant?</p>\n<p>Thanks for your help</p>\n"}},{"node":{"content":"<p>Ordered the book through le bibliotheque</p>\n"}},{"node":{"content":"<p>Hi tetchi</p>\n<p>This is exactly what need, but i can&#8217;t get it to work. I have tried this in many different ways. I am missing something totally, but i cant figure it out. Even if i use Radiance theme to match yours (just for test). Any pointers or noob mistakes that i might be doing?</p>\n<p>Thanks</p>\n"}},{"node":{"content":"<p>This is the final javascript I ended up using.   Some notes:</p>\n<p>1. You will notice that I added a condition.  If no match is found on the ALT text of them thumbnails, then it will attempt to wildcard match on the filename.<br />\n2. I am using _small images for my thumbnails, and so during the replace I swap them to the _grande version<br />\n3. I am grabing only the first word from my variant tile, as in my store, my variant comes out as &#8220;Black Ladies 5&#8221;, whereas I only want the color.</p>\n<p>    if( variant &amp;&amp; variant.title ) {<br />\n        var colourName = variant.title.replace(/^(\\w+)(.*)/, &#8216;$1&#8217;);<br />\n        var imageSrc = $(&#8220;#thumbs img[alt='&#8221;+colourName+&#8221;&#8216;]&#8221;).attr(&#8216;src&#8217;);<br />\n        if( !imageSrc ) { // Try to match based on image src filename<br />\n            imageSrc = $(&#8220;#thumbs img[src*='&#8221;+colourName.toLowerCase()+&#8221;&#8216;]&#8221;).attr(&#8216;src&#8217;);<br />\n        }<br />\n        if (imageSrc) {<br />\n            $(&#8216;#featured img&#8217;).attr(&#8216;src&#8217;,imageSrc.replace(&#8216;_small&#8217;, &#8216;_grande&#8217;));<br />\n        }<br />\n    }</p>\n<p>Hope this is helpful to someone.</p>\n"}},{"node":{"content":"<p>This is great stuff!</p>\n<p>I think in this line of the selectCallback js:<br />\n       $(&#8216;#active-wrapper img&#8217;).attr(&#8216;src&#8217;,imageName);</p>\n<p>imageName should actually be imageSrc like so:<br />\n       $(&#8216;#active-wrapper img&#8217;).attr(&#8216;src&#8217;,imageSrc);</p>\n"}},{"node":{"content":"<p>I believe you have one line of javascript extra highlighted that shouldn&#8217;t be:</p>\n<p>var selectCallback = function(variant, selector) {</p>\n<p>Maybe I&#8217;m missing something, but I had to exclude this line of code as it already existed in my .liquid</p>\n"}},{"node":{"content":"<p>Hi Tetchi</p>\n<p>I too have couture as a base and can&#8217;t seem to get it to work. I&#8217;m certain it&#8217;s something I&#8217;m doing wrong. </p>\n<p>I don&#8217;t see the exact callback code above your blue code in my product.liquid (other callbacks are there however), so I&#8217;m not sure exactly where to paste it. Also, I&#8217;m unsure what the appropriate name of the image id should based on this theme which uses cloudzoom.</p>\n<p>I have a password on my store which is: &#8220;temp&#8221;</p>\n<p>And here is a link to a test product with variants and alt tags all ready to go: <a href=\"http://goo.gl/74Xfz\" rel=\"nofollow\">http://goo.gl/74Xfz</a></p>\n<p>I hope you can help.<br />\nThanks,<br />\nBrian</p>\n"}},{"node":{"content":"<p>Thanks guys! 🙂</p>\n"}},{"node":{"content":"<p>Such a superb concept &#8211; and beautifully executed, love it!</p>\n"}},{"node":{"content":"<p>Hmm, it&#8217;s really hard to say without seeing your shop. What&#8217;s the URL of your shop?</p>\n<p>EDIT: Oops, I see that your URL is there, but since it&#8217;s password-protected I won&#8217;t be able to tell what&#8217;s wrong. </p>\n"}},{"node":{"content":"<p>Hi tetchi</p>\n<p>I&#8217;ve been trying to incorporate this into my site but with no success. I&#8217;m not using the Radiance theme (using the Couture theme as a base), but I tried to rework the div calls in the script to match mine. The theme does use the selectCallback function, but I still couldn&#8217;t figure out exactly where to put each snippet of code. I&#8217;ve tried it a dozen different ways, and it&#8217;s hard to tell at what point it&#8217;s not working since it doesn&#8217;t break anything. If you have time to help me out I&#8217;d really appreciate it, this is a great feature that I&#8217;d love to incorporate.</p>\n<p>Thanks!</p>\n"}},{"node":{"content":"<p>Hey Dave, I definitely agree with you there. I think what might be better is if I check to see if the alt tag title includes the variant title. That way, you could have the something more meaningful, like &#8220;Orange tee shirt&#8221; as the alt tag, and check to see if the variant title &#8220;Orange&#8221; is in it.</p>\n<p>I&#8217;ll see if I can get around to that when I get a chance! Thanks for the feedback 🙂</p>\n"}},{"node":{"content":"<p>Interesting approach. I guess the only thing that would keep me from using it is the fact that the alt tag of an image is meant to describe the image. In this case, Orange as the variant title and Orange as an alt tag is benign, but it will rarely be so easy with 2, 3, or more word variant titles. </p>\n<p>It would be awesome for the technique if the Admin would offer the ability to inject a data- attribute with whatever code you wanted, like a variants SKU for example. You could then use the same Javascript pattern, and not hurt the image search SEO. </p>\n<p>Any, it is progress and for n00bs with simple variants, will do just fine! Thanks for the example and for pointing out the image alt feature.</p>\n"}},{"node":{"content":"<p>Hmm, the way it&#8217;s set up in this tutorial, you can only have one image per variant. This tutorial&#8217;s really meant to be a simple &#8216;base&#8217; for variant/product-image association, so I hope someone awesome comes up with a solution for multiple images per variant :). You could potentially set it up so that the Javascript checks for which product images&#8217; alt tags <em>include</em> the variant title (instead of looking for an exact match, as it is now) and then show those images!</p>\n"}},{"node":{"content":"<p>Nice! What if each color has multiple images (e.g. back and front)?!</p>\n"}},{"node":{"content":"<p>Holy crap tets you make words sexy</p>\n"}},{"node":{"content":"<p>Thanks guys!</p>\n"}},{"node":{"content":"<p>Looks amazing Tets! Great job 🙂</p>\n"}},{"node":{"content":"<p>Awesome job Tets! I love how clean the design is and how the type reminds me of Hiragino, which makes it all that much more Japanese.</p>\n"}},{"node":{"content":"<p>haha, thanks Caro! And thanks for the tip on kerning, I&#8217;m definitely going to adjust that.</p>\n"}},{"node":{"content":"<p>Very beautiful, Tets! God damn it, you are so good at so many things. If I did not love you, I&#8217;d hate you! 😛</p>\n"}},{"node":{"content":"<p>Hey Rob, ya I have no idea how &#8220;Skill&#8221; is calculated &#8230; :\\</p>\n"}},{"node":{"content":"<p>Yeah, Battlefield 3 is pretty damned awesome. For what it&#8217;s worth, my skill in Battlelog is 232, but I&#8217;m not very good . . .</p>\n"}},{"node":{"content":"<p>haha thanks man! I think I&#8217;m hooked on bf3 because I seem to be actually good at it (compared to like sc2 which I&#8217;ll never be good at haha). I totally forgot about that skill stat, what does that even mean!? lol</p>\n"}},{"node":{"content":"<p>Man, you&#8217;re such a boss at this game! I lost interest a bit because I don&#8217;t have the patience, always run around like a headless chicken and get shot from all sides. Last time my &#8220;Skill&#8221; on the profile page was -92 😛</p>\n"}},{"node":{"content":"<p>Hey Mr. Piggy, I&#8217;m actually not too sure which popup you&#8217;re referring to. Can you point me to a specific page that&#8217;s showing that popup?</p>\n"}},{"node":{"content":"<p>Hey Andrew, it looks like all of your products are sold out, so I can&#8217;t test out the cart page 🙁</p>\n"}},{"node":{"content":"<p>Gah! Sorry for that Jo, it looks like I messed up the pagination in WordPress. Taking a look now&#8230;.</p>\n<p>UPDATE: I&#8217;ve fixed the pagination issue. Thanks for catching that!</p>\n"}},{"node":{"content":"<p>Hey tetsuro this is great!<br />\nI&#8217;ve been looking for this scrip for a while, glad i came across to your site.<br />\nI do have a small question, how do you remove or change the &#8220;this page at <a href=\"http://ABCD.myshopify.com\" rel=\"nofollow\">http://ABCD.myshopify.com</a> says&#8221; on the pop-up screen?<br />\nI would rather to have my primary domain name shown, other than the shopify one.</p>\n<p>Once again thank you for your time and love your work!</p>\n<p>Regards,</p>\n<p>Mr.Piggy</p>\n"}},{"node":{"content":"<p>Lol &#8211; just found the rest of the post here &#8211; <a href=\"http://blog.tetsutakara.com/1156/creating-a-threadless-like-add-to-cart-button-using-jquery-and-ajax/2/\" rel=\"nofollow\">http://blog.tetsutakara.com/1156/creating-a-threadless-like-add-to-cart-button-using-jquery-and-ajax/2/</a></p>\n"}},{"node":{"content":"<p>Hey all, just following through the tutorial and yes, pretty sure there&#8217;s been a couple of stages missed.<br />\nThe AddToCart function isn&#8217;t defined anywhere?</p>\n"}},{"node":{"content":"<p><a href=\"http://www.blackstarchocolates.com\" rel=\"nofollow\">http://www.blackstarchocolates.com</a>  Thanks for taking a look!</p>\n"}},{"node":{"content":"<p>Birgit and Andrew: It sounds like an issue with the jQuery selector. What are your shop&#8217;s URLs?</p>\n"}},{"node":{"content":"<p>Great tutorial, got it installed quickly, with only a minor bug I&#8217;m curious about.  The script runs when the customer clicks on the &#8220;Update Cart&#8221; button as well, which isn&#8217;t catastrophic, but is confusing.  If they check the box, update their cart, the checkbox returns to un-checked.  Again, not catastrophic, but confusing.  Any thoughts on a fix?</p>\n<p>Best,<br />\nAndrew</p>\n"}},{"node":{"content":"<p>I got it. 🙂</p>\n"}},{"node":{"content":"<p>haha, well I hope you F**KING GOT IT!!! I should tone it down lol. But honestly the book rules.</p>\n"}},{"node":{"content":"<p>best part of this post is the caption of the photo!</p>\n"}},{"node":{"content":"<p>I couldn&#8217;t get this to work either&#8230; I&#8217;m using a heavily customized helvetica theme&#8230; I&#8217;d really like to be able to use this but just no dice&#8230;</p>\n<p>I&#8217;m not sure but would it be anything to do with the use of the javascript statement &#8216;return false;&#8217; in the onclick button? It looks like that may be stopping the calling of the addItem function?</p>\n<p>Any ideas Tets?</p>\n<p>Thanks<br />\nRick</p>\n"}},{"node":{"content":"<p>Hey, that looks like it was a lot of fun. How long was the entire process, would you say? Also, when are we going to see MYM shirts on Shopify? 😉</p>\n"}},{"node":{"content":"<p>Hi,<br />\nI&#8217;ve following problem:<br />\nI installed everything following the instruction, but now it gives me always an alert box &#8211; whatever I do. For example, if i&#8217;m adding a product to my cart it also tells me &#8220;xxx was added to your shopping cart / with an ok button&#8221;.</p>\n<p>Any solution here?</p>\n"}},{"node":{"content":"<p>Oi, I figured this one out myself 🙂 I works perfectly. So thankfull for this script.</p>\n<p>/Christian O</p>\n"}},{"node":{"content":"<p>Frikkin sweet!! I&#8217;m glad you guys found this handy!</p>\n"}},{"node":{"content":"<p>OMG! I need to do this for school too, and this has helped a LOT! Thank You!</p>\n"}},{"node":{"content":"<p>Hi Tetsuro,</p>\n<p>Great script! This is (almost) exactly what I need.</p>\n<p>If I combine some of your script with &#8220;Gift wrapping&#8221; (by Caroline Schnapp) I might be able to insure that our costumers<br />\n1) will add packaging<br />\nand<br />\n2) wont be able to remove it?</p>\n<p>I was thinking about hiding the check box and making it &#8220;pre checked&#8221; &#8211; is this even possible?</p>\n<p>Anyways, GREAT tutorial 🙂 Easy to understand and very well written.</p>\n<p>Our page is <a href=\"http://www.cckis.dk\" rel=\"nofollow\">http://www.cckis.dk</a></p>\n<p>Thanks 🙂</p>\n"}},{"node":{"content":"<p>David: thanks! I&#8217;m glad you found it useful!</p>\n"}},{"node":{"content":"<p>Yep, that shouldn&#8217;t be an issue. However, if you&#8217;re using noConflict mode for your other scripts, make sure the script from this tutorial is in noConflict mode as well.</p>\n"}},{"node":{"content":"<p>Awesome, thanks Jeffrey! I&#8217;m glad someone found it useful!  🙂</p>\n"}},{"node":{"content":"<p>Great post man! I&#8217;ve been searching for hours for this info, and I finally hit the motherload for exporting maya objects. Thanks you!</p>\n"}},{"node":{"content":"<p>Hey Tetsuro, </p>\n<p>Thanks for the tutorial.  Is it possible that this won&#8217;t work if there are other jQuery scripts running on the cart? For example my store has a jQuery script for a &#8220;gift&#8221; box that, when checked, generated additional customer input boxes.  Will adding another checkbox complicate this? Thanks</p>\n<p>Dan</p>\n"}},{"node":{"content":"<p>Thanks for this Tetsuro!  I am launching my site next week and I needed this functionality built in.  I was able to add it to my site in less than 20 minutes following your step by step guide.</p>\n<p>It&#8217;s not often I find a useful 2 year old post on anything tech related&#8230;</p>\n"}},{"node":{"content":"<p>Hi Tets,</p>\n<p>I can&#8217;t figure out what I have done. I can&#8217;t seem to click add to cart at all now. Does it work with slate theme?</p>\n<p>I am not too familiar with js but your tut looked pretty straightforward so I gave it a go. Can you take a look at my shop for me? Password is unibox11 for the storefront. Need to get it sorted pretty soon as my launch is Tuesday.</p>\n<p>J</p>\n"}},{"node":{"content":"<p>Hey Jamie! I used Photoshop for this, I suck at using Illy haha. I&#8217;ll have to ask the others for permission to put it up, will let you know on Monday!</p>\n"}},{"node":{"content":"<p>Nice work Tetsuro! Illy or PS? Where can I see your competition?</p>\n"}},{"node":{"content":"<p>thanks Caro 😛</p>\n"}},{"node":{"content":"<p>I like this one a lot.</p>\n"}},{"node":{"content":"<p>Sweet! Thanks for reading, Ed!</p>\n"}},{"node":{"content":"<p>Great post Tetsuro! I love reading stuff like this.</p>\n"}},{"node":{"content":"<p>hey, thanks Henray-ray! Dude, get workin&#8217; on your blog! 🙂</p>\n"}},{"node":{"content":"<p>Beautiful post! Definitely got a sense of all the greatness that I had to miss out on. I especially enjoyed the part about Robert&#8217;s work. Keep up the flow of posts, I will soon try to join in!</p>\n"}},{"node":{"content":"<p>Hey Andrew,</p>\n<p>Hmm&#8230; I don&#8217;t think I&#8217;ve left anything out. What&#8217;s your store&#8217;s URL? Maybe I can take a look and help out.</p>\n<p>Cheers,</p>\n<p>Tets</p>\n"}},{"node":{"content":"<p>I&#8217;m having trouble getting this to work. Is there anything assumed you didn&#8217;t mention. Other scripts etc.. I&#8217;m using my own theme with this. Thanks</p>\n"}},{"node":{"content":"<p>Actually, in order for this to work, you&#8217;ll need to define the total of each variant for each product, and this could be tricky if it&#8217;s different for all products. Notice that in BonkTown they have text indicating &#8220;Total Qty Offered: x&#8221;. You&#8217;ll have to define what this value is going to be before this can be implemented.</p>\n"}},{"node":{"content":"<p>Ah okay, now I see it. I&#8217;ll see what I can do when I get home tonight from school, but it&#8217;s def. possible!</p>\n"}},{"node":{"content":"<p>Hello Tetsuro,</p>\n<p>It is something simpler than in your example, instead of showing a segmented bar for each product variant, should be a unique bar segment, showing the total of all remaining stock of the product without specify each variant inventory, you can see an example here: <a href=\"http://www.bonktown.com/\" rel=\"nofollow\">http://www.bonktown.com/</a></p>\n<p>You see, although there are several variants to choose sizes and colors, there is only one bar stock (Qty Remaining), just below the &#8220;Time Remaining&#8221;, with the total quantity available product. The bars of each variant are not needed, right below the video it would be like your first example.</p>\n<p>Thanks!</p>\n"}},{"node":{"content":"<p>Hmm, I thought that&#8217;s what I did in my example, I&#8217;m not sure if I get what you mean. Do you have an example of it somewhere that you can perhaps show me?</p>\n<p>Thanks,</p>\n<p>Tetsu</p>\n"}},{"node":{"content":"<p>Nice Work Tetsuro! </p>\n<p>This is something I could use, but what I need it is a little different, I´m looking for how to make just one color bar with all the product inventory on it.</p>\n<p>The idea is to group the total of the inventory of a product (with different colors and sizes) in just one bar of one color.</p>\n<p>I don´t want to show the total of the product variants (color or sizes) with divisions on the bar, I need to show on the bar for the total of &#8220;shirts&#8221;.</p>\n<p>In your example, I would want to show the available stock of the total of 10 shirts. Not how many are available of each size.</p>\n<p>Is there any way to do this?</p>\n<p>Thank you!!</p>\n"}},{"node":{"content":"<p>Sweet, check out my test store <a href=\"http://brakus-llc255.myshopify.com/products/business-focused-full-range-capability\" rel=\"nofollow\">here</a>. I&#8217;ve made one bar chart with divisions in it &#8211; is this what you were looking for? Let me know and I can help implement it to your store as well.</p>\n<p>There are 3 variants here: 2 small, 5 medium, and 3 large. The bar chart gets divided up into different colors proportionately. </p>\n"}},{"node":{"content":"<p>That should be doable very easily by modifying the CSS of the divs. You can float each &#8216;slice&#8217; of the bar to the left so that they only fill up one bar. I&#8217;ll try something out on a test store, and get back to you.</p>\n"}},{"node":{"content":"<p>Hi Tetsuro, thanks for your answer.</p>\n<p>Lets say that for example I have 15 t´shirts on my store, 5 are red, 5 blue and 5 black.</p>\n<p>Right now I have one stock bar for each color product, so in my product page I see 3 bars, one for each product color.</p>\n<p>What I am trying to do is to have just one bar grouping the 3 product variants, so I only have one bar with the total of t-shirts available.</p>\n<p>Thanks!</p>\n"}},{"node":{"content":"<p>Nope > Sorry for the late reply &#8211; been a little busy finishing school 😛 Is the 50 the total inventory for that one product? If so, you can use the &#8216;total_inventory&#8217; variable that I created in the Javascript code above, and output it where you want it.</p>\n<p>Victor >Thanks for the kind words, Victor! Hmm, so you&#8217;re looking to do one bar that has &#8216;slices&#8217; of each variant, correct? Or, could you perhaps show me an example of what you&#8217;re looking for?</p>\n"}},{"node":{"content":"<p>Oh yes!I have a question Tetsuro! I really like your stock bars because it is something that visually looks very good for customers, but I would like to display a single bar showing the total of all the variants that are in stock, because I like visually only bar instead of a bar per variant. Any suggestions to help me? Thank you very much! I love your blog!</p>\n"}},{"node":{"content":"<p>Thanks!  🙂</p>\n"}},{"node":{"content":"<p>DIG IT!!!!</p>\n<p>You&#8217;s a talented young man, Mr. Takara.</p>\n"}},{"node":{"content":"<p>Thanks Adri! I will send one again, I promise 🙂</p>\n"}},{"node":{"content":"<p>Loves it! Where&#8217;s my pin, Tets?! q:</p>\n"}},{"node":{"content":"<p>hmm, I&#8217;m trying something similar, but want to show the current inventory level compared to the original (say 5 remaining out of 50) because we are selling limited editions. I haven&#8217;t found support in Shopify for getting the original stock level, any ideas?</p>\n"}},{"node":{"content":"<p>Hey dude, </p>\n<p>Nice work 🙂</p>\n<p>I&#8217;ve done this same thing in mootools 1.3 (not the version that&#8217;s on the global asset area at shopify) if you&#8217;re interested in seeing the code just let me know.</p>\n<p>It makes no difference really, but I just prefer the way mootools code looks 😉</p>\n<p>darbotron</p>\n"}},{"node":{"content":"<p>does not work on Onyx theme.</p>\n"}},{"node":{"content":"<p>Good shit, thank you sir!</p>\n"}},{"node":{"content":"<p>Thanks Adri!</p>\n"}},{"node":{"content":"<p>Amazing job, Tets!  It looks great.  Congrats on your hard work!</p>\n"}},{"node":{"content":"<p>Thanks so much for this. I have a lot of liability and need to have customers select this option!</p>\n<p>I&#8217;m new to all this however, and can&#8217;t seem to get it to work. I think adding the # sign is the most confusing part. The Agree box has shown up, but I&#8217;m still able to go through the checkout without it checked.</p>\n<p>Also, curious, where to add the text for the terms and conditions? That should be a link for another pop-up, yes?</p>\n<p>Thanks in advance,<br />\nLaura</p>\n"}},{"node":{"content":"<p>Hi Tetsuro,</p>\n<p>Many thanks for the tutorial. It is working brilliantly with most browsers on our shopify site &#8211; except with Opera which happily lets you checkout whether you check the box or not. (I&#8217;m currently testing with Opera 9.2). Anything I can add to the script to get Opera to work? (I tried both scripts and both fail with Opera).</p>\n<p>Many thanks</p>\n"}},{"node":{"content":"<p>Brent: Thanks a bunch for your help and input. Do you think it&#8217;s a bad thing if pressing &#8216;enter&#8217; calls the function as well? Personally I think it&#8217;s okay to leave it as is because some people may choose to tab into the submit button and push enter.</p>\n<p>Mette: Sorry I couldn&#8217;t get back to you sooner, but good to know you got your logo working. It seems like the cart page is working as well. Please let me know if you need any help.</p>\n<p>CJ: Strange, it shouldn&#8217;t be refreshing anything. Can you post the URL to your store? Thanks.</p>\n"}},{"node":{"content":"<p>Thanks Alejandro!</p>\n"}},{"node":{"content":"<p>sweet! I´m new to shopify and very much appreciate your work!</p>\n"}},{"node":{"content":"<p>Thank you Falcadia!</p>\n"}},{"node":{"content":"<p>I have followed the instructions, but I am still having an issue. When you click on the go to checkout button, it just refreshes the page, no pop-up or anything. It doesn&#8217;t matter whether the boxed is check or not.What should I look for in solving this issue.</p>\n<p>Thanks<br />\nCJ</p>\n"}},{"node":{"content":"<p>Btw, I solved the logo thing.</p>\n"}},{"node":{"content":"<p>Thanks for a great tutorial!</p>\n<p>I do have a problem though. The checkbox is there but not checking it does not cause a pop up. I followed the steps and read the advice above &#8211; any clues for me?</p>\n<p>I&#8217;m completely new at html and would appreciate any help!</p>\n<p>My store is <a href=\"http://shop.endomondo.com/\" rel=\"nofollow\">http://shop.endomondo.com/</a></p>\n<p>Thanks!</p>\n<p>Mette</p>\n"}},{"node":{"content":"<p>Great tutorial!</p>\n<p>Do you by any chance also have one on how to insert a logo to the Minimify theme? </p>\n<p>That would be really helpful too.</p>\n<p>Mette</p>\n"}},{"node":{"content":"<p>Cool Tetsuro.  A few comments:</p>\n<p>Grabbing the submit event would make the func fire on BOTH the click AND &#8216;enter&#8217; key press.   </p>\n<p>example: jQuery(&#8220;#checkout&#8221;).submit(function(){</p>\n<p>Also, Kevin, revisiting that input value, I think I would look for the value of the field instead of checking for null.  Like this:</p>\n<p>FOR EMPTY   if(jQuery(’#kevinsNumber’).val()==&#8221;){<br />\nFOR A VALUE   if(jQuery(’#kevinsNumber’).val()>=&#8217;3&#8242;){</p>\n<p>cheers,<br />\n~ brent</p>\n"}},{"node":{"content":"<p>Yo Kevin.  Instead of checking for a checked checkbox, which the answer is either yes or no, you want to look at the value of a text field input.</p>\n<p>So looking above at Tetsuro&#8217;s example at the top of the page, you need to replace his live 5 with this:</p>\n<p>  if(jQuery(&#8216;#kevinsNumber&#8217;).attr(&#8216;value&#8217;) == null){</p>\n<p>So that will look at your input with an id=kevinsNumber, and see if it has a value.  If it does, then it will continue and submit the form on the next line.  If not his code pops a js alert.</p>\n<p>If you wanted to make sure the number was at least &#8220;3&#8221; or whatever, do this:</p>\n<p>  if(jQuery(&#8216;#kevinsNumber&#8217;).attr(&#8216;value&#8217;) &gt;= 3){</p>\n<p>Peace out.  Hope that helps ya.<br />\n~ brent</p>\n"}},{"node":{"content":"<p>This is great, but not quite what I am trying to do.  I actually need to require a number in a textarea.  How do I alter this to require the text field to not be empty and to be a numerical entry?</p>\n"}},{"node":{"content":"<p>Hello, I came across this blog article while searching for help with JavaScript. I have recently switched browsers from Chrome to IE. Now I seem to have a issue with loading JavaScript. Everytime I browse page that needs Javascript, my computer freezes and I get a &#8220;runtime error javascript.JSException: Unknown name&#8221;. I can&#8217;t seem to find out how to fix the problem. Any help is greatly appreciated! Thanks</p>\n"}},{"node":{"content":"<p>Awesome. Simple and easy. thanks for the tutorial.</p>\n"}},{"node":{"content":"<p>hey Marco, can you post the URL to your store? Maybe looking at your source code will help me figure out what&#8217;s going on.</p>\n<p>Cheers,</p>\n<p>Tets</p>\n"}},{"node":{"content":"<p>Hello,</p>\n<p>I can not install this fonction. it doesn&#8217;t work.<br />\nPerhap&#8217;s I miss something.</p>\n<p>1st thing I still have the jquery-1.3.2.min.js<br />\nIt was include in the theme.<br />\nI have the Reconfigured templates.. .Perhap&#8217;s it&#8217;s the reason why&#8230;</p>\n<p>I did add the checkbox in cart.liquid= OK<br />\nI didn&#8217;t add this code cause it was still in my theme:&#8221;{{ &#8216;jquery-1.3.2.min.js&#8217; |asset_url  | script_tag }}<br />\n&#8221;<br />\nI did replace:<br />\n    &raquo;<br />\nby<br />\n    &raquo;<br />\n(I add # at checkout)</p>\n<p>I had try with the noConflict mode too&#8230;</p>\n<p>If I put # before checkout nothing happened except a refresh&#8230;</p>\n<p>If I take of the # in the cart.liquid I&#8217;m in the checkout page&#8230;</p>\n<p>I had try to change the js file name as jqueryalert.js&#8230;<br />\nSame problem&#8230;<br />\nCan some one help me?</p>\n"}},{"node":{"content":"<p>Hi Mandy,</p>\n<p>Just took a look at your site&#8217;s source code, and it doesn&#8217;t look like you&#8217;ve inserted the jQuery framework (step 2-3), as well as the Javascript code (step 5). Both of these are required in order for this to work.</p>\n<p>Please go over the steps again and let us know how it goes.</p>\n"}},{"node":{"content":"<p>Does anyone have any feedback they can supply to me? I researched over the weekend and am still not getting the checkbox to work. Please help!! I appreciate it very much.</p>\n"}},{"node":{"content":"<p>Hello Tetsuro:<br />\nI am having problems with getting the pop-up to well pop-up if the box is not check. I have uploaded the code I am using and where I placed it. If you could help at all I would appreciate it. Im stuck, big time.</p>\n<p><a href=\"http://i124.photobucket.com/albums/p32/graphicmaniac/themeliquid.jpg\" rel=\"nofollow\">http://i124.photobucket.com/albums/p32/graphicmaniac/themeliquid.jpg</a><br />\n<a href=\"http://i124.photobucket.com/albums/p32/graphicmaniac/cartliquid.jpg\" rel=\"nofollow\">http://i124.photobucket.com/albums/p32/graphicmaniac/cartliquid.jpg</a></p>\n<p>Thanks so much to all of you!</p>\n"}},{"node":{"content":"<p>Thanks Jamie!  🙂</p>\n"}},{"node":{"content":"<p>Nice one Tetsuro!</p>\n"}},{"node":{"content":"<p>Hi Stefan, hmm I&#8217;m not sure if I fully understood your comment. Are you trying to check if the user has Javascript enabled?</p>\n<p>Thanks for reading!</p>\n"}},{"node":{"content":"<p>*ups* &#8211; long time no HTML post :/</p>\n<p>Just drop me a mail for the source 🙂</p>\n"}},{"node":{"content":"<p>Thanks Tetsuro!</p>\n<p>Adding in </p>\n<p>\t\t\t\t\t\tjQuery.noConflict();<br />\n\t\t\t\t\t\tjQuery(&#8216;#checkoutButton&#8217;).html(&#8221;);</p>\n<p>\t\t\t\t\t\tPlease enable Javascript to proceed with checkout!</p>\n<p>your shoppers have to enable Javascript before actually even being able to submit.</p>\n"}},{"node":{"content":"<p>hi tetsuro,<br />\nyes it works like a charm now! thank you.</p>\n"}},{"node":{"content":"<p>Hey there Philippe, greetings from Ottawa :). I think I know exactly what&#8217;s going on here. From what I see from the two screenshots, it looks like the code that you inserted (which I wrote in jQuery) is conflicting with the MooTools script that you are using for the multiple options dropdown.</p>\n<p>To fix this, please use the noConflict mode script that I have above, instead of the first script. This should make it so that my script won&#8217;t make the MooTools script for multiple options go bonkers.</p>\n<p>Let me know how that goes!</p>\n"}},{"node":{"content":"<p>hi tetsu, great tutorial and thanks for sharing. I installed it on <a href=\"http://www.swingcity.me\" rel=\"nofollow\">http://www.swingcity.me</a> and it works but it changed the checkout layout. you can see the screenshots here: <a href=\"http://picasaweb.google.de/swingcheese/FreePixs?feat=directlink\" rel=\"nofollow\">http://picasaweb.google.de/swingcheese/FreePixs?feat=directlink</a><br />\nit&#8217;s not too important but maybe you know a solution.<br />\nthank you in advance and best regards from berlin,<br />\nphilippe</p>\n"}},{"node":{"content":"<p>Hi Caroline, thanks for the great feedback! I especially liked the comment about the sandwich :), I definitely want to avoid that. </p>\n<p>You are absolutely right about the header. It does take up quite a large amount of vertical real estate, and this will definitely be a problem for 13&#8243; laptops. I&#8217;m going to think about making the header a bit smaller, or maybe even make it so that the bunny + bubble is only present on the index page. </p>\n<p>Thanks again for your comments Caroline! You rock!</p>\n"}},{"node":{"content":"<p>For people who don&#8217;t need to scroll to see both header and footer I totally see why this header works better than the span-across-black. No sandwich. But besides the sandwich, this variation has grown on me already and I appreciate it more now. I looks better. </p>\n<p>I was wondering if there could be a skip to content link for people who use laptop like me. Header takes quite a bit of vertical space. Really need to scroll to content each time. But then again, I would hate if I were you to add something to that header. I always prefer to remove rather than add, you know.</p>\n"}},{"node":{"content":"<p>Looks great, Tetsu. I like the span-across header too. I like both variations: that other one and this one. Your pattern is fantastic!!! and it has just the right intensity the way you use it for your background now. The width of your content is optimal, and so is text size. Your blog is very readable (something I always appreciate immensely). Most people use laptops to read you, I would assume (or maybe my brain is farting). Styling for the &#8216;active&#8217; menu item is a nice touch. And that menu is just perfect by the way. I am glad you&#8217;re using your iconic piggy head (or is it rabbit slash pig).</p>\n<p>Your old theme looked professional by the way. It&#8217;s all relative 🙂 the stakes have been raised higher with this new theme. It&#8217;s better, yeah. Better than great.</p>\n"}},{"node":{"content":"<p>Tetsuro,</p>\n<p>Brilliant Jquery &#8211; altho I did stuble on the id=&#8221;checkout&#8221;, eventually figured to put that in my cart.liquid file, right after name=&#8221;checkout&#8221;.</p>\n<p>I presumed it would just work &#8211; which it almost did.  Had to use the no conflict script, but hey &#8211; it&#8217;s great.</p>\n<p>Thank you for taking the time to write a nice, simple to follow set of rules, for us newbies!!</p>\n"}},{"node":{"content":"<p>I guess you just used an if-statement that would output the checkbox only if the {{ item.product.title }} matched that of the specific product eh?</p>\n<p>Exactly! Not tricky really.</p>\n"}},{"node":{"content":"<p>&gt; Would you recommend using noConflict mode for all themes?</p>\n<p>Definitely.</p>\n"}},{"node":{"content":"<p>Jamie: Cool thanks! Man, that does sound a bit tricky. I guess you just used an if-statement that would output the checkbox only if the {{ item.product.title }} matched that of the specific product eh?</p>\n<p>Gavin: Thanks! Would you recommend using noConflict mode for all themes? I typically write jQuery code normally (with the $), but perhaps this is bad practice&#8230; I did mention noConflict mode in my write-up though 🙂 </p>\n<p>Caroline: Thanks Caroline! I&#8217;m actually not very good with Javascript, so your comment was very reassuring 🙂</p>\n"}},{"node":{"content":"<p>This is beautiful jQuery code. It could not be any better. Lovely. Vert good tutorial. All details in place, very clear. Pretty too. Fun.</p>\n<p>Aaaaaahhhhhhh.</p>\n"}},{"node":{"content":"<p>Thanks for the tutorial Tetsuro. Nice job!</p>\n"}},{"node":{"content":"<p>Nice write-up Tetsuro!<br />\nI had to do this a few weeks ago for a client. Mine was a bit trickier though. This could only be present in the cart if 1 certain item was present, which required a three month recurring charge commitment. It also had to allow for a combination of that item plus other items. So I added a conditional to the class name on the checkbox for jquery to hook that would change depending on IF that one item was in the cart or not.</p>\n"}},{"node":{"content":"<p>Thank you Caroline! 🙂</p>\n"}},{"node":{"content":"<p>This card looks great!</p>\n<p>You&#8217;re a pro, Tetsu!</p>\n"}},{"node":{"content":"<p>Thanks guys!</p>\n"}},{"node":{"content":"<p>Hey Tets, awesome work. Love the logo!</p>\n"}},{"node":{"content":"<p>Both, website and cards are looking really good! Great job Tets! 🙂</p>\n"}},{"node":{"content":"<p>Thanks for the compliments Mark, and thanks again for your tips!</p>\n"}},{"node":{"content":"<p>Looks amazing! Having the photos pop out is a great idea &#8211; compliments the design nicely.</p>\n"}},{"node":{"content":"<p>Cool, thanks guys! The settings form is definitely a kick-ass feature in Shopify!</p>\n"}},{"node":{"content":"<p>Once again, a great follow-up tutorial! Can&#8217;t wait to deploy custom theme settings in the themes that I&#8217;m developing!</p>\n"}},{"node":{"content":"<p>Wanted to express my gratitude for this great tutorial as well! Was very easy to follow and expand to achieve what I wanted! Ryan above has a good point. I might also mention that when you first save your stylesheet in liquid format you may momentarily lose the styling on the frontend. But this was alleviated as soon as I updated the layout.css.liquid file!</p>\n"}},{"node":{"content":"<p>Great tutorial, I am going to integrate Theme Settings in my next Shopify theme.</p>\n"}},{"node":{"content":"<p>Hey Tets, good work man.</p>\n<p>Just wanted to note that you might want to create a back-up of your CSS before you &#8220;Liquidize&#8221; it. Just in case that you want to revert to your original styles without having to change your settings form completely.</p>\n<p>Good stuff &#8211; keep it up!</p>\n"}},{"node":{"content":"<p>awesome, thanks man! Let me know if you see anything that can be fixed/improved 🙂</p>\n"}},{"node":{"content":"<p>Very cool, Tetsuro, really enjoying your tutorials. Keep on rocking!</p>\n"}},{"node":{"content":"<p>Hey man. Great first tutorial. I know nothing of shopify&#8230;.but now&#8230;if I ever need to, I know how to set up conditional statements for metadata.</p>\n<p>Keep up the good posts!</p>\n<p>lata<br />\ngrant</p>\n"}},{"node":{"content":"<p>Thanks Soleone, note taken. &#8220;unless&#8221; can definitely be useful in some cases.</p>\n<p>How&#8217;s the weather in Germany? 🙂</p>\n"}},{"node":{"content":"<p>John &#038; Mark: Oh grow up, guys!</p>\n<p>Amanda: Thanks Amanda! I&#8217;m going to do my best to keep this blog alive. lol</p>\n"}},{"node":{"content":"<p>Hey Tetsuro! Awesome site!! Can&#8217;t wait to see what else you&#8217;ll be blogging about!</p>\n"}},{"node":{"content":"<p>Nice blog, Tets! I really like the design. </p>\n<p>One thing worth mentioning is also that you can use *unless* instead of *if* to ask for the opposite:</p>\n<p>{% if template == &#8220;page&#8221; %}<br />\n       {% unless page.handle == &#8220;about-us&#8221; %}<br />\n              You are on any page, but NOT About us<br />\n       {% endif %}<br />\n{% endif %}</p>\n"}},{"node":{"content":"<p>Second!</p>\n"}},{"node":{"content":"<p>First!</p>\n"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"battlefield-3"}}