{"data":{"wordpressPost":{"title":"Japan Trip 2015 Part 7: Back to Osaka","content":"<p>\t\t\t\tThe shenanigans continued when we arrived in Osaka. We dropped off our bags at the AirBnB and immediately went for drinks. It was Mike and Sharhan&#8217;s last night in Japan so we decided to go hard.</p>\n<p><!--more--></p>\n<h2>Osakan humour</h2>\n<p>The one thing you must know about Osakans is that they have an impeccable sense of humour. To get an idea of Osakan humour, I encourage you to watch this video:</p>\n<style>.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }</style>\n<p class='embed-container'><iframe src='https://www.youtube.com/embed/WknMhk9J_EE' frameborder='0' allowfullscreen></iframe></p>\n<div class=\"sub\">Osakans are so jokes. Potato quality but worth the watch.</div>\n<p>We experienced this first hand when we were hanging out in Dotombori. An elderly couple were mounting their bicycles as we passed by them when the woman on the bike toppled over on to her side. As we helped the woman up, the man goes, &#8220;Ohh&#8230; I&#8217;m sorry, higé-sorii (ヒゲソーリー)&#8221;. <em>Higé-sorii</em> translates to &#8220;razor&#8221;, and this little rhyme is one of those deliberately lame jokes that people say for a little chuckle. We thought it was hilarious at how he prioritized spitting rhymes over helping his poor wife.</p>\n<h2>Shar and Mikey&#8217;s last night</h2>\n<p>We started our night off by hitting up Daruma, a restaurant that specializes in deep-fried skewers. This is one of my favourite places to eat in Osaka, and I ate there multiple times when I was in Osaka in 2013. They offer a plethora of deep-fried meats and veggies, accompanied by unlimited lettuce and dipping sauce. You can order a set menu, order individual pieces, or both.</p>\n<p><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2015/11/kushikatsu.jpg\" alt=\"kushikatsu\" width=\"800\" height=\"1200\" class=\"alignnone size-full wp-image-4722\" srcset=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2015/11/kushikatsu.jpg 800w, https://www.tetchi.ca/tetchi/wp-content/uploads/2015/11/kushikatsu-200x300.jpg 200w, https://www.tetchi.ca/tetchi/wp-content/uploads/2015/11/kushikatsu-768x1152.jpg 768w, https://www.tetchi.ca/tetchi/wp-content/uploads/2015/11/kushikatsu-683x1024.jpg 683w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></p>\n<div class=\"sub\">Kushikatsu at Daruma. Mm mmm.</div>\n<p>The contrast between the deep-fried goodies and the fresh, crispy lettuce made for amazing mouthfeels.</p>\n<p>After kushikatsu we walked over to the Amerikamura for more drinks. Amerikamura is a district with lots of rad shops, bars and clubs.</p>\n<p>We couldn&#8217;t really decide on a place to drink, so we just kept re-upping on beers at a convenience store and drinking on the streets. This cycle continued for about two hours. When our legs gave out we decided to stop by a bar ran by a Jamaican fella. We asked him to direct us to the most bumpin club, and he generously drew us the most technical map in the world:</p>\n<p><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2015/11/osaka_map.jpg\" alt=\"osaka_map\" /></p>\n<div class=\"sub\">We found the club somehow using this map</div>\n<p>We were pretty intoxicated at this point but we managed to find the place. It was another all-you-can-drink joint so naturally we went hard. We drank there until closing time and drunkenly stumbled home. I somehow lost just my phone case in the process.</p>\n<h2>The next morning</h2>\n<p>There was a bit of a panic the next morning when we woke up, hungover as shit. We completely overslept and Mikey and Sharhan were afraid that they&#8217;d missed their flights. We booked it to the nearest train station to sent them on their way. Luckily they ended up making their flight on time and went home safe and sound.</p>\n<p>Gary and I had a couple of more nights to kill before heading back home, so we wandered around Osaka, shopping, eating, and enjoying our last days in Japan. By this point we&#8217;d experienced a lot of Japan, but there was one craving that was not yet satisfied.</p>\n<p>&#8230; that craving was&#8230;</p>\n<h2>Kobe beef!</h2>\n<p>One of the many things that Gary wouldn&#8217;t shut the fuck up about was Kobe beef. He was dead-set on trying it at least once while in Japan.</p>\n<p>On our last night in Japan we decided to ball out and hit up a Kobe beef BBQ restaurant. We ate <em>a lot</em> of amazing food in Japan, but Kobe beef was hands down the best meal to enter out mouths. The meat would just melt in our mouths.</p>\n<p><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2015/11/kobe-beef.jpg\" alt=\"kobe beef\" /></p>\n<p>One of the chefs was at our table the whole time and cooked everything to perfection. I&#8217;m pretty sure we ate every part of a cow. It was so damn good.</p>\n<h2>Last day</h2>\n<p>At this point in the trip we were broke as hell. On the morning of our flight, we mustered up whatever change we had left and had some breakfast at a nearby bakery. We got to enjoy the savoury goodness of Japanese curry bread one last time.</p>\n<p><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2015/11/running_on_fumes.jpg\" alt=\"running_on_fumes\" /></p>\n<div class=\"sub\">Runnin on fumes!</div>\n<p>After breakfast we took the train out to Kansai Airport and flew back home. Thus concludes our excellent adventures in Japan.</p>\n<h2>Takeaways</h2>\n<ul>\n<li>Osakans are hilarious.</li>\n<li>Kobe beef and kushi-katsu are must-eats.</li>\n<li>Osaka is like a grungier Tokyo. More swag and attitude. I&#8217;d go as far as to say that it&#8217;s my favourite Japanese city.</li>\n</ul>\n<hr />\n<p><a href=\"/japan-trip-2015/\">← Back to Japan Trip 2015 index</a>\t\t</p>\n","wordpress_id":4281},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"japan-trip-2015-part-7-back-to-osaka","wordpressId":4281,"newerPostSlug":"japan-trip-2015-conclusion","olderPostSlug":"japan-trip-2015-part-6-tokyo"}}