{"data":{"wordpressPost":{"title":"Shopify Tutorial: Conditional Statements in Liquid and Metadata","content":"<p>One question I see often in Shopify is “how do I make my metadata for the different pages on my store?”. I’m not sure how this affects ranking in search engines (in fact if anyone can clarify this for me, that would be awesome), but in this tutorial I will just show you how this is done. This tutorial will also serve as a refresher on how to use conditional statements with Liquid.</p>\n<h2 class=\"steps\">A Brief Overview of Conditional Statements in Liquid</h2>\n<p>Conditional statements are ways to tell Liquid (or any other programming language) to do something based on certain conditions. For example, you can tell the code &#8220;If  condition A is true, take action A. If condition B is true, take action B. If neither are true, take action C&#8221;. Below is an example of a conditional statement in Liquid:</p>\n<pre><code>\n{% if template == \"index\" %}\n       <span style=\"color:red\">You are on the index page!</span>\n{% elsif template == \"collection\" %}\n       <span style=\"color:green\">You are on the collection page!</span>\n{% else %}\n       <span style=\"color:blue\">You are on a page that is NOT the index page nor the collection page!</span>\n{% endif %}\n</code></pre>\n<p>The code above will output the line in red if the visitor is on the index page of the Shopify store. Conversely, it will output the line in green if the visitor is on the collection page of the Shopify store. If the visitor is on a page that is not the index page nor the collection page, it will output the line in blue.</p>\n<p><!--more--></p>\n<p>You can also have conditional statements within conditional statements. For example:</p>\n<pre><code>\n<span style=\"color:red\">{% if template == \"page\" %}</span>\n       <span style=\"color:green\">{% if page.handle == \"about-us\" %}</span>\n              You are looking at the About Us page!\n       <span style=\"color:green\">{% endif %}</span>\n<span style=\"color:red\">{% endif %}</span>\n</code></pre>\n<p>The code above will first run the conditional statement marked in red, which checks if the Liquid template that is currently being used is &#8220;page&#8221;. If it is, it will go to the next conditional statement below, marked in green. If not, it will go the end of the conditional statement, which will result in nothing being done.</p>\n<p>The conditional statement marked in green checks to see if the handle of the page is equal to &#8220;about-us&#8221;. If it is, it will output the line  &#8220;You are looking at the About Us page!&#8221;. If the handle of the page does not equal &#8220;about-us&#8221;, it will not do anything.</p>\n<p>By using a combination of if and elsif statements, as well as nested conditional statements, you can set up different metadata for every template or even for every different product, page, or collection that you may have.</p>\n<h2 class=\"steps\">1. Open theme.liquid</h2>\n<p>If you are editing directly through the Shopify admin, theme.liquid is accessed by going to Assets &gt; Theme Editor, and clicking on the thumbnail that has the label &#8220;theme.liquid&#8221;.</p>\n<p>If you are editing offline with Vision, open &#8220;theme.liquid&#8221; in the layout folder of your theme.</p>\n<h2 class=\"steps\">2. Add the Conditional Statements</h2>\n<p>The head section of your theme.liquid should look something like the code below. It may not look exactly the same because you may have extra Javascript or CSS files, but what&#8217;s important here is that the if-statement goes under the &#8220;Content-Type&#8221; meta tag.</p>\n<p>A Shopify theme can have up to 9 templates: article, blog, cart, collection, index, page, product, 404, and search. Each template corresponds to a specific section of a site &#8211; for example, &#8220;index&#8221; is the template used the first page of your Shopify store, and &#8220;product&#8221; is the template used for when you&#8217;re viewing a single product. In this example, we will be using 4 of the 9 available templates: index, page, product, and collection.</p>\n<pre><code>\n{% if  template == \"index\" %}\n      Index metadata goes here.\n{% elsif template == \"collection\" %}\n      Collection metadata goes here.\n{% elsif template == \"product\" %}\n      Product metadata goes here.\n{% elsif template == \"page\" %}\n      Page metadata goes here.\n{% endif %}\n\n{{ 'main.css' | asset_url | stylesheet_tag }}\n{{ 'option_selection.js' | shopify_asset_url | script_tag }}\n{{ content_for_header }}\n</code></pre>\n<p>In the code above, I am checking to see which of the four templates the visitor is currently seeing: index, collection, product, or page. Once this is done, you can enter in more conditional statements to set up metadata for specific pages, collections, or products.</p>\n<pre><code>\n<span style=\"color:red\">{% if  template == \"index\" %}</span>\n      Index metadata goes here.\n<span style=\"color:red\">{% elsif template == \"collection\" %}</span>\n      <span style=\"color:green\">{% if collection.handle == \"all\" %}</span>\n             Enter in metadata for 'all' collection here.\n      <span style=\"color:green\">{% elsif collection.handle == \"summer\" %}</span>\n             Enter in metadata for 'summer' collection here.\n      <span style=\"color:green\">{% endif %}</span>\n<span style=\"color:red\">{% elsif template == \"product\" %}</span>\n      <span style=\"color:blue\">{% if product.handle == \"t-shirt\" %}</span>\n             Enter in metadata for 't-shirt' product here.\n      <span style=\"color:blue\">{% elsif product.handle == \"baseball-hat\" %}</span>\n             Enter in metadata for 'baseball-hat' product here.\n      <span style=\"color:blue\">{% endif %}</span>\n<span style=\"color:red\">{% elsif template == \"page\" %}</span>\n      <span style=\"color:purple\">{% if page.handle == \"about-us\" %}</span>\n             Enter in metadata for 'about-us' page here.\n      <span style=\"color:purple\">{% elsif page.handle == \"contact-us\" %}</span>\n             Enter in metadata for 'contact-us' page here.\n      <span style=\"color:purple\">{% endif %}</span>\n<span style=\"color:red\">{% else %}</span>\n      Enter in default metadata in case none of the above conditions are met.\n<span style=\"color:red\">{% endif %}</span>\n</code></pre>\n<p>Using the format above, you can enter in different metadata descriptions and keywords for every different template, product, page, or collection. In this example, I only put two elsifs for each code block, but you can add as many elsif statements as you desire. Please click <a href=\"https://www.tetchi.ca/wp-content/uploads/2009/09/example_head.txt\">here</a> to see an example of what the head section of your theme.liquid might look like.</ol>\n<h2 class=\"steps\">Conclusion</h2>\n<p>As you can see, conditional statements can give you a lot of control over what is outputted on a page, and metadata is just one of many of its applications. In a future tutorial, I would like to go through how to accomplish the same thing with Liquid&#8217;s switch statements.</p>\n<p><strong>UPDATE 09/23/2009:</strong></p>\n<p>You can pretty much forget about using meta keywords for your sites &#8211; as explained by Google <a href=\"http://googlewebmastercentral.blogspot.com/2009/09/google-does-not-use-keywords-meta-tag.html\" target=\"_blank\">here</a>. You should still use meta description though!</p>\n"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"6f68d9a5-6188-56c3-8c49-c207d5e7bb63"}}