{"data":{"wordpressPost":{"title":"School&#8217;s Out FOR-EVER!","content":"<p>\t\t\t\tJust now, I handed in my last paper ever for school. I can&#8217;t believe it &#8211; <strong>I&#8217;M FINISHED UNIVERSITY!</strong> It was a long 5 years of Interactive Multimedia and Design at Carleton University, and there were countless sleepless nights, but I&#8217;m glad that I persevered and finished it. You may now start the video below.</p>\n<p style=\"max-width:480px;margin:0 auto 1.85em auto;\"><iframe title=\"YouTube video player\" width=\"380\" height=\"315\" src=\"http://www.youtube.com/embed/qga5eONXU_4\" frameborder=\"0\" allowfullscreen></iframe></p>\n<div class=\"sub\">Schoooooool&#8217;s out FO EVA!!!</div>\n<p>I thought I&#8217;d share some of my university experiences here.</p>\n<p><strong>Highlights:</strong></p>\n<ul>\n<li>Diving into the world of web. Learning HTML+CSS was a bunch of fun, and I will continue learning more about it after graduation.</li>\n<li>Learning how to make dynamic websites with PHP. My mind was blown when I got my first PHP script running, and learned how dynamic websites work.</li>\n<li>Co-op at NeuroLanguage and Shopify. Spending a year working for Shopify was a blast &#8211; it was so hard going back to school afterwards. I can&#8217;t wait to go back there fulltime in May. For future IMDers, I would highly recommend taking Co-op. It&#8217;ll really help you narrow down what you really want to do as a profession. Even if you don&#8217;t like your placement, at least you&#8217;ll find out what you don&#8217;t like to do, and you can still make connections.</li>\n<li>Learning Processing + Arduino. Programming things that are actually tangible was an awesome experience.</li>\n<li>Learning how to model, rig, animate etc. in 3D using Autodesk Maya. I hated this at first but grew to like it a lot. I will continue to do 3D as a hobby in the future.</li>\n</ul>\n<p><strong>Not-so-awesome times:</strong></p>\n<ul>\n<li>All-nighters in the labs that were hotter than Africa and smelled like B.O. <strong>PRO-TIP:</strong> Lining up 3 rolly-chairs and using it as a bed is actually really comfy.</li>\n<li>Having to use crappy computers in the labs that would randomly restart</li>\n<li>Having to use WebCT on a regular basis. Why do universities still use this piece of sh*t? There are so many better alternatives.</li>\n<li>Having to take courses that taught me absolutely nothing (I&#8217;m sure every program has these).</li>\n<li>Having to learn Macromedia Director. Seriously? It was 2007, and we still had to learn Director? Gimme a break (a year later they switched the course to Flash).</li>\n</ul>\n<p>It feels weird thinking that I don&#8217;t ever have to go back to campus, or worry about schoolwork. Even though Senior Project&#8217;s been done for a week now, I still wake up thinking that I have something I need to do for it. I can&#8217;t wait to go back to the 9-5 lifestyle, as it&#8217;ll leave me with more time to work on personal projects!  </p>\n<p>THE END</p>\n","wordpress_id":1462},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"schools-out-for-ever","wordpressId":1462,"newerPostSlug":"fitc-toronto-2011","olderPostSlug":"autodesk-maya-exporting-to-fbx"}}