{"data":{"wordpressPost":{"title":"2016 Postmortem","content":"<p>\t\t\t\t2016 is quickly coming to an end, and overall it was a great year for personal growth. In this post I share some of my biggest wins and things I want to do more of next year.</p>\n<p><!--more--></p>\n<h2>Win #1: Moving to Montreal</h2>\n<p>The biggest change for me this year was my <a href=\"https://www.tetchi.ca/adios-ottawa/\">move to Montreal</a>. I&#8217;d been wanting to move out of Ottawa for a while so I was really stoked to finally make it happen.</p>\n<p>Montreal has been great thus far. I&#8217;ve been having a blast meeting new people, picking up new hobbies (more on this later) and discovering great places to eat. I can definitely see myself staying in this fine city for a few more years.</p>\n<p><strong>2017 Goals:</strong> Explore more of the city, get more comfortable with speaking French.</p>\n<h2>Win #2: Getting my feet wet in the jazz scene</h2>\n<p>One thing that I&#8217;ve started doing since moving to Montreal is play jazz shows with my upright bass. I&#8217;d been studying jazz for quite some time now with a private teacher, but the fact that I wasn&#8217;t doing anything with it was picking away at me.</p>\n<p>In September I met up with some jazz musicians at an open jam and continued to attend every Saturday afternoon. I eventually became their regular upright bassist, and since then I&#8217;ve played two shows with them: one at a fancy Christmas party and another at <a href=\"http://lescalier-montreal.com/restaurant-bar/?lang=en\">l&#8217;Éscalier</a> in downtown Montreal.</p>\n<p>As I play more shows and perform more solos I can feel my confidence as a jazz bassist growing. Many jazz bassists can walk along to tunes, but being able to improvise solos puts one on a whole other level. I want to become a solid soloist that can turn heads.</p>\n<p><strong>2017 Goals:</strong> Continue playing shows and attending weekly jazz jams, as well as meet more musicians. Listen to more jazz bassists for inspiration (ex: Charles Mingus, Christian McBride).</p>\n<h2>Win #3: Growing as a front end developer</h2>\n<p>2016 was a great year on a professional level as well. I worked on a couple of components for use in the Shopify Admin, as well as the front end for the <a href=\"https://themes.shopify.com\">Shopify Theme Store</a> redesign, all of which helped flex my Javascript and accessibility muscles 💪.</p>\n<p>Outside of work, I did several writings and open source projects, including:</p>\n<ul>\n<li><a href=\"https://medium.com/shopify-ux/lessons-from-building-mobile-friendly-accessible-data-tables-1e05c6924eaf#.1qhcaulfh\">Writing about building mobile-friendly, accessible data tables</a>.\n<ul>\n<li>This one garnered quite a bit of attention on Twitter 🎉</li>\n</ul>\n</li>\n<li><a href=\"https://medium.com/@tetchi/fresh-meundies-for-everyone-ad137de52c12#.qqx5dpn51\">Writing about common web accessibility issues</a>  </li>\n<li><a href=\"https://shopify.github.io/liquid/\">Shipping Liquid Documentation redesign</a> with my good friend <a href=\"http://adamhollett.com/\">Adam Hollett</a></li>\n<li><a href=\"https://tetsuro.github.io/mtl-murals/\">Plotting out Montreal&#8217;s murals using the city&#8217;s open data</a></li>\n</ul>\n<p><strong>2017 Goals:</strong> Work on more open source projects, continue to solidify Javascript fundamentals, learn more ES6, play around with NodeJS and React.</p>\n<h2>Win #4: Getting rid of a bunch of possessions</h2>\n<p>As part of my move I got rid of a bunch of stuff that I no longer needed. This felt great and it was sweet to make some extra cash off of items that I&#8217;d never use again.</p>\n<p>One thing that I was really happy to get rid of was my car. Having a car was extremely convenient&#8230; but there was way too much overhead involved, including</p>\n<ul>\n<li>Gas</li>\n<li>Insurance</li>\n<li>Maintenance</li>\n<li>Parking</li>\n<li>Tire storage</li>\n</ul>\n<p>These factors made owning a car not worth it for me. Starting next month I plan on using a ride-sharing service such as Car2Go or Communauto.</p>\n<p><strong>2017 Goals:</strong> Be more aware of material possessions. Get rid of even more stuff. Don&#8217;t buy things that have very limited use.  Don&#8217;t buy another car.</p>\n<h2>Win #5: Learning to protect myself</h2>\n<p>In June I almost got my ass kicked on Bell St in Ottawa, a sort-of sketchy part of town. I was on my bike when I noticed a car parked like an asshole, right on the pedestrian crossing. I guess I must have stared too long because shortly after a big thug-looking dude popped out of the car and started confronting me. I was on my bike so I decided to just book it out of there, which I think was the best thing to do.</p>\n<p>When I moved to Montreal it just so happened that there was a Brazilian Jiu Jitsu (BJJ) gym a stone&#8217;s throw away from my apartment. I joined in September and have been hooked ever since, attending three to four times a week. It also turns out that my friend Bernardo is a brown belt in BJJ so I started training with him as well. He is the humblest dude I know and makes for a great teacher.</p>\n<p>I&#8217;m not expecting a Hollywood-style montage where I go back to Bell St and confront the meanie &#8211; most likely I&#8217;d still get my ass beat. However I want to become more confident when I get into sticky situations in the future and I feel BJJ helps with that.</p>\n<p><strong>2017 Goals:</strong> Continue attending BJJ class 3-4 times a week, keep working on technique, and start thinking about competing.</p>\n<h2>Win #6: Reducing the use of social media</h2>\n<p>Back in May I decided to get rid of Facebook. I was scrolling through my Timeline one day and I realized that I&#8217;m not getting any value out of it. I even had this distracting &#8216;twitch&#8217; where I&#8217;d check my feed every few minutes even though I wasn&#8217;t really seeking any information or updates in particular. Interesting enough I didn&#8217;t miss Facebook at all once I deleted my account. In just a couple of days my habit of opening a new tab and going to Facebook had died.</p>\n<p>I wish to continue to get rid of these types of distractions in my life. Admittedly, I do still use Twitter and Instagram from time to time. I like Twitter because I can share posts like this and other accomplishments like side projects and writings. Instagram is nice to share some cool life moments but I&#8217;ve been thinking about moving that to this blog.</p>\n<p><strong>2017 Goals:</strong> Think about what other social media and distractions I can remove from my life.</p>\n<h2>Other things I want to do more of next year</h2>\n<ul>\n<li>Travel more. I&#8217;ve got a trip to Iceland lined up in May with the girlfriend that I&#8217;m super excited about. What I&#8217;d do to go on another <a href=\"https://www.tetchi.ca/japan-trip-2015/\">epic trip with my homies</a> too&#8230;</li>\n<li>Read more: I dropped the ball on that this year, having only read two books 😢</li>\n</ul>\n<hr />\n<p>Here&#8217;s to a dope 2017, happy new year y&#8217;all. 🍻\t\t</p>\n","wordpress_id":5153},"allWordpressWpComments":{"edges":[{"node":{"content":"<p>I would love to hear about what fundamental things you learnt about yourself from your success this year.</p>\n","author_name":"Micheal","date":"December 30th, 2016"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"2016-postmortem","wordpressId":5153}}