{"data":{"wordpressPost":{"title":"Don&#8217;t Panic","content":"<p style=\"text-align:center;\"><img src=\"http://localhost:9999/wp-content/uploads/2013/08/HHGBookDontPanicJ.jpg\" alt=\"HHGBookDontPanicJ\" width=\"601\" height=\"354\" class=\"alignnone size-full wp-image-3717\" srcset=\"http://localhost:9999/wp-content/uploads/2013/08/HHGBookDontPanicJ.jpg 601w, http://localhost:9999/wp-content/uploads/2013/08/HHGBookDontPanicJ-300x177.jpg 300w\" sizes=\"(max-width: 601px) 100vw, 601px\" /></p>\n<p>Last week I met a girl with the words &#8220;Don&#8217;t Panic&#8221; (as pictured above) tattooed on her wrist. Not only did it remind me of how freaking awesome the <em>Hitchhiker&#8217;s Guide to the Galaxy</em> series is, but it was a nice little reminder to not stress out about the setbacks in life. </p>\n<p><!--more--></p>\n<p>About a year ago I hit an all-time low when I broke up with this wicked girl I was seeing. That kind of shit really messes with your self-esteem; I started to question if I&#8217;d meet another girl like her again, what I did wrong, etc. etc.  Needless to say I was down in the dumps for many months but I eventually realized there&#8217;s no point in worrying. It&#8217;s okay to make mistakes. Change is okay. The important thing is to actually learn from mistakes instead of beating yourself up about it over and over again. Since that realization I just kept my head up and started doing things to keep me busy. Meeting new people, starting personal projects, helping out more in the Shopify forums, getting the band back together, playing hockey for the first time since high school, visiting places I&#8217;ve never been to: all of these things have helped me move on. </p>\n<p style=\"text-align:center;\"><img src=\"http://localhost:9999/wp-content/uploads/2013/08/oh-shucks.png\" alt=\"oh shucks\" width=\"674\" height=\"228\" class=\"alignnone size-full wp-image-3742\" srcset=\"http://localhost:9999/wp-content/uploads/2013/08/oh-shucks.png 674w, http://localhost:9999/wp-content/uploads/2013/08/oh-shucks-300x101.png 300w\" sizes=\"(max-width: 674px) 100vw, 674px\" /></p>\n<div class=\"sub\">Emails like this from people I&#8217;ve never met were super freaking encouraging</div>\n<p>When I saw that girl&#8217;s tattoo I remembered all the crappy stuff that happened last year, but also remembered the progress I&#8217;ve made since. Although I&#8217;m not quite where I want to be in life, I still feel the drive to get there and I just have this good feeling that everything will turn out all alright. </p>\n<p>Anywho, just wanted to share my story of how one girl&#8217;s tattoo triggered some pretty bittersweet but moreso uplifting thoughts. I kind of want the same tattoo myself because it&#8217;s such a great reminder of how life is short and there&#8217;s absolutely no point moping around. So if you&#8217;re having a shitty day or going through a rough time, just remember Don&#8217;t Panic and everything will be fine 🙂</p>\n<p>Here&#8217;s a feel-good song to brighten up your day:</p>\n<p style=\"text-align:center;\">\n<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/gEtRA_omQlw\" frameborder=\"0\" allowfullscreen></iframe>\n</p>\n<div class=\"sub\">♪ If you don&#8217;t want to smile than fake it, if you got one potato bake it ♪</div>\n<p><small>Now, back to finishing up the Shopify Theme from Scratch series&#8230;\\(@_@)/</small></p>\n<p>PEACE</p>\n<p>tetchi\t\t</p>\n","wordpress_id":3716},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"dont-panic","wordpressId":3716,"newerPostSlug":"omodaka-combines-japanese-folk-with-chiptune","olderPostSlug":"theme-settings-lulz"}}