{"data":{"wordpressPost":{"title":"The Leafs finish last in the league, but I couldn&#8217;t be more excited","content":"<p style=\"text-align: center;\">\n<img src=\"https://www.tetchi.ca/wp-content/uploads/2016/04/leafs.png\" style=\"border: none;\" />\n</p>\n<p>Last night the Leafs lost to the New Jersey Devils, clinching the last place position in the league. You may be thinking &#8220;lol typical Leafs, such a crap team&#8221;. True, they finished last place in the league with an abysmal 29-42-11 record, but for me <strong>this has been the most exciting season to watch the Leafs</strong>.</p>\n<p><!--more--></p>\n<p>For me, the hype started when the Leafs acquired the legendary head coach Mike Babcock in May 2015. I remember reading rumours that he was going to go to either the Leafs or the Buffalo Sabres. After a decade of disappointment as a Leafs fan, I was pretty certain that he&#8217;d head to the Sabres&#8230; so when he signed a huge 8-year deal with the Leafs, I was <em>elated</em>. Not only was Babcock an amazing coach in Detroit, he also coached Team Canada to two gold medals at the 2010 and 2014 Olympics.</p>\n<p>The Leafs lost a lot of games during the 2015-2016 season, but it was hard to be upset at a team who  had arguably the worst roster on paper. Veterans Tyler Bozak and James van Riemsdyk were out for a good chunk of the season due to injuries, which didn&#8217;t help with the lack of scoring. Despite the losses, it felt like the team actually cared when they played under Babcock. Comparing this year&#8217;s team to last season&#8217;s post-collapse team is just night and day.</p>\n<p>Seeing our prospects such as William Nylander, Kasperi Kapanen, and Nikita Soshnikov called up near the end of this season was exciting. It was great to get a glimpse of the Leafs&#8217; future stars. Nylander in particular has been a lot of fun to watch &#8211; his skating and playmaking abilities has blown me away numerous times in the twenty-or-so games that he&#8217;s played.</p>\n<p>Mitch Marner is tearing it up in the OHL with the London Knights as well. He finished the season with a whopping 116 points in 57 games played, and is currently playing at a 2-points per game pace in the playoffs. I&#8217;m really hoping he gets called up to the Leafs next year. He is unfortunately too young to play for the Marlies next year, but I feel like after consecutive 100+ point seasons, he has outgrown the OHL.</p>\n<p>On top of all of this, the Leafs will be acquiring a top 4 pick at this year&#8217;s draft. Getting the highly-touted Auston Mathews would be <em>huge</em>, but I&#8217;d be happy with any of the top 4. Besides, Edmonton will likely get the first overall pick again&#8230;</p>\n<p>Speaking of draft, the Leafs are going into the draft with a whopping 12 draft picks, which is insane! I&#8217;m confident that the Leafs management can pick out some key pieces to the roster with these picks.</p>\n<hr />\n<p>It&#8217;s a great time to be a Leafs fan. For the first time in a while, I&#8217;m looking forward to the future of the Leafs.</p>\n<p><strong>EDIT 04/30/2016</strong>: HOLY SHIT we won the draft lottery! I&#8217;ll take one Auston Mathews, please.<br />\n<strong>EDIT 05/02/2016</strong>: HOLY SHIT we <a href=\"http://mapleleafs.nhl.com/club/news.htm?id=881114\">signed Zaitsev</a>! Keep the good news comin&#8217;.\t\t</p>\n","wordpress_id":4903},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"the-leafs-finish-last-in-the-league-but-i-couldnt-be-more-excited","wordpressId":4903,"newerPostSlug":"francais-friday-01","olderPostSlug":"accessibility-improvements-to-my-blog"}}