{"data":{"wordpressPost":{"title":"October 2018: It&#8217;s the Most Wonderful Time of the Year Edition","content":"\n\t\t\t\t\n<!--more-->\n\n\n\n<h2 id=\"mce_0\">Stuff that happened</h2>\n\n\n\n<p>October is my favourite month. The temperature drops to a nice 10-15 degrees, the leaves start to change to a beautiful red-orange-yellow hue, and most importantly the NHL season begins. This year we were also blessed with an epic UFC fight, the release of the much-anticipated video game Red Dead Redemption 2, and the legalization of weed.</p>\n\n\n\n<p>October was a really good month for sports. The Leafs had a decent start to the season, finishing the month with a 8-4-0 record. The only shitty thing was that my boy Auston Matthews got injured near the end of the month. This totally blows because I love watching him play and he&#8217;s by far the best player on the Leafs. I&#8217;m hoping for a speedy recovery for the kid.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"http://localhost:9999/wp-content/uploads/2018/10/auston-matthews-1.jpg\" alt=\"\" class=\"wp-image-7003\"/></figure>\n\n\n\n<p>The UFC fight between McGregor and Khabib was absolutely insane. It was a really hyped up fight as both fighters are amazing in their own ways and there&#8217;d been a lot of bad blood between the two. We all lost our minds when Khabib choked McGregor out and during the <a href=\"https://globalnews.ca/news/4524631/khabib-mcgregor-ufc-brawl/\">ensuing shenanigans</a>. Best UFC event I&#8217;ve seen, hands down!</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"http://localhost:9999/wp-content/uploads/2018/10/khabib-submitting-conor.jpg\" alt=\"\" class=\"wp-image-6991\" srcset=\"http://localhost:9999/wp-content/uploads/2018/10/khabib-submitting-conor.jpg 1700w, http://localhost:9999/wp-content/uploads/2018/10/khabib-submitting-conor-300x169.jpg 300w, http://localhost:9999/wp-content/uploads/2018/10/khabib-submitting-conor-768x432.jpg 768w, http://localhost:9999/wp-content/uploads/2018/10/khabib-submitting-conor-1024x576.jpg 1024w, http://localhost:9999/wp-content/uploads/2018/10/khabib-submitting-conor-1568x882.jpg 1568w\" sizes=\"(max-width: 1700px) 100vw, 1700px\" /><figcaption>Khabib submitting Conor. Photo credit: <a href=\"https://www.usatoday.com/story/sports/ufc/2018/10/07/ufc-229-khabib-nurmagomedov-submits-conor-mcgregor-main-event/1554875002/\">USA Today</a></figcaption></figure></div>\n\n\n\n<p>In mid-October we went on a weekend cottage getaway to Mont Tremblant with a group of friends. We rented a cottage right by the lake where we spent the weekend drinking, playing boardgames, and making tasty meals.</p>\n\n\n\n<p>One of the highlights of this trip was the hike up <a href=\"https://domainesaintbernard.org/https://domainesaintbernard.org/\">Domaine Saint Bernard</a>. The fall colours were beautiful and the view of the hills was breathtaking. Near the top we were greeted by a friendly group of chickadees. I put a bit of grass on top of Kylea&#8217;s head to see if they&#8217;d fly on top of her head, and lo and behold, it worked! One-by-one they would land on her toque, making for some sweet photo-ops.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><img src=\"http://localhost:9999/wp-content/uploads/2018/10/kylea-with-chickadee.jpg\" alt=\"\" class=\"wp-image-6994\" width=\"471\" height=\"627\"/><figcaption>Kylea and her new chickadee friend. 🐦</figcaption></figure></div>\n\n\n\n<p>Finally, a great event occurred on October 18th; Canada legalized marijuana! In a world where weed is still seen as a dangerous, evil drug, it&#8217;s unreal to see it legalized here at home.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"http://localhost:9999/wp-content/uploads/2018/10/canada-weed-flag.jpg\" alt=\"\" class=\"wp-image-7034\"/><figcaption>Canada, fuck yah!!</figcaption></figure></div>\n\n\n\n<p>The SQDC (Quebec&#8217;s government-run marijuana shops) were having trouble keeping anything in stock so unfortunately I haven&#8217;t gotten a chance to buy legal weed yet. It&#8217;s going to be so cool to look back to this day in 10 years and think &#8220;oh yeah, remember when weed used to be illegal?&#8221;.</p>\n\n\n\n<p>It really is awesome to see Canada be on the forefront of weed legalization and I hope other countries follow suit in the future.&nbsp;</p>\n\n\n\n<h2>What I learned</h2>\n\n\n\n<p>This month I continued to learn more React, TypeScript, Jest, and GraphQL. I picked up a lot of techniques and best practices, and in the case of GraphQL learned a ton about queries and mutations.</p>\n\n\n\n<p>To get myself up to speed I decided to do some extracurricular GraphQL learning. I found the free tutorial series below by <a href=\"https://www.youtube.com/channel/UCW5YeuERMmlnqo4oq8vwUpg\">The Net Ninja</a>&nbsp;to be extremely helpful.</p>\n\n\n\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/videoseries?list=PL4cUxeGkcC9iK6Qhn-QLcXCXPQUov1U7f\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>The content was exactly what I was looking for and the length of the videos were just right (informative, but not too long). The tutorials did a solid job explaining how to communicate between the Node server (backend) and the React app (frontend), which was something I was really curious about.</p>\n\n\n\n<p>On a side note, I friggin&#8217; love how some people put out videos like this for free. I felt like I&#8217;d be cheating him by not offering anything in return, so I made sure to send a little donation after I was done.</p>\n\n\n\n<p>All in all I felt like I made some great strides in my FED journey and I&#8217;m happy to be getting more familiar with these new libraries and languages. Gotta keep the momentum going!</p>\n\n\n\n<h2>What I&#8217;ve been playing</h2>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"http://localhost:9999/wp-content/uploads/2018/10/spider-man-ps4-hero-1-1.jpg\" alt=\"\" class=\"wp-image-7064\" srcset=\"http://localhost:9999/wp-content/uploads/2018/10/spider-man-ps4-hero-1-1.jpg 1600w, http://localhost:9999/wp-content/uploads/2018/10/spider-man-ps4-hero-1-1-300x169.jpg 300w, http://localhost:9999/wp-content/uploads/2018/10/spider-man-ps4-hero-1-1-768x432.jpg 768w, http://localhost:9999/wp-content/uploads/2018/10/spider-man-ps4-hero-1-1-1024x576.jpg 1024w, http://localhost:9999/wp-content/uploads/2018/10/spider-man-ps4-hero-1-1-1568x882.jpg 1568w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" /></figure>\n\n\n\n<p>Last month I picked up the new <em>Spider-Man</em> game for PS4 and I had a chance to complete it this month. I knew going in that I would like this game as it borrows a lot from Rocksteady&#8217;s <em>Batman: Arkham</em> series, which I absolutely loved. I was stoked to finally play a AAA Spider-Man game as he is my all-time favourite superhero.</p>\n\n\n\n<p>What I loved most about&nbsp;<em>Spider-Man</em> was the web-swinging mechanic. Zipping around the massive New York City map was so damn satisfying. The game offers fast travel between points on the map, but not once did I use it. Having just gone to New York City for the <a href=\"https://www.tetchi.ca/august-2018-big-30-in-nyc-edition/\">first time in August</a>, I had a really fun time zippin&#8217; around looking for famous landmarks. 🗽</p>\n\n\n\n<p>My only gripe with <em>Spider-Man</em> was that the boss fights were too easy. With that said the story, the graphics, and the combat totally made up for it.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"http://localhost:9999/wp-content/uploads/2018/10/red-dead-redemption-2-1.jpg\" alt=\"\" class=\"wp-image-7037\"/></figure>\n\n\n\n<p>This month also saw the release of Rockstar&#8217;s new game, <em>Red Dead Redemption 2</em>.&nbsp;<em>Red Dead Redemption 2</em> </p>\n\n\n\n<p>I&#8217;m only about an hour into the game but I love it so far. The graphics, the details, and the story are all amazing. My girlfriend is going away for work in November and I plan to play the shit out of <em>Red Dead Redemption 2</em>&nbsp;then.&nbsp; Yeehaw 🤠</p>\n\n\n\n<h2>What I read</h2>\n\n\n\n<p>This month I read <em>Blood, Sweat, and Pixels: The Triumphant, Turbulent Stories Behind How Video Games Are Made</em> by Jason Schreier. The book covers the development of ten video games and the many challenges the developers faced. It seemed like a miracle that some of these games ever saw the light of day!</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><img src=\"http://localhost:9999/wp-content/uploads/2018/10/blood-sweat-pixels-cover.jpg\" alt=\"\" class=\"wp-image-6972\" width=\"274\" height=\"411\"/></figure></div>\n\n\n\n<p>I enjoyed reading about the games that I&#8217;ve played in the past, which were The Witcher 3, Stardew Valley, Diablo 3, and Destiny. It was cool to learn about the roadblocks they had to overcome such as&nbsp;technical difficulties, creative blocks, time constraints, publisher pressure, and more.</p>\n\n\n\n<p>The story that stuck with me the most was the development of the 2016 farm simulator <a href=\"https://stardewvalley.net/\"><em>Stardew Valley</em></a>. When I moved to Montreal a couple of years ago and wasn&#8217;t socializing much, I sunk over a hundred hours into this game. Little did I know that this addictive and insanely polished game was made by a single person. The developer, Eric Barone, did all of the programming, artwork, music, etc. all on his own! Reading about the ups and downs of&nbsp;<em>Stardew Valley</em>&#8216;s development made me appreciate the game even more.</p>\n\n\n\n<p>A common theme in the book was how a lot of video game developers go through an insane amount of &#8220;crunch time&#8221; where they work an inhumane amount (100+ hours a week) for as long as a year to meet deadlines. It was timely too as <a href=\"https://kotaku.com/inside-rockstar-games-culture-of-crunch-1829936466\">many articles</a> had popped up about the insane amount of crunch that went into the development of Red Dead Redemption 2.</p>\n\n\n\n<p> I&#8217;d read about this before in gaming news sites, but did not realize just how bad and common it was. I can&#8217;t even imagine what it must be like to spend every waking moment towards your work with no time for family or extra activities. I really hope the video game industry can overcome this in the future.</p>\n\n\n\n<p><em>Blood, Sweat, and Pixels</em>&nbsp;was a great read and made me appreciate video games even more. Every gamer should read this book.&nbsp;</p>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<p>If I could rate this past October I would give it a solid A+. Now off to smoke a bowl, go Canada! 🇨🇦</p>\n\t\t","wordpress_id":6955},"allWordpressWpComments":{"edges":[{"node":{"content":"<p>Thanks for reading Dave! If you have any recommendations for video game books/documentaries, let me know! 🙂</p>\n","author_name":"tetchi","date":"November 3rd, 2018"}},{"node":{"content":"<p>Thanks for the book tip! Wish more people dropped little tidbits like that. After reading about the complex history of making Doom, and more recently a great essay on Asteroids, something more modern will be most welcome. Here is to one day be reading all about the schenanigans behind GTA!</p>\n","author_name":"Dave Lazar","date":"November 2nd, 2018"}},{"node":{"content":"<p>Thanks so much for reading Jeremy!! Hmmm man that&#8217;s such a good question&#8230; I&#8217;d love to design some sort of turn-based multiplayer game like Carcassonne but I lack the creativity and skill lol.</p>\n","author_name":"tetchi","date":"November 2nd, 2018"}},{"node":{"content":"<p>Thanks so much for reading pal 🙂</p>\n","author_name":"tetchi","date":"November 2nd, 2018"}},{"node":{"content":"<p>Love the constant learner aspect &#8211; what video game concept would you produce in your hypothetical independent indie studio?</p>\n","author_name":"jeremy kuzub","date":"November 1st, 2018"}},{"node":{"content":"<p>I love these updates! Thanks for writing them</p>\n","author_name":"Edward Ocampo-Gooding","date":"November 1st, 2018"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"october-2018-its-the-most-wonderful-time-of-the-year-edition","wordpressId":6955}}