{"data":{"wordpressPost":{"title":"July 2018: It&#8217;s Too Friggin Hot Edition","content":"<!--more-->\n\n<h2>Stuff that happened</h2>\n\n<p>I started July in my old hometown of Ottawa where I celebrated Canada Day with friends and family. And by celebrate, I mean hanging out in my friend&#8217;s air-conditioned condo avoiding the heat. A brutal heat wave had hit Ontario and Quebec right before Canada Day and lasted for a solid week. I don&#8217;t have air conditioning in my apartment so there were many nights in July where I got almost no sleep, making for a rough month.</p>\n\n<figure class=\"wp-block-image aligncenter\"><img src=\"https://www.tetchi.ca/wp-content/uploads/2018/08/kylea.jpg\" alt=\"\" class=\"wp-image-6739\" srcset=\"http://localhost:8888/wp-content/uploads/2018/08/kylea.jpg 1776w, http://localhost:8888/wp-content/uploads/2018/08/kylea-300x200.jpg 300w, http://localhost:8888/wp-content/uploads/2018/08/kylea-768x512.jpg 768w, http://localhost:8888/wp-content/uploads/2018/08/kylea-1024x683.jpg 1024w\" sizes=\"(max-width: 1776px) 100vw, 1776px\" />\n\t<figcaption>Cooling down with Kylea</figcaption>\n</figure>\n\n<p>Despite the shitty heat there was some good that came out of July. First, the Leafs signed <strong>John friggin&#8217; Tavares</strong>, one of the best centres in the NHL! I absolutely cannot wait to see him in blue and white come October. The centre depth of this team is going to be unreal.</p>\n\n<figure class=\"wp-block-image aligncenter\"><img src=\"https://www.tetchi.ca/wp-content/uploads/2018/07/john-tavares-as-a-leaf.jpg\" alt=\"\" class=\"wp-image-6685\" srcset=\"http://localhost:8888/wp-content/uploads/2018/07/john-tavares-as-a-leaf.jpg 1024w, http://localhost:8888/wp-content/uploads/2018/07/john-tavares-as-a-leaf-300x169.jpg 300w, http://localhost:8888/wp-content/uploads/2018/07/john-tavares-as-a-leaf-768x432.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />\n\t<figcaption>Is this real life? Photo credit: NHL.com</figcaption>\n</figure>\n\n<p>I also had a chance to meet up with <a href=\"http://markdunkley.com/\">Mark Dunkley</a>, an old friend and former coworker of mine. He was swinging by Montreal so we met up for some tasty ramen.</p>\n\n<p>Mark and I go way back. We both started at Shopify around the same time back in early 2009. I have fond memories of us at the old office, pumping out designs and crushing shawarmas. Mark would always have cool Photoshop tricks up his sleeves that I would learn and later abuse. I also admired how he wasn&#8217;t shy to criticize designs and provide constructive feedback. As a fresh web designer it was inspiring to work with him.</p>\n\n<p>To cap month off the month I went to a couple of comedy shows, including Dave Chappelle and John Mayer&#8217;s <em>Controlled Danger﻿</em>. <br/></p>\n\n<figure class=\"wp-block-image aligncenter\"><img src=\"https://www.tetchi.ca/wp-content/uploads/2018/07/controlled-danger.jpg\" alt=\"\" class=\"wp-image-6723\" srcset=\"http://localhost:8888/wp-content/uploads/2018/07/controlled-danger.jpg 1140w, http://localhost:8888/wp-content/uploads/2018/07/controlled-danger-300x103.jpg 300w, http://localhost:8888/wp-content/uploads/2018/07/controlled-danger-768x263.jpg 768w, http://localhost:8888/wp-content/uploads/2018/07/controlled-danger-1024x350.jpg 1024w\" sizes=\"(max-width: 1140px) 100vw, 1140px\" />\n\t<figcaption>Dave Chappelle with John Mayer. Image from hahaha.com</figcaption>\n</figure>\n\n<p>It was an interesting show to say the least. I enjoyed Dave&#8217;s standup bits but a good chunk of the show was banter between Dave and John. It had its moments but to be honest I would have preferred listening to more of just Dave. I was in stitches when I saw Dave perform on his own back in 2015, so I was a bit bummed out at how <em>Controlled Danger</em> turned out to be a much more mellow show. It was more like listening to a podcast than a comedy show. With that said I do think it&#8217;s cool that he is doing something different, and had I been more of a John Mayer fan I would have appreciated it more.</p>\n\n<h2>What&#8217;s on my mind</h2>\n\n<p>Lately I&#8217;ve been thinking a lot about <em>focus</em> and how I can get better at it. I find it extremely hard to focus on a single task in this day and age mainly due to social media and chat apps.<br/></p>\n\n<p>Personally I have a huge addiction to the social media site Reddit and chat apps such as Whatsapp and Telegram. I&#8217;ve developed a &#8216;twitch&#8217; to open a new browser tab and check if there&#8217;s been any updates or messages from friends, even with notifications disabled.</p>\n\n<p>Thus I embarked on a quest to nip this habit in the bud. I wanted to deliberately make it harder for distractions to take over my focus. The first thing I did was to start using an app called <a href=\"https://heyfocus.com/\">Focus</a>, which blocks distracting websites and apps. You make a blacklist of websites and apps to block, and once you enable &#8220;focus mode&#8221; it completely blocks them allowing you to focus on the task at hand.</p>\n\n<figure class=\"wp-block-image aligncenter\"><img src=\"https://www.tetchi.ca/wp-content/uploads/2018/07/focus-app-blocking-website.png\" alt=\"\" class=\"wp-image-6674\" srcset=\"http://localhost:8888/wp-content/uploads/2018/07/focus-app-blocking-website.png 2528w, http://localhost:8888/wp-content/uploads/2018/07/focus-app-blocking-website-300x199.png 300w, http://localhost:8888/wp-content/uploads/2018/07/focus-app-blocking-website-768x509.png 768w, http://localhost:8888/wp-content/uploads/2018/07/focus-app-blocking-website-1024x679.png 1024w\" sizes=\"(max-width: 2528px) 100vw, 2528px\" />\n\t<figcaption>Focus app in action. A distracting website is blocked and an inspirational quote is shown in its place.</figcaption>\n</figure>\n\n<p>There&#8217;s even a &#8220;hardcore mode&#8221; that prevents you from disabling focus mode for a set amount of time. I&#8217;ve been using this feature and it&#8217;s worked wonders. It&#8217;s helped me catch my twitches on numerous occasions.</p>\n\n<p>Second, I started purposely putting my phone further away from me both at work and at home so that I don&#8217;t check it so damn often. I have always been good at not using my phone when I&#8217;m interacting with another person. When I&#8217;m on my own though, I still tend to check Reddit and chats unnecessarily often. In attempt to remedy this, I started putting my phone somewhere out of reach; at work I keep my phone in my backpack and at home I&#8217;ll leave it on the kitchen counter. I also stopped taking my phone into the bedroom at night so that I don&#8217;t fiddle with it before sleeping.</p>\n\n<p>What I&#8217;m starting to notice is that nothing is really important enough that it deserves my immediate attention. I&#8217;ve always had this urge to get back to people right away (maybe due to my customer support past), but people are generally okay with waiting. Of course there&#8217;s always the chance of an emergency, so I still allow myself to check my phone and messages every hour or so. I&#8217;m going to keep trying this until I eliminate my habit of checking Reddit and chat apps subconciously.<br/></p>\n\n<h2>What I read</h2>\n\n<p>This month I read <em>Eat That Frog: 21 Great Ways to Stop Procrastinating and Get More Done in Less</em> Time. </p>\n\n<figure class=\"wp-block-image aligncenter\"><img src=\"https://www.tetchi.ca/wp-content/uploads/2018/07/eat-that-frog.jpg\" alt=\"Eat that Frog! Book cover\" class=\"wp-image-6662\" srcset=\"http://localhost:8888/wp-content/uploads/2018/07/eat-that-frog.jpg 307w, http://localhost:8888/wp-content/uploads/2018/07/eat-that-frog-194x300.jpg 194w\" sizes=\"(max-width: 307px) 100vw, 307px\" /></figure>\n\n<p><em>Eat that Frog!</em> goes over techniques on how to overcome procrastination and strengthen self-discipline. The &#8220;frog&#8221; in the title is a metaphor for the  most important task you need to do, and the author goes over the importance of completing that task first over any other low-value tasks. </p>\n\n<p>I enjoyed this book because it went hand-in-hand with my thoughts on focus that I wrote about earlier in this post. I walked away from the book with some techniques that I could start using right away, including:</p>\n\n<ul>\n\t<li>Find the &#8216;frog&#8217;; in other words, prioritize my tasks better</li>\n\t<li>Plan every day in advance</li>\n\t<li>Think harder about the consequences of not completing an important task</li>\n\t<li>Break down harder tasks into smaller, more digestible tasks and delegate if necessary (when facing a &#8216;big frog&#8217; I tend to get intimidated and become more susceptible to distractions)</li>\n\t<li>Don&#8217;t let technology prevent me from completing tasks, but instead use it to boost productivity (ex. using Focus to block distractions).</li>\n</ul>\n\n<p>A lot of the content boils down to &#8220;stop frigging around and do what you&#8217;re supposed to do&#8221;, which may turn off some readers who may think it&#8217;s just another book that rehashes common sense. Personally I liked that it contained actionable techniques that I&#8217;ve never tried. I would recommend this book if you need a bit of a push in the self-discipline department.</p>\n\n<hr class=\"wp-block-separator\" />\n\n<p>That&#8217;s it for July. Stay cool! ⛄️</p>\n","wordpress_id":6656},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"july-2018-its-too-friggin-hot-edition","wordpressId":6656}}