{"data":{"wordpressPost":{"title":"Japan Trip 2015 Part 6: Tokyo","content":"<p>\t\t\t\tTokyo is where our trip started to get nutty. Our days became exponentially more alcohol-fuelled and sleep became more and more scarce.</p>\n<p><!--more--></p>\n<h3>Shinjuku &amp; Shibuya</h3>\n<p>On the first night in Tokyo we met up with my good friend Kie. She took us to an unreal <a href=\"https://en.wikipedia.org/wiki/Motsunabe\">motsunabe</a> restaurant in Shibuya.</p>\n<p>The black door you see in the Street View below is the entrance to said Motsunabe joint. There is no signage for the restaurant except for that red, tiny doorbell-looking thing to the left. We were a bit sketched out by this, but the inside of the restaurant was actually super nice.</p>\n<p style=\"text-align: center;\">\n<iframe src=\"https://www.google.com/maps/embed?pb=!1m0!3m2!1sen!2sca!4v1447621064664!6m8!1m7!1sxbT7ndn29LNCbffyImYeeg!2m2!1d35.65898919291757!2d139.696686396353!3f294.3208171247488!4f-6.202215081680976!5f0.7820865974627469\" width=\"600\" height=\"450\" frameborder=\"0\" style=\"border:0\" allowfullscreen></iframe>\n</p>\n<p>Motsunabe is a type of hotpot, usually consisting of beef and pork tripe. What&#8217;s insane is that it only ran us about 4000 yen each for a full-course meal and all-you-can-drink beers and liquor. Pretty sweet deal if you ask me! I found eating out in Japan extremely cheap for the quality and quantity of food you get.</p>\n<p><img src=\"https://tetsuro.github.io/tetsby-wordpress-playground/wp-content/uploads/2015/11/motsu_nabe.jpg\" alt=\"motsu_nabe\" /></p>\n<div class=\"sub\">GG motsunabe. Soooo good.</div>\n<p>Needless to say we had way too many drinks there and went for more afterwards. The next morning was brutal.</p>\n<p><img src=\"https://tetsuro.github.io/tetsby-wordpress-playground/wp-content/uploads/2015/11/jared_dying.jpg\" alt=\"Dig deep Jared\" /></p>\n<div class=\"sub\">Morning after. Dig deep, Jared! Dig deep!!</div>\n<h3>Hallowe&#8217;en in Shibuya</h3>\n<p>People in Tokyo definitely don&#8217;t mess around when it comes to Hallowe&#8217;en. Shibuya was PACKED with people dressed up in ridiculous costumes. We were still pretty dead from the night before but we mustered up the energy to go out once more.</p>\n<p style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.250%;\"><iframe src=\"https://streamable.com/e/wmyr?logo=0\" frameborder=\"0\" allowfullscreen webkitallowfullscreen mozallowfullscreen scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\"></iframe></p>\n<p>We picked up some masks at a <a href=\"http://www.donki.com/en/\">Donki shop</a> nearby to join in on the Hallowe&#8217;en festivities. I picked up a storm trooper mask, which was probably the shittiest decision on hindsight as I could barely see anything, let alone fucking breathe.</p>\n<p>In the evening we went over to a club called Legato for a <a href=\"http://thetindermansion.peatix.com/\">Tinder-sponsored Hallowe&#8217;en event</a>. It was an absolute shitshow &#8211; there were soooo many people!</p>\n<p><img src=\"https://tetsuro.github.io/tetsby-wordpress-playground/wp-content/uploads/2015/11/halloween_in_shibuya.jpeg\" alt=\"Halloween in Shibuya\" /></p>\n<div class=\"sub\">Hallowe&#8217;en clubbin&#8217; feat. awkward floating hand</div>\n<p>There was a costume contest in which Gary somehow managed to win with a girl that was also dressed as Kiki. We thought it was hilarious how Gary, with a costume that he bought thirty minutes prior to going to the club, beat the dude in the custom-made Facebook Like button costume. That guy was probably salty as hell, hahaha!</p>\n<p style=\"width: 100%; height: 0px; position: relative; padding-bottom: 57.500%;\"><iframe src=\"https://streamable.com/e/b482?logo=0\" frameborder=\"0\" allowfullscreen webkitallowfullscreen mozallowfullscreen scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\"></iframe></p>\n<div class=\"sub\">Kiki Gary and another Kiki shortly before winning the contest</div>\n<p>I could barely see anything or breathe in my stupid mask, but I had a great time. The music was awesome and the overall vibe was fantastic.</p>\n<h3>Shopping in Ginza, Shinjuku &amp; Harajuku</h3>\n<p>When we weren&#8217;t drinking we spent a lot of time shopping. I wasn&#8217;t planning on spending too much money on shopping, but that changed when we hit up Ginza, Shinjuku and Harajuku. There are too many cool shops in Tokyo to check out. Some of my favourite spots were:</p>\n<ul>\n<li><a href=\"http://www.graniph.com/\">Graniph</a> for dope graphic and button-up shirts. I copped a <em>The Very Hungry Caterpillar</em> button-up there that is now one of my favourite shirts to wear. </li>\n<li><a href=\"https://www.tetchi.ca/b-side-label-and-foo-rider/\">B-Side Label</a> for cool stickers and pins. I wrote about this shop <a href=\"/b-side-label-and-foo-rider/\">a while back</a>, and it looks like they&#8217;ve added more illustrators to their lineup since. </li>\n<li><a href=\"http://www.uniqlo.com/\">Uniqlo</a> for affordable, quality casual wear. Stocked up nicely on dat <a href=\"http://www.uniqlo.com/us/men/heattech.html\">HEATTECH</a> for the harsh Canadian winter. I recommend checking out the humongous shop in Ginza, it&#8217;s got nine floors of Uniqlo goodness.</li>\n</ul>\n<p><img src=\"https://tetsuro.github.io/tetsby-wordpress-playground/wp-content/uploads/2015/11/b-side.jpg\" alt=\"b-side label in harajuku\" /></p>\n<div class=\"sub\">B-Side Label in Harajuku. Photo by Gary.</div>\n<p>At the end of the Tokyo trip, Gary, Mikey, Sharhan and I took a train to Osaka while Minh and Jared stayed in Tokyo (their flight back home was from Narita so it made sense for them to stay there). It was a little bittersweet to split up with them after spending a few weeks together. It was a stark reminder that we&#8217;d have to go back to our every day lives soon.</p>\n<h3>Takeaways</h3>\n<ul>\n<li>People in Tokyo don&#8217;t mess around when it comes to Hallowe&#8217;en. Shibuya was one hell of a party spot. </li>\n<li>If you&#8217;re into shopping be sure to check out Shibuya and Harajuku. </li>\n<li>Make sure you stock up on HEATTECH gear if you go to Uniqlo, they&#8217;ll keep ya nice and warm in the winter. </li>\n<li>For the love of God eat motsunabe.</li>\n</ul>\n<hr />\n<p><a href=\"/japan-trip-2015/\">← Back to Japan Trip 2015 index</a>\t\t</p>\n","wordpress_id":4277},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"japan-trip-2015-part-6-tokyo","wordpressId":4277,"newerPostSlug":"japan-trip-2015-part-7-back-to-osaka","olderPostSlug":"time-stories-a-board-game-experience-like-no-other"}}