{"data":{"wordpressPost":{"title":"June 2018: World Cup Fever Edition","content":"<!--more--><html><head></head><body><h2>Stuff that happened</h2>\n\n\n\n<p>June was filled with a lot of hype events, like Apple&#x2019;s WWDC, the E3 Gaming Expo, and the NHL Draft, but all of these paled in comparison to the World Cup. Admittedly I&#x2019;m not a regular soccer watcher, but when the World Cup rolls around I can&#x2019;t help but cheer for the Samurai Blues (aka Team Japan). I never have very high expectations for them so it makes watching the games fun and stress-free.</p>\n\n\n\n<p>I caught the games at the nearby <a href=\"http://www.cafeolimpico.com/\">Caf&#xE9; Olympico</a>&#xA0;or during the weekdays we&#x2019;d stream them at the office. I loved getting together with people of different nationalities and engaging in friendly chirping.</p>\n\n\n\n<p>The Japan vs. Senegal match in particular was super fun to watch. I loved how Japan never gave up and competed really hard against the Senegalese, who looked to be twice their size. The icing on top was this play below by a Japanese supporter; I laughed so hard when I saw this live.</p>\n\n\n\n<figure class=\"wp-block-image aligncenter\"><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2018/06/japan-header.gif\" alt class=\"wp-image-6296\">\n\t<figcaption>Fantastic header by a Japanese supporter.</figcaption>\n</figure>\n\n\n\n<p>Seeing Japan drop their 2-0 lead and lose to Belgium in the final minutes was heartbreaking, but as a Leafs fan I was prepared for the collapse. It was still an exciting match and I&#x2019;m happy that Japan made it past the group stages. They played extremely competitively and I really appreciate how little they dove and flopped around on the ground.</p>\n\n\n\n<h2>Front end development learnings&#xA0;</h2>\n\n\n\n<p>This month I spent&#xA0;some time getting more familiar with&#xA0;<a href=\"https://reactjs.org/\">React</a>. I&#x2019;ve dabbled with it here and there but I&#x2019;d never used it for my own project. As a challenge for myself I decided to recreate my <a href=\"https://tetsuro.github.io/mtl-murals/\">MTL Murals</a> project using React.</p>\n\n\n\n<p>It was a pretty frustrating experience at first because I had to learn the ins and outs of how React works. Some of the challenges I&#xA0;encountered include:</p>\n\n\n\n<ul>\n\t<li>Figuring out how to use external libraries in a React project (Google Maps JS API in this case)</li>\n\t<li>Deciding what should and shouldn&#x2019;t be a component</li>\n\t<li>Figuring out how to pass data from child to parent</li>\n\t<li>Deciding where to store state</li>\n\t<li>Fixing infinite loops caused by doing&#xA0;<code>setState()</code> in the wrong spot<br></li>\n\t<li>Etc, etc&#x2026;</li>\n</ul>\n\n\n\n<p>After experimenting with some NPM packages, I ended up using&#xA0;<a href=\"https://www.npmjs.com/package/google-maps-react\">google-maps-react</a>&#xA0;(not to be confused with <a href=\"https://github.com/google-map-react/google-map-react\">google-map-react</a>). I found that it had the best documentation and it included everything I needed from the <a href=\"https://developers.google.com/maps/documentation/javascript/tutorial\">Google Maps API</a>.</p>\n\n\n\n<p>It was also a good exercise in reading through a codebase. For example, I came to a point where I needed a particular Google Maps event called <code>bounds_changed</code>, but could not find it anywhere in <strong>google-map-react</strong>&#x2018;s documentation. I was discouraged at first, but then I started digging into the NPM package&#x2019;s codebase and stumbled across an <a href=\"https://github.com/fullstackreact/google-maps-react/blob/master/src/index.js#L22\">array of Google Maps events</a>. I then noticed that each event was camelized and prepended with <code>on</code>, so I tried putting <code>onBounds_changed</code>&#xA0;to my React component. Lo and behold, it worked like a charm! Past me would have given up and looked for another package, for sure.</p>\n\n\n\n<p>All in all I was able to make good progress on the conversion to React this month. The styling hasn&#x2019;t been polished yet but it is feature-complete. (you can check out the React-ified branch <a href=\"https://github.com/Tetsuro/mtl-murals/tree/react-google-maps\">here</a>). I really enjoyed working with React and will continue to mess around with it in the coming months!</p>\n\n\n\n<figure class=\"wp-block-image aligncenter is-resized\"><a href=\"http://exercism.io/\"><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2018/06/exercism-logo.png\" alt class=\"wp-image-6334\" width=\"423\" height=\"62\" srcset=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2018/06/exercism-logo.png 686w, https://www.tetchi.ca/tetchi/wp-content/uploads/2018/06/exercism-logo-300x44.png 300w\" sizes=\"(max-width: 423px) 100vw, 423px\"></a></figure>\n\n\n\n<p>In other news, I also signed up as a mentor on <a href=\"http://exercism.io/about\">exercism.io</a>, an open-source learning centre. My task will be to help learners out with any Javascript questions. I think this will be a great learning opportunity for me as I&#x2019;ll get to confirm what I know about Javascript and work with other mentors on providing feedback on code. I&#x2019;m hoping to write more about this experience next month. If mentoring sounds like something that interests you too, be sure to check out&#xA0;<a href=\"http://mentoring.exercism.io/\">mentoring.exercism.io</a>!</p>\n\n\n\n<h2>Musical learnings</h2>\n\n\n\n<p>I&#x2019;m happy to say that I&#x2019;ve gotten over my slump of not wanting to practice my bass. I realized that I was practicing too much of the same thing, so I decided to embark on a new challenge: <strong>learn how to sight read</strong>.</p>\n\n\n\n<p>Being able to sight read would so damn cool. Just imagine picking up a sheet of music that you&#x2019;ve never seen before, and knowing right away how to play it. How cool would that be!? It would be such a handy skill to have along with my jazz improvisation chops. It&#x2019;ll be a long road, but I think it&#x2019;ll be worth it.</p>\n\n\n\n<p>I still haven&#x2019;t gotten together with the jazz guys that I used to play with regularly, but I can&#x2019;t let that get to my head. I need to keep learning and improving on my own time so that when we do jam again I will have some new tricks up my sleeve.&#xA0;</p>\n\n\n\n<h2>What I read</h2>\n\n\n\n<figure class=\"wp-block-image aligncenter is-resized\"><img src=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2018/05/elon-musk-book.jpg\" alt class=\"wp-image-6115\" width=\"278\" height=\"419\" srcset=\"https://www.tetchi.ca/tetchi/wp-content/uploads/2018/05/elon-musk-book.jpg 331w, https://www.tetchi.ca/tetchi/wp-content/uploads/2018/05/elon-musk-book-199x300.jpg 199w\" sizes=\"(max-width: 278px) 100vw, 278px\"></figure>\n\n\n\n<p>This month I read&#xA0;<a href=\"https://www.amazon.ca/Elon-Musk-SpaceX-Fantastic-Future/dp/0062301233/ref=sr_1_1?ie=UTF8&amp;qid=1530730647&amp;sr=8-1&amp;keywords=elon+musk\"><em>Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future</em></a>&#xFEFF; by Ashlee Vance.</p>\n\n\n\n<p>It was cool to learn about the ups and downs of Musk&#x2019;s career, from his early success with Paypal to the multiple encounters with bankruptcy at both Tesla and SpaceX. It was inspiring to see how he turned both the automotive and aerospace industries around after decades of stagnancy.</p>\n\n\n\n<p>I liked how the book was not just praise and explored Musk&#x2019;s controversial side as well. He is known for overworking his employees, firing even the most loyal employees, setting extremely unrealistic deadlines and expectations&#x2026; the list goes on. The way he treats others is certainly questionable, but the author explains how Musk does this to to push the limits of his workers and achieve his ultimate goal of getting humans to Mars.&#xA0;</p>\n\n\n\n<p><em>Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future</em>&#xA0;was a great read. It&#x2019;s made me more interested in what Tesla, SpaceX and SolarCity will be releasing in the future, and made me hopeful that I&#x2019;ll get to see humans reach Mars in my lifetime.</p>\n\n\n\n<hr class=\"wp-block-separator\">\n\n\n\n<p>That&#x2019;s all for June, happy St Jean Baptiste &amp; Canada Day! &#x1F1E8;&#x1F1E6;</p>\n\t\t</body></html>","wordpress_id":6109},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"june-2018-world-cup-fever-edition","wordpressId":6109,"newerPostSlug":"july-2018-its-too-friggin-hot-edition","olderPostSlug":"may-2018-moroccnroll-edition"}}