{"data":{"wordpressPost":{"title":"February 2018: Feline Festivities Edition","content":"<p>\t\t\t\t<!--more--></p>\n<h2>Stuff that happened</h2>\n<p>February started off on a good note. I met up with my friends from back in Ottawa in Tremblant for a little weekend getaway. For a while now we&#8217;ve been renting a chalet in Mont Tremblant once every winter to snowboard, hot-tub, and have a good time (although this time I just hot-tubbed). It just so happened that it was the Super Bowl that weekend too, so it was fun to see my pal Gary witness his Eagles win the championship. Happy for you, bud!</p>\n<p>Also, my cat Haku turned <strong>10 years old</strong> on the 14th! Pretty much an old lady now in cat years. It&#8217;s crazy to think that we&#8217;ve been together for 10 years now. She was always by my side through all the ups and downs in my life. Thanks for hanging out ya fuzzball!</p>\n<p><img src=\"https://www.tetchi.ca/wp-content/uploads/2018/03/topsy-turvy.jpg\" alt=\"upside down cat\" /></p>\n<p>Finally, a cool thing happened near the end of the month, when a new Shopify employee sent me the following message on Slack:</p>\n<blockquote><p>\nI&#8217;m just writing to say a big &#8220;thanks&#8221;. You probably don&#8217;t remember me, as it was a long time ago, but when I was first starting out with Shopify (7 years ago), your tutorials and forum posts helped me immensely. Anyway, nice to be on the other side of the fence now, having come from an agency background. Shopify has been amazing so far! I&#8217;ll keep it short but just wanted to say hi and thanks.\n</p></blockquote>\n<p>(Some parts removed for privacy reasons). These kind of messages make me smile from ear to ear. I&#8217;m so happy that I was able to play a little part on his journey. I&#8217;d love to do write more tutorials in the future.</p>\n<h2>Things I learned</h2>\n<p>This month I played around with Google&#8217;s <a href=\"https://developers.google.com/web/tools/puppeteer/\">Puppeteer</a> library. Puppeteer is a NodeJS library that makes controlling headless Chrome simple as pie. My next step is try and deploy it somewhere so that I can schedule a scraping task&#8230; although I&#8217;ve been having trouble figuring out how to do this. I&#8217;ve tried both Heroku and Zeit&#8217;s Now for this, but haven&#8217;t had any success. I might just stick to doing things locally for now.</p>\n<h2>What&#8217;s on my mind</h2>\n<p>This month I got a little more uncomfortable by committing to play a show with the jazz trio that I play in. I was hesitant to play the show, for the following reasons:</p>\n<p>A) It&#8217;s been a long time since we&#8217;ve played a real show (our bi-weekly jams at the bar are pretty chill and don&#8217;t have much of an audience).</p>\n<p>B) I&#8217;m re-learning the way I improvise to songs to better respect the chords that are in a tune.</p>\n<p>But then I remembered, getting uncomfortable is good! At first I was feeling stressed for the show, but it forced me to practice like crazy. I can already see improvement in my playing when I listen to recordings of our practice sessions. Lighting a bit of fire under your ass can be really helpful sometimes. I&#8217;m now feeling pretty comfortable with roughly three weeks left until the show.</p>\n<p>We&#8217;ll be playing at <a href=\"http://barentrenous.com/\">Bar Entre Nous</a> on Saturday, March 17th, so come on down if you&#8217;re into jazzy goodness!</p>\n<h2>What I read</h2>\n<p style=\"text-align: center;\"><img src=\"https://www.tetchi.ca/wp-content/uploads/2018/03/escape-from-camp-14.jpg\" alt=\"\" /></p>\n<p>This month I read <em>Escape from Camp 14</em> is the biography of Shin Dong-hyuk, a North Korean man who escaped from a prison camp.</p>\n<p><em>Escape from Camp 14</em> was one of those books that makes you want to hug your loved ones after. The beatings, tortures, hunger, and emotional abuse that Shin went through in the North Korean prison camp really made me feel sick.</p>\n<p>The part that irked me the most was when Shin ratted on his own family hoping to get rewarded with food. You can&#8217;t blame him for his actions; he was brought up in an environment where snitching on friends and family to the guards was encouraged. I couldn&#8217;t help but imagine what I would do if my family and I were in his shoes. Would I rat on my mom and brother if it meant I could eat?</p>\n<p>What&#8217;s sad is that these prison camps still exist but are seldom brought up in the media. There is a general sense of indifference towards North Korean inhabitants for reasons covered later in the book. I really feel for these prisoners and feel helpless about it <img class=\"emoji\" draggable=\"false\" src=\"https://s.w.org/images/core/emoji/2.4/svg/1f61e.svg\" alt=\"😞\" />. The least I can do is to try and raise awareness about it with people I know.</p>\n<h2>What I&#8217;m playing</h2>\n<p>After 100% completing Mario Odyssey, I picked up <em>Celeste</em>, a <em>brutally</em> hard platforming game by the creators of Towerfall. I have a bit of a love-hate relationship with this game, as some of the levels are difficult to the point where I feel like snapping my Switch in half. But the feeling of completing a hard level is oh-so satisfying. I really dig the exploratory aspect of the game too, as there are many hidden paths and secrets to be discovered.</p>\n<style>.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }</style>\n<div class=\"embed-container\"><iframe src=\"https://www.youtube.com/embed/iofYDsA2yqg\" width=\"300\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></div>\n<p>Celeste is the hardest platformer I&#8217;ve ever played, even surpassing Donkey Kong: Tropical Freeze. Also it&#8217;s like $20! It&#8217;s criminally underpriced for the amount of gameplay you get.</p>\n<hr />\n<p>Thanks for reading! Off to do my taxes&#8230;\t\t</p>\n","wordpress_id":5412},"allWordpressWpComments":{"edges":[]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"february-2018","wordpressId":5412,"newerPostSlug":"march-2018-smarch-in-smashville-edition","olderPostSlug":"january-2018"}}