{"data":{"wordpressPost":{"title":"T.I.M.E Stories &#8211; a board game experience like no other","content":"<p>The other day, two of my friends and I played a board game called <a href=\"http://www.spacecowboys.fr/time-stories\">T.I.M.E Stories</a> by Space Cowboys. I&#8217;ve played some crazy good board games in my life but this is the first one where I was like &#8220;shit, I need to tell people about this&#8221;. T.I.M.E Stories is hands down the most immersive board game I&#8217;ve ever played.</p>\n<style>.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }</style>\n<p class='embed-container'><iframe src='https://www.youtube.com/embed/pRlNX-MJaf4' frameborder='0' allowfullscreen></iframe></p>\n<p><!--more--></p>\n<p>T.I.M.E Stories is a consumable game. You can only play it once since you&#8217;ll know all the secrets after you beat it. You cooperate with up to three other people to try and solve a mystery. The best way I can describe this game is an <a href=\"https://en.wikipedia.org/wiki/Real-life_room_escape\">escape room</a> in board game form.</p>\n<p>The story goes down like this: you and your friends are what they call <em>temporal agents</em>, and you&#8217;re sent back in time to prevent temporal faults. The story that comes with the base box takes place in a French insane asylum in the 1920s. You take over the body of an insane asylum patient, each with their own unique abilities. For example, in my play-through I played as a cannibal girl who can eat enemies to recover HP.</p>\n<p>You explore the asylum with your friends to find clues about the temporal fault. There&#8217;s a time tracker that ticks down every time you take an action (such as exploring an area in a room, going to a new room, or fighting), and when it hits zero you get sent back in time to redo the &#8220;run&#8221;. Every time you redo a run you have more knowledge of where to go, what to avoid, and where the key items are, so you can plan accordingly with your friends. It&#8217;s kind of like that movie <a href=\"http://www.imdb.com/title/tt1631867/\">Edge of Tomorrow</a> with Tom Cruise, where he is able to reset time to figure out the best course of actions.</p>\n<p>What&#8217;s cool about T.I.M.E Stories is that what seemed like useless information on your first run might become super important later on. Furthermore, there can be several clues hidden in the actual artwork of an area that you might not catch right away. I wish I could provide some actual examples but I can&#8217;t do so without spoiling anything.</p>\n<p>Beating up bad guys and solving puzzles with your friends makes for mind-blowing moments and a huge sense of accomplishment. We were beaming after we beat the game.</p>\n<p>If you&#8217;re in to role playing games or escape rooms, you <strong>HAVE</strong> to play T.I.M.E Stories.</p>\n<hr />\n<p><em>Shoutouts to my cousin Jun who always introduces me to the dopest board games.</em></p>\n","wordpress_id":4602},"allWordpressWpComments":{"edges":[{"node":{"content":"<p>@Edward super-duper recommended! You should play with Kyle P 😀</p>\n","author_name":"tetchi","date":"2016-02-06T19:23:44.000Z"}},{"node":{"content":"<p>Sounds awesome! I’ve got to check this out!</p>\n","author_name":"Edward","date":"2016-02-04T17:55:39.000Z"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"time-stories-a-board-game-experience-like-no-other","wordpressId":4602}}