{"data":{"wordpressPost":{"title":"2014 so far","content":"<p>Man, haven&#8217;t written here in over a year! I think this is a good time to share how this year&#8217;s been for me so far.</p>\n<p><!--more--></p>\n<h2>1. Big changes at work</h2>\n<p>For about 3 of my 5.5 years so far at Shopify, I was the lead of the Design Guru team at Shopify. Design Gurus are responsible for helping merchants out with theme-related issues. Around March, I decided to step down as team lead, join the Self-Help team to fix up Shopify&#8217;s Theme Docs.</p>\n<p>Shopify&#8217;s Theme Docs were a mess. Here are some things that were wrong with it:</p>\n<ul>\n<li>Missing information on variables, filters, objects, etc.</li>\n<li>Inconsistent language (ex: using the word &#8220;variable&#8221; and &#8220;tag&#8221; interchangeably) </li>\n<li>Could not link to a specific attribute </li>\n<li>Horrible code examples</li>\n</ul>\n<p>I could go on and on about what was wrong with the old Theme Docs but I&#8217;ll stop there. I went knee-deep in the Theme Docs to revamp it, and just shipped it last month. The new Theme Docs can be found at <a href=\"http://docs.shopify.com/themes\" target=\"_blank\">docs.shopify.com/themes</a>. Feel free to shoot me a note if you notice anything odd! I&#8217;m also going to be updating the <a href=\"http://shopify.github.io/liquid/\" target=\"_blank\">core Liquid Docs</a> in my spare time.</p>\n<p>Now that the Theme Docs are done, I&#8217;ve moved on to a new team to work on a new feature. I&#8217;m getting my hands dirty with UI design, which is something I&#8217;ve never done. It&#8217;s a little intimidating being in a team with a bunch of really smart dudes, but I see it as a great learning opportunity. I look forward to learning from the super-talented designers on the team, <a href=\"https://twitter.com/nilo\">Nick</a> and <a href=\"https://twitter.com/alistair_lane\">Ally</a>.</p>\n<h2>2. The band</h2>\n<p>Last September I got together with my buds Kev and Micky to start a blues-rock band called <a href=\"http://listentohunter.com/\">HUNTER</a>. Last week we had our first ever show at <a href=\"http://therainbow.ca\">The Rainbow</a> and it was awesome! Great venue, great crowd, awesome times.</p>\n<p><img src=\"https://www.tetchi.ca/wp-content/uploads/2014/08/hunter.jpg\" alt=\"hunter\" width=\"802\" height=\"802\" class=\"alignnone size-full wp-image-3959\" srcset=\"http://localhost:8888/wp-content/uploads/2014/08/hunter.jpg 802w, http://localhost:8888/wp-content/uploads/2014/08/hunter-150x150.jpg 150w, http://localhost:8888/wp-content/uploads/2014/08/hunter-300x300.jpg 300w, http://localhost:8888/wp-content/uploads/2014/08/hunter-768x768.jpg 768w\" sizes=\"(max-width: 802px) 100vw, 802px\" /></p>\n<div class=\"sub\">HUNTER @ The Rainbow</div>\n<p>We&#8217;ve got two more shows lined up in Ottawa, August 14th at Zaphod&#8217;s and September 26th at Lunenberg Pub &amp; Bar. If you enjoy rock and/or rolling, come on out! We also have some recordings that are currently being mixed/mastered, can&#8217;t wait for that to be done!</p>\n<h2>3. Gaming</h2>\n<p>I picked up a Wii U a few months ago, and it&#8217;s freaking great. Donkey Kong: Tropical Freeze is the best game I&#8217;ve played so far this year. Some of the levels are hard as f*ck but tremendously satisfying when you beat em. There&#8217;s a level called &#8220;Bopopolis&#8221; that seriously took me 91 lives to beat. David Wise (the composer of the SNES Donkey Kong Country games) does a killer job with the soundtrack too.</p>\n<style>.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }</style>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/2Jk6bzXPVhQ' frameborder='0' allowfullscreen></iframe></div>\n<p>I&#8217;ve been trying to get back into Battlefield 4, but it just doesn&#8217;t feel as fun anymore. Don&#8217;t get me wrong, I still enjoy playing with buddies, but I don&#8217;t feel like it&#8217;s a huge upgrade over Battlefield 3. I bought it on day one because I&#8217;m a BF fanboy but I didn&#8217;t get <a href=\"https://www.tetchi.ca/battlefield-3/\">the same thrill</a> as the first time I played Battlefield 3. The map &#8220;Operation Locker&#8221; is absolutely the worst map I&#8217;ve ever played in any FPS game. Whenever a server would switch maps and the next map was Operation Locker, I would just turn my computer off and go play with my cat or some shit.</p>\n<h2>4. Books</h2>\n<p>I&#8217;ve done a good job at keeping up my reading habit (woo!). Here are some quick reviews of my favourite books so far this year:</p>\n<h3>Django: The Life and Music of a Gypsy Legend</h3>\n<p>I picked this book up because I wanted to learn about my favourite jazz musician, Django Reinhardt. He was pretty arrogant and kind of a douche in a lot of people&#8217;s eyes, but it was cool to see how he revolutionized the jazz scene in Paris. His guitar work is impressive considering he mangled his fretting hand in a caravan fire accident.</p>\n<h3>Stench of Honolulu</h3>\n<p>Stench of Honolulu is the funniest book I&#8217;ve read in a while. The book follows the story of a guy adventuring in Hawaii to find a treasure called &#8220;The Golden Monkey&#8221;. It&#8217;s a very short read, highly recommended if you want a good laugh.</p>\n<h3>An Astronaut&#8217;s Guide to Life on Earth</h3>\n<p>Chris Hadfield&#8217;s autobiography. Great book, lots of good life lessons, and I admire how humble he is about his accomplishments. Bonus points for being a Leafs fan too. I would do anything to drink some beers at a Leafs game with Cmdr. Hadfield.</p>\n<p>Oh and also, Amazon Kindles are the bomb diggity. I can&#8217;t stop reading since picking one up. I love that I can read in the dark now without destroying my ocular balls.</p>\n<hr/>\n<p>All in all it&#8217;s been a pretty good year, though I haven&#8217;t travelled all that much yet. I&#8217;m going to be going back to Brighton, UK for <a href=\"http://reasons.to/\">Reasons To</a> next month, that should be fun! I&#8217;d also like to go back to Okinawa, Japan to see my new nephew for the first time.</p>\n<p>That&#8217;s it for now, PEACE</p>\n<p>tetchi</p>\n","wordpress_id":3952},"allWordpressWpComments":{"edges":[{"node":{"content":"<p>Thanks for the note Amandeep! API Docs are being worked on as well, we&#8217;re working hard to make our documentation awesome across the board! Thank you very much for checking out my blog 🙂</p>\n"}},{"node":{"content":"<p>Yeah Shopify themes documentation is now quite improved.  But I feel Shopify API documentation needs to be improved a bit more. I read your blog for learning shopify tricks/techniques.  Looking forward to see more posts from you !!</p>\n"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"2014-so-far","wordpressId":3952}}